/*
脚本：转运抽奖机器
作者：SV079MS冒险岛
时间：2019.10.31修改
*/

status = -1;
var itemList = new Array(

/*[1402214, 0.0001, 1, 1],//红色双手剑
	[1382226, 0.001, 1, 1]//红武
	[1472230, 0.001, 1, 1],//红色拳甲
	[1462208, 0.001, 1, 1],//红色之弩
	[1452220, 0.001, 1, 1],//红色弓
	[1422156, 0.001, 1, 1],//红锤
	[1092050, 1, 1, 1],
	[1302142, 10, 1, 1],
	[1352280, 2, 1, 1],
	[1352281, 1, 1, 1],
	[1402039, 10, 1, 1],
	[1402062, 5, 1, 1],
	//[1132084, 10, 1, 1],
//[1132085, 5, 1, 1],
//[1132086, 5, 1, 1],
//[1132087, 5, 1, 1],
//[1132088, 5, 1, 1],
//[1132228, 1, 1, 1],//
//[1132287, 1, 1, 1],//110级腰带
    [1402085, 10, 1, 1],
    [1402175, 10, 1, 1],
    [1402086, 10, 1, 1],
    [1452102, 8, 1, 1],
    [1452103, 6, 1, 1],
    [1452104, 4, 1, 1],
	[1012420, 5, 1, 1],//雪糕
	[1012416, 5, 1, 1],//雪糕
	[1132135, 5, 1, 1],//希望之树之传说腰带115级
	[1112597, 2, 1, 1],//140戒指
    [1452105, 2, 1, 1],
    [1452106, 0.5, 1, 1],//107级
	[1442139, 0.001, 1, 1],//神矛110级
    [1462087, 10, 1, 1],//127级
    [1462088, 8, 1, 1],
    [1462089, 4, 1, 1],
    [1462090, 2, 1, 1],
    [1402087, 8, 1, 1],
    [1402088, 6, 1, 1],
    [1402089, 4, 1, 1],
    [1402090, 2, 1, 1],
    [1302143, 10, 1, 1],
    [1302144, 8, 1, 1],
    [1302145, 6, 1, 1],
    [1302146, 4, 1, 1],
    [1302147, 2, 1, 1],//至尊单手剑
	[1312062, 2, 1, 1],//至尊单手斧
	[1442111, 6, 1, 1],//至尊矛
    [1092072, 10, 1, 1],
    [1092077, 20, 1, 1],
    [1092082, 20, 1, 1],
    [1472111, 20, 1, 1],
    [1472117, 1, 1, 1],
    [1472051, 1, 1, 1],
    [1472052, 1, 1, 1],
    [1472055, 10, 1, 1],
    [1482105, 1, 1, 1],
    [1482183, 0.01, 1, 1],
    [1332114, 10, 1, 1],
    [1342006, 5, 1, 1],
    [1342028, 10, 1, 1],
    [1342087, 0.001, 1, 1],
    [1432136, 5, 1, 1],
    [1342029, 10, 1, 1],
    [1342030, 7, 1, 1],
    [1342031, 6, 1, 1],
    [1342032, 4, 1, 1],
    [1342033, 3, 1, 1],
    [1432040, 2, 1, 1],
[1432075, 10, 1, 1],
[1432151, 5, 1, 1],
[1492022, 5, 1, 1],
[1492073, 5, 1, 1],
[1492194, 0.001, 1, 1],
[1432081, 1, 1, 1],
[1492075, 10, 1, 1],
[1492076, 8, 1, 1],
[1492077, 6, 1, 1],
[1492078, 4, 1, 1],
[1492079, 2, 1, 1],
[1312032, 10, 1, 1],
[1312056, 10, 1, 1],
[1312097, 5, 1, 1],
[1312058, 10, 1, 1],
[1312059, 8, 1, 1],
[1312060, 6, 1, 1],
[1312061, 4, 1, 1],
[1412058, 10, 1, 1],
[1412059, 8, 1, 1],
[1412060, 6, 1, 1],
[1412061, 4, 1, 1],
[1412062, 2, 1, 1],
[1432182, 0.001, 1, 1],//红矛
[1432077, 10, 1, 1],
[1432078, 8, 1, 1],
[1432079, 6, 1, 1],
[1432080, 4, 1, 1],
[1322054, 5, 1, 1],
[1322084, 5, 1, 1],
[1322134, 2, 1, 1],
[1372016, 10, 1, 1],
[1372033, 30, 1, 1],
[1372034, 10, 1, 1],
[1372071, 10, 1, 1],
[1382009, 15, 1, 1],
[1382023, 2, 1, 1],
[1382039, 20, 1, 1],
[1382093, 8, 1, 1],
[1372035, 8, 1, 1],
[1372036, 8, 1, 1],
[1372037, 8, 1, 1],
[1372038, 8, 1, 1],
[1372039, 1, 1, 1],
[1372040, 1, 1, 1],
[1372041, 1, 1, 1],
[1372042, 1, 1, 1],
[1372074, 10, 1, 1],
[1372075, 8, 1, 1],
[1372076, 6, 1, 1],
[1372077, 4, 1, 1],
[1372078, 2, 1, 1],
[1382037, 2, 1, 1],
[1382095, 10, 1, 1],
[1382096, 8, 1, 1],
[1382097, 6, 1, 1],
[1382098, 4, 1, 1],
[1382099, 2, 1, 1],*/
//Array(2044605,100,1,1), //弩攻击诅咒卷轴
//Array(2044705,100,1,1) //拳套攻击诅咒卷轴



);
function start() {
	/*
	if (!cm.getPlayer().isGM()){
            cm.sendOk("抽奖机调整中.....");
            cm.dispose();		
	}	*/
	
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
           var text = "";
		   for (var i = 0; i < itemList.length;  i++){
                   text += "#i"+itemList[i][0]+":#";
				  
            }		
        if (cm.haveItem(5220040)) {
            cm.sendYesNo(//"抽奖机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. //游戏商城中的“其他”－“游戏”区里有噢。 //假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么? \r\n"+text);
			"这里暂时还每开放抽奖哦！ \r\n"+text);
        } else {
            cm.sendOk("你背包里有#b#t5220040##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 100);
        var finalitem = Array();
		     
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			
			if (!cm.canHold()) {
			cm.sendOk("请检查所有背包空间是否充足！");
            cm.dispose();
            return;
			}
			
			
			if (cm.getPlayer().getName() == "冒险岛" ) {			
			    if (cm.getBossLog("抽奖机中奖") == 0 ){
			    item = cm.gainGachaponItem(1402914, 1, "抽奖机", 1);//修改中奖的位置
			    cm.setBossLog("抽奖机中奖");
			    } else {
			    item = cm.gainGachaponItem(itemId, quantity, "转运抽奖机器", notice);
			    }
			
			} else {	
				
            item = cm.gainGachaponItem(itemId, quantity, "抽奖机", notice);
			}
			
            if (item != -1) {
                cm.gainItem(5220040, -1);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
				
				if (item == 2022552) {
				cm.worldMessage(9, cm.getClient().getChannel(),"【转运抽奖机器】" + " : " + " [" + cm.getPlayer().getName() + "]重大惊喜，抽得超大奖励：PB卷箱子一个", true);   
				}
				if (item == 2041200) {
				cm.worldMessage(9, cm.getClient().getChannel(),"【转运抽奖机器】" + " : " + " [" + cm.getPlayer().getName() + "]人品大爆发，获得了一个暗黑龙王石", true);   
				}				
				
				
            } else {
                cm.sendOk("你确实有#b#t5220040##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            //cm.safeDispose();
			status = -1;
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。哈哈哈，不用担心，还给你的蛋\r\n(获得了安慰奖：飞天猪的蛋。)");
            cm.gainItem(5220040, -1);
            cm.gainItem(5220040, 1);
            cm.safeDispose();
        }
    }
}


