/* 	Cody
*/

function start() {
    cm.sendOk("嗨，我是#p9100109# 很高兴认识你");
}

function action(mode, type, selection) {
    cm.dispose();
}	
/*


status = -1;
var itemList = Array(
        Array(2022216, 560, 1, 1), //菇菇寶貝的御守
        Array(2022217, 560, 1, 1), //殘暴炎魔的御守
        Array(2022218, 560, 1, 1), //巴洛古的御守
        Array(2022219, 560, 1, 1), //海怒斯的御守
        Array(2022220, 560, 1, 1), //拉圖斯的御守
        Array(2022223, 560, 1, 1), //企鵝王的御守
        Array(2022565, 580, 1, 1), //一片巧克力蛋糕
        Array(2022566, 580, 1, 1), //一片草莓蛋糕
        Array(2022567, 580, 1, 1), //一片鮮奶油蛋糕
        Array(1002600, 580, 1, 1), //紅色楓葉頭帶
        Array(1002601, 580, 1, 1), //黃色楓葉頭帶
        Array(4001197, 100, 1, 1), //水藍色礦石
        Array(1082146, 300, 1, 1), //紅色工作手套
        Array(1082147, 300, 1, 1), //藍色工作手套
        Array(1082148, 300, 1, 1), //紫色工作手套
        Array(1082150, 300, 1, 1), //灰色工作手套
        Array(1002418, 300, 1, 1), //紙製頭盔
        Array(1002083, 300, 1, 1), //黑頭巾
        Array(1032055, 300, 1, 1), //幹員C的老舊耳機
        Array(1032056, 300, 1, 1), //幹員C的老舊耳機
        Array(1032057, 300, 1, 1), //幹員C的老舊耳機
        Array(1032058, 300, 1, 1), //幹員C的超合金耳機
        Array(1102040, 320, 1, 1), //黃色冒險家披風
        Array(1002602, 320, 1, 1), //藍色楓葉頭帶
        Array(2041113, 400, 1, 1), //戒子力量詛咒卷軸30%
        Array(2041115, 400, 1, 1), //戒子敏捷詛咒卷軸30%
        Array(2041117, 400, 1, 1), //戒子智力詛咒卷軸30%
        Array(2041119, 400, 1, 1), //戒子幸運詛咒卷軸30%
        Array(1082145, 400, 1, 1), //黃色工作手套
        Array(1302085, 160, 1, 1), //叉子
        Array(1302067, 320, 1, 1), //楓之谷紀念旗
        Array(1302049, 300, 1, 1), //光線鞭子
        Array(1402014, 360, 1, 1), //溫度計
        Array(1322225, 52, 1, 1), //衝擊波來福
        Array(1322102, 48, 1, 1), //蛋糕vs派餅武器
        Array(1092022, 48, 1, 1), //調色盤
        Array(1422011, 48, 1, 1), //清酒
        Array(1102143, 48, 1, 1), //扁擔
        Array(1004650, 48, 1, 1), //QQ果凍帽
        Array(1302080, 48, 1, 1), //楓葉小電燈
        Array(1472081, 48, 1, 1), //仙女棒
        Array(1003419, 48, 1, 1), //頭上二個年糕
        Array(1003229, 40, 1, 1), //大眼睛青蛙帽子
        Array(1322123, 48, 1, 1), //不幸的復仇
        Array(1004579, 48, 1, 1), //乖巧羊帽子
        Array(1102590, 44, 1, 1), //愛里涅的翅膀
        Array(3010681, 12, 1, 1), //特大西瓜甕椅子
        Array(1012529, 48, 1, 1), //綠水靈臉飾
        Array(1012532, 48, 1, 1), //皮卡啾臉飾
        Array(2340000, 20, 1, 1), //祝福卷軸
        Array(2049100, 100, 1, 1), //混沌卷軸
        Array(1302267, 10, 1, 1), //覺醒的獅子心型彎刀
        Array(1332223, 10, 1, 1), //覺醒的雷本魂巴塞拉德
        Array(1372175, 10, 1, 1), //覺醒的龍尾巴短仗
        Array(1382210, 10, 1, 1), //覺醒的龍尾巴法仗
        Array(1402192, 10, 1, 1), //覺醒的獅子心型煉獄彎刀
        Array(1432165, 10, 1, 1), //覺醒的獅子心型普斯齊納
        Array(1442220, 10, 1, 1), //覺醒的獅子心型帕爾提殘
        Array(1452203, 10, 1, 1), //覺醒的帕爾困混合弓
        Array(1462191, 10, 1, 1), //覺醒的帕爾困赫比克洛斯弓
        Array(1472212, 10, 1, 1), //覺醒的雷本魂金屬拳
        Array(1482166, 10, 1, 1), //覺醒的俠客圖斯白毛抓
        Array(1492177, 10, 1, 1), //覺醒的俠客圖會心射手
        Array(1113072, 28, 1, 1), //初級培羅德戒指
        Array(1132243, 28, 1, 1), //初級培羅德皮帶
        Array(1302146, 50, 1, 1), //Last 不速之客 單手劍
        Array(1332119, 50, 1, 1), //Last 不速之客 短劍(LUK)
        Array(1372077, 50, 1, 1), //Last 不速之客 杖
        Array(1382098, 50, 1, 1), //Last 不速之客 長杖
        Array(1402089, 50, 1, 1), //Last 不速之客 雙手劍
        Array(1432080, 50, 1, 1), //Last 不速之客 槍
        Array(1442110, 50, 1, 1), //Last 不速之客 矛
        Array(1452105, 50, 1, 1), //Last 不速之客 弓
        Array(1462090, 50, 1, 1), //Last 不速之客 弩
        Array(1472116, 50, 1, 1), //Last 不速之客 拳套
        Array(1482078, 50, 1, 1), //Last 不速之客 指虎
        Array(1302147, 24, 1, 1), //VIP 單手劍
        Array(1332120, 24, 1, 1), //VIP 短劍(LUK)
        Array(1372078, 24, 1, 1), //VIP 杖
        Array(1382099, 24, 1, 1), //VIP 長杖
        Array(1402090, 24, 1, 1), //VIP 雙手劍
        Array(1432081, 24, 1, 1), //VIP 槍
        Array(1442111, 24, 1, 1), //VIP 矛
        Array(1452106, 24, 1, 1), //VIP 弓
        Array(1462091, 24, 1, 1), //VIP 弩
        Array(1472117, 24, 1, 1), //VIP 拳套
        Array(1482079, 24, 1, 1), //VIP 指虎
        Array(1352703, 24, 1, 1), //穿甲連發槍
        Array(1352702, 50, 1, 1), //高等連發槍
        Array(1113036, 20, 1, 1), //高級楓葉紫色戒指
        Array(1032177, 40, 1, 1), //無限的黑龍耳環
        Array(1072844, 120, 1, 1), //楓之谷競賽者鞋
        Array(1052187, 220, 1, 1), //熱狗套服(力量)
        Array(1052188, 220, 1, 1), //熱狗套服(敏捷)
        Array(1052189, 220, 1, 1), //熱狗套服(智力)
        Array(1052190, 220, 1, 1), //熱狗套服(幸運)
        Array(1142249, 12, 1, 1), //我是幸運兒
        Array(1002671, 16, 1, 1), //德國香腸
        Array(1082149, 40, 1, 1), //褐色工作手套
        Array(1012070, 32, 1, 1), //草莓冰棒
        Array(1022067, 40, 1, 1), //黑狐狸猴
        Array(1112915, 160, 1, 1), //歡樂指環
        Array(1102042, 80, 1, 1), //紫色冒險家披風
        Array(1102041, 60, 1, 1), //粉紅冒險家披風
        Array(1122019, 60, 1, 1), //楓葉之心
        Array(1122017, 60, 1, 1), //精靈墜飾
        Array(1012056, 80, 1, 1), //狗鼻
        Array(1022047, 80, 1, 1), //貓頭鷹
        Array(1022060, 60, 1, 1), //狐猴眼部裝飾
        Array(1302021, 52, 1, 1), //橡皮榔頭
        Array(1302024, 52, 1, 1), //紙劍
        Array(1302160, 36, 1, 1), //迅猛蝙蝠鞭子
        Array(1302161, 36, 1, 1), //狂暴蝙蝠鞭子
        Array(1302162, 36, 1, 1), //憤怒蝙蝠鞭子
        Array(1002931, 40, 1, 1), //番茄帽子(力量)
        Array(1002932, 40, 1, 1), //番茄帽子(敏捷)
        Array(1002933, 40, 1, 1), //番茄帽子(智力)
        Array(1002934, 40, 1, 1), //番茄帽子(幸運)
        Array(1052191, 80, 1, 1), //番茄服裝
        Array(1003450, 52, 1, 1), //皮卡啾帽
        Array(1052434, 52, 1, 1), //皮卡啾套服
        Array(1322070, 40, 1, 1), //西班牙火腿
        Array(1302150, 40, 1, 1), //魔女掃把
        Array(1002569, 40, 1, 1), //小狗帽子
        Array(1142719, 48, 1, 1), //非自發性的單身主義者
        Array(1142207, 48, 1, 1), //春花胸針
        Array(3010939, 12, 1, 1), //異界的匈奴比椅子
        Array(3010866, 36, 1, 1), //匈奴族長在身邊
        Array(3010718, 16, 1, 1), //歡樂雲朵椅子
        Array(3010854, 20, 1, 1), //集合!祕密的怪物們
        Array(3010513, 28, 1, 1), //開心得比艾勒
        Array(3010750, 36, 1, 1), //福寶月妙椅子
        Array(3010737, 16, 1, 1), //動物英雄團椅子
        Array(3015043, 24, 1, 1), //楓之谷寶石椅子
        Array(3015124, 16, 1, 1), //綠寶石熱愛者椅子
        Array(3010705, 16, 1, 1), //月妙和綠水玲椅
        Array(3010212, 28, 1, 1), //藏獒守護椅
        Array(3010038, 28, 1, 1), //透明椅
        Array(3010735, 28, 1, 1), //關於浪漫
        Array(3010459, 24, 1, 1), //美麗可愛天使
        Array(3010512, 24, 1, 1), //與斑斑一起
        Array(3010515, 16, 1, 1), //奇岩礦石之椅
        Array(3010663, 12, 1, 1), //沒名超帥看板
        Array(3010806, 12, 1, 1), //沒名櫻花
        Array(3012024, 12, 1, 1), //沒名度假椅子
        Array(3010876, 12, 1, 1), //楓之谷世界椅子
        Array(3010660, 12, 1, 1), //童話中宮殿
        Array(3010659, 20, 1, 1), //公車站椅子
        Array(3010946, 20, 1, 1), //樹林朋友露營椅子
        Array(3010714, 20, 1, 1), //堆疊王冠椅子
        Array(3010716, 20, 1, 1), //超級菇菇椅子
        Array(3015089, 20, 1, 1), //馬戲團的訓獸師
        Array(3015092, 16, 1, 1), //?????????
        Array(3010795, 16, 1, 1), //森林休閒處的椅子
        Array(3010744, 20, 1, 1), //楓之谷積木
        Array(3010722, 20, 1, 1), //殭屍狩獵者
        Array(3010643, 20, 1, 1), //10周年祝賀蛋糕
        Array(3010623, 28, 1, 1), //我的好友納奧椅
        Array(3010622, 28, 1, 1), //我的好友丹金椅
        Array(3010781, 28, 1, 1), //我的好友木馬椅
        Array(3010518, 24, 1, 1), //印地安的兄弟姊妹
        Array(3010589, 16, 1, 1), //需要充電
        Array(3010032, 40, 1, 1), //黃色五環椅
        Array(3010033, 40, 1, 1), //綠色五環椅
        Array(3010036, 32, 1, 1), //盪鞦韆
        Array(3020002, 28, 1, 1), //受詛咒的椅子
        Array(3010450, 28, 1, 1), //艾利緹椅子
        Array(3010760, 28, 1, 1), //古代洗澡堂椅子
        Array(1012421, 28, 1, 1), //進化冰結晶
        Array(3010138, 36, 1, 1), //躺椅
        Array(3010222, 32, 1, 1), //兔子伴讀椅
        Array(3010186, 28, 1, 1), //兔子椅子
        Array(3010223, 28, 1, 1), //柯基犬椅子
        Array(3010282, 28, 1, 1), //送子鸛椅
        Array(3010025, 28, 1, 1), //楓樹下
        Array(3010028, 28, 1, 1), //俘虜我吧！椅子
        Array(3010049, 28, 1, 1), //冰窖椅
        Array(3010056, 28, 1, 1), //充電器椅
        Array(3010083, 28, 1, 1), //扇子月妙抱枕椅
        Array(3010084, 28, 1, 1), //太平蕭月妙抱枕椅
        Array(3010107, 24, 1, 1), //龍蛋
        Array(3010108, 24, 1, 1), //鞦韆
        Array(3010184, 28, 1, 1), //冰釣椅
        Array(3010320, 28, 1, 1), //老奶奶的童話書椅子
        Array(3010208, 28, 1, 1), //黑貓椅
        Array(3010288, 28, 1, 1), //珍珠蚌椅子
        Array(3010404, 28, 1, 1), //希拉的最美時尚
        Array(3010433, 28, 1, 1), //魔法皮卡啾
        Array(3010457, 28, 1, 1), //和拉尼亞一起去野餐
        Array(3010446, 28, 1, 1), //皮膚女王椅子
        Array(3010494, 32, 1, 1), //TV椅子
        Array(3010043, 32, 1, 1), //女巫掃把
        Array(3010051, 24, 1, 1), //公砂兔椅
        Array(3010052, 24, 1, 1), //母砂兔椅
        Array(3010053, 32, 1, 1), //兔子沙發
        Array(3010123, 36, 1, 1), //花漾彩蝶椅
        Array(3010139, 32, 1, 1), //我的王座
        Array(3010140, 36, 1, 1), //病床
        Array(3010149, 36, 1, 1), //涼夏貓咪椅
        Array(3010071, 36, 1, 1), //迷你神獸椅
        Array(3010099, 36, 1, 1), //北極熊椅
        Array(3010196, 36, 1, 1), //泡泡浴缸椅
        Array(3010296, 36, 1, 1), //聖誕節糖果椅
        Array(3010298, 36, 1, 1), //北極熊椅子
        Array(3010375, 32, 1, 1), //奧妙的超級藥水椅子
        Array(3010376, 32, 1, 1), //熱情紅色藥水椅子
        Array(3010377, 32, 1, 1), //新鮮藍色藥水椅子
        Array(3010403, 32, 1, 1), //櫻花處的小型音樂會
        Array(3010510, 32, 1, 1), //喵咪籃椅子
        Array(3010531, 36, 1, 1), //小企鵝合唱團
        Array(3012002, 28, 1, 1), //檜木泡澡桶
        Array(3010073, 16, 1, 1), //皮卡啾椅
        Array(3010120, 28, 1, 1), //兔子籃子椅子
        Array(3010170, 28, 1, 1), //飄雪的夜晚
        Array(3010172, 24, 1, 1), //星空夜晚
        Array(3010453, 28, 1, 1), //乘著暴風的兔子椅
        Array(3010454, 28, 1, 1), //愛心雲朵椅
        Array(3015583, 24, 1, 1), //末日反抗軍出場準備完畢
        Array(3010690, 24, 1, 1), //鯊魚急流水道椅
        Array(3015238, 16, 1, 1), //泡泡綠水靈椅子
        Array(3010754, 24, 1, 1), //百鬼夜行
        Array(3015155, 16, 1, 1), //火焰的史烏椅
        Array(3015331, 16, 1, 1), //貓咪紙屋
        Array(3010641, 24, 1, 1), //失去顏色的圖畫
        Array(3015332, 20, 1, 1), //九尾狐魅
        Array(3015315, 16, 1, 1), //楓之谷TV椅
        Array(3010696, 16, 1, 1), //澡盆鴨鴨椅子
        Array(3010799, 16, 1, 1), //墳墓椅
        Array(3015339, 16, 1, 1), //幽靈船椅子
        Array(3010014, 16, 1, 1)//彎彎月亮
        );

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用了吗？");
            cm.dispose();
        }
        status--;
    }

    if (status == 0) {
        if (cm.haveItem(4110010)) {
            cm.sendYesNo("你背包里有#b#t4110010##k，你要试试手气吗?");
        } else {
            cm.sendOk("你背包里有#b#t4110010##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            if (cm.haveItem(4110010) && cm.canHold()) {
                cm.gainItem(4110010, -1);
                if (notice == 1) {
                    cm.gainGachaponItem(itemId, quantity, "豆豆票");
                } else {
                    cm.gainItem(itemId, quantity);
                }
                cm.sendOk("你得到了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4110010##k吗?如果是,请你确认在背包的装备,消耗,其他窗口中是否有一格以上的空间?");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到，做为补偿，送您一个豆豆箱");
			cm.gainItem(4110010, -1);
			cm.gainItem(5201001, 1);
            cm.safeDispose();
        }
    } else {
        cm.dispose();
    }
}*/