/*
 *
 *  此脚本由乐章网络制作完成
 *
 */
var 蝴蝶 = "#fEffect/CharacterEff/1051366/1/0#"; // 蓝色蝴蝶
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";
var 星星 ="#fMap/MapHelper/weather/witch/3#";
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";  //
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var 传送中心 = "#fEffect/CharacterEff1.img/QQ1408745/2/0#";
var 彩虹 ="#fEffect/ItemEff/1071085/effect/walk1/2#";
var 美化左边 = "#fUI/Basic.img/HScr3/disabled/prev#";//next
var 美化右边 = "#fUI/Basic.img/HScr3/disabled/next#";
var 蜗牛王 = "#fUI/UIWindow.img/MobGage/Mob/2220000#";
var 仙人掌 = "#fUI/UIWindow.img/MobGage/Mob/3220001#";
var 贝壳精 = "#fUI/UIWindow.img/MobGage/Mob/4220000#";
var 树妖王 = "#fUI/UIWindow.img/MobGage/Mob/3220000#";
var 僵尸猴 = "#fUI/UIWindow.img/MobGage/Mob/5220002#";
var 猫头鹰 = "#fUI/UIWindow.img/MobGage/Mob/5220003#";
var 蘑菇王 = "#fUI/UIWindow.img/MobGage/Mob/6130101#";
var 僵蘑菇王 = "#fUI/UIWindow.img/MobGage/Mob/6300005#";
var 贝壳王 = "#fUI/UIWindow.img/MobGage/Mob/5220000#";
var 流浪熊 = "#fUI/UIWindow.img/MobGage/Mob/7220000#";
var 艾力杰 = "#fUI/UIWindow.img/MobGage/Mob/8220000#";
var 吉米啦 = "#fUI/UIWindow.img/MobGage/Mob/8220002#";
var 大妙仙 = "#fUI/UIWindow.img/MobGage/Mob/7220002#";
var 九尾狐 = "#fUI/UIWindow.img/MobGage/Mob/7220001#";
var 喷火龙 = "#fUI/UIWindow.img/MobGage/Mob/8180000#";
var 格瑞芬 = "#fUI/UIWindow.img/MobGage/Mob/8180001#";
var 蝙蝠怪 = "#fUI/UIWindow.img/MobGage/Mob/8130100#";
var 大多尔 = "#fUI/UIWindow.img/MobGage/Mob/6220000#";
var 海兽 = "#fUI/UIWindow.img/MobGage/Mob/8220003#";
var 多多 = "#fUI/UIWindow.img/MobGage/Mob/8220004#";
var 独角兽 = "#fUI/UIWindow.img/MobGage/Mob/8220005#";
var 雷卡 = "#fUI/UIWindow.img/MobGage/Mob/8220006#";
var 闹钟 = "#fUI/UIWindow.img/MobGage/Mob/8500001#";
var 鱼王 = "#fUI/UIWindow.img/MobGage/Mob/8510000#";
var 熊狮 = "#fUI/UIWindow.img/MobGage/Mob/9420542#";
var 扎昆 = "#fUI/UIWindow.img/MobGage/Mob/8800001#";
var 蓝蘑菇王 = "#fUI/UIWindow.img/MobGage/Mob/9400205#";
var 黑龙 = "#fUI/UIWindow.img/MobGage/Mob/8810018#";
var 妖僧 = "#fUI/UIWindow.img/MobGage/Mob/9600025#";
var 品克宾 = "#fUI/UIWindow.img/MobGage/Mob/8820001#";
var 树精 = "#fUI/UIWindow.img/MobGage/Mob/9420521#";
var 中条猫 ="#fUI/ChatBalloon/37/n#";
var 猫右 =  "#fUI/ChatBalloon/37/ne#";
var 猫左 =  "#fUI/ChatBalloon/37/nw#";
var 下条猫 ="#fUI/ChatBalloon/37/s#";
var 猫下右 ="#fUI/ChatBalloon/37/se#";
var 猫下左 ="#fUI/ChatBalloon/37/sw#";
var 闪星 = "#fEffect/CharacterEff/1114000/2/0#";
var 传送中心 = "#fEffect/CharacterEff1.img/QQ1408745/0/6#";
var dd = " ";
var 中条猫 ="#fUI/ChatBalloon/37/n#";
var 中条 = ""+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+"\r\n";
//------------------------------------------------------------------------

var chosenMap = -1;
var monsters = 0;
var towns = 0;
var bosses = 0;
var fuben = 0;
var zhaohuanbosses = 0;
var paohuanmonsters = 0;
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";

//------------------------------------------------------------------------

var bossmaps = Array(
		Array(104000400,1000,"[#r"+蜗牛王+"蜗 牛 王#k]"),
		Array(100000005,1000,"[#r"+蘑菇王+"蘑 菇 王#k]"),
		Array(800010100,1000,"[#r"+蓝蘑菇王+"蓝蘑菇王#k]"),
		Array(105070002,1000,"[#r"+僵蘑菇王+"僵蘑菇王#k]"),
		Array(101030404,1000,"[#r"+树妖王+"树 妖 王#k]"),
		Array(260010201,1000,"[#r"+仙人掌+"仙 人 掌#k]"),
		Array(230020100,1000,"[#r"+贝壳精+"贝 壳 精#k]"),
		Array(100040106,1000,"[#r"+僵尸猴+"僵 尸 猴#k]"),
		Array(220050100,1000,"[#r"+猫头鹰+"猫 头 鹰#k]"),
		Array(110040000,1000,"[#r"+贝壳王+"贝 壳 王#k]"),
		Array(250010304,1000,"[#r"+流浪熊+"流 浪 熊#k]"),
		Array(200010300,1000,"[#r"+艾力杰+"艾 力 杰#k]"),
		Array(261030000,1000,"[#r"+吉米啦+"吉 米 啦#k]"),
		Array(250010503,1000,"[#r"+大妙仙+"大 妙 仙#k]"),
		Array(222010310,1000,"[#r"+九尾狐+"九 尾 狐#k]"),
		Array(240020401,2000,"[#r"+喷火龙+"喷 火 龙#k]"),
		Array(240020101,2000,"[#r"+格瑞芬+"格 瑞 芬#k]"),
		Array(105090900,2000,"[#r"+蝙蝠怪+"蝙 蝠 怪#k]"),
		Array(107000300,2000,"[#r"+大多尔+"大 多 尔#k]"),
		Array(240040401,2000,"[#r"+海兽+"  海 兽 #k]"),
		Array(270010500,2000,"[#r"+多多+"  多 多 #k]"),
		Array(270020500,2000,"[#r"+独角兽+"独 角 兽#k]"),
		Array(270030500,2000,"[#r"+雷卡+"  雷 卡 #k]"),
		
		Array(230040420,500000,"[#r"+鱼王+"  鱼 王 #k]"),
		Array(541020700,500000,"[#r"+树精+"  树 精 #k]"),
		Array(702070400,500000,"[#r"+妖僧  +"  妖 僧 #k]"),
		Array(220080000,500000,"[#r"+闹钟 +"  闹 钟 #k]"),
		Array(551030100,500000,"[#r"+熊狮+"暴力熊狮#k]"),
		Array(211042300,500000,"[#r"+扎昆+"  扎 昆 #k]"),
		Array(240050400,500000,"[#r"+黑龙+"  黑 龙 #k]"),		
		Array(270050000,500000,"[#r"+品克宾+" 品 克 宾#k]")	
		//Array(105200000,500000,"[#r 四大恶魔Boss#k]")	
		);
//------------------------------------------------------------------------
var fubenmaps = Array(
		Array(104010001,0," #i4000004#"),//#z#   #i#
        Array(104040000,0," #i4000000#"),
		Array(102030300,0," #i4000010#"),
		Array(102030100,0," #i4000019#"),
		Array(102030000,0," #i4000016#"),
		Array(107000300,0," #i4000001#"),	
		Array(103000101,0," #i4000003#"),   
        Array(102040000,0," #i4000012#"),		
		Array(100040101,0," #i4000002#"), 
		Array(100040105,0," #i4000011#"),
		Array(101020009,0," #i4000039#"),
		Array(105090000,0," #i4000031#"),
        Array(105060100,0," #i4000029#"),
		Array(105080000,0," #i4000041#"),
		Array(110020000,0," #i4000005#"),
		Array(110040000,0," #i4000015#"),
		Array(200010120,0," #i4000018#"),
		Array(200010000,0," #i4000215#"),
		Array(230010000,0," #i4000024#"),
		Array(230020100,0," #i4000020#"),
		Array(230030001,0," #i4000196#"),
		Array(222010101,0," #i4000195#"),
		Array(701010300,0," #i4000197#"),
		Array(211000200,0," #i4000205#"),
		Array(220010700,0," #i4000204#"),
		Array(220010900,0," #i4000206#"),
		Array(220040000,0," #i4000207#"),
		Array(221022100,0," #i4000006#"),
		Array(230010000,0," #i4000034#"),
		Array(230020100,0," #i4000032#"),
		Array(230030001,0," #i4000033#"),
		Array(222010101,0," #i4000037#"),
		Array(701010300,0," #i4000042#"),
		Array(211000200,0," #i4000036#"),
		Array(220010700,0," #i4000035#"),
		Array(220010900,0," #i4000009#"),
		Array(220040000,0," #i4000499#"),
		Array(221022100,0," #i4000507#"),
		Array(230010000,0," #i4000500#"),
		Array(230020100,0," #i4000013#"),
		Array(230030001,0," #i4000026#"),
		Array(222010101,0," #i4000025#"),
		Array(701010300,0," #i4000022#"),
		Array(211000200,0," #i4000008#"),
		Array(220010700,0," #i4000007#"),
		Array(220010900,0," #i4000014#"),
		Array(220040000,0," #i4000023#"),
		Array(221022100,0," #i4000177#"),
		Array(230010000,0," #i4000083#"),
		Array(230020100,0," #i4000063#"),
		Array(230030001,0," #i4000084#"),
		Array(222010101,0," #i4000085#"),
		Array(701010300,0," #i4000086#"),
		Array(211000200,0," #i4000087#"),
		Array(220010700,0," #i4000059#"),
		Array(220010900,0," #i4000060#"),
		Array(220040000,0," #i4000061#"),
		Array(221022100,0," #i4000073#"),
		Array(230010000,0," #i4000072#"),
		Array(230020100,0," #i4000070#"),
		Array(230030001,0," #i4000074#"),
		Array(222010101,0," #i4000106#"),
		Array(701010300,0," #i4000107#"),
		Array(211000200,0," #i4000110#"),
		Array(220010700,0," #i4000109#"),
		Array(220010900,0," #i4000108#"),
		Array(220040000,0," #i4000111#"),
		Array(221022100,0," #i4000112#"),
		Array(220010700,0," #i4000114#"),
		Array(220010900,0," #i4000071#"),
		Array(220040000,0," #i4000115#"),
		Array(221022100,0," #i4000153#")		
		);//
//------------------------------------------------------------------------

var zhaohuanbossmaps = Array(
                                        Array(701010320,15000,"蜈蚣王"), 
										Array(300000012,15000,"艾里葛斯"), 
										Array(702070400,20000,"少林妖僧"),   
										Array(105100100,15000,"巨大蝙蝠怪"),
										Array(220080000,20000,"闹钟"), 										
										Array(230040410,20000,"鱼王"),
                                        //Array(800020300,20000,"大姐大boss   - 出各种成品属性水晶"),
										//Array(803001200,20000,"绯红BOSS挑战 - 出精灵吊坠材料"), 
										Array(280030000,0,"扎昆"),										
										Array(240050400,0,"暗黑龙王"),
										Array(910000020,0,"品克缤"),
										Array(924000100,15000,"巨大蜘蛛")  											
		);

//------------------------------------------------------------------------

var monstermaps = Array(
		Array(104040001,0,"射手训练场2"), 
		Array(104010001,0,"猪的海岸"),
		Array(103000101,0,"地铁1号线1"), 
		//Array(101040001,0,"野猪的领土　　　　　  适合 20 ~ 35 级玩家。"), 
		//Array(101040003,0,"钢之黑怪之地　　　　  适合 20 ~ 35 级玩家。"),
        Array(101030001,0,"野猪的领土"), 		
		Array(100040103,0,"猴子森林2"), 
		Array(105070100,0,"火独眼兽洞穴"),
		Array(222010000,0,"乌山入口"), 
		//Array(230020000,0,"东海叉路　　　　　　 适合 30 ~ 40 级玩家。"), 
		Array(200040000,0,"云彩公园3"),
		//Array(230010400,0,"西海叉路　　　　　　 适合 40 ~ 50 级玩家。"),
		Array(101030110,0,"第1军营"), 
		Array(106000002,0,"危险的峡谷"), 
		Array(101030103,0,"遗迹发掘地3"),
        Array(220010500,0,"露台大厅"), 		
		Array(103000105,0,"地铁1号线4"),		
		Array(105090300,0,"龙穴"), 
		Array(105040306,0,"巨人之林"), 
		//Array(251010000,0,"十年药草地　　　　　 适合 45 ~ 70 级玩家。加了怪"), 
		Array(250020000,0,"初级修炼场"),
		Array(800020130,0,"大佛的邂逅"), 
		Array(211041400,0,"死亡之林4"),
		Array(541010010,0,"幽灵船2"), 
		Array(200010301,0,"黑暗庭院1"),
		Array(220070201,0,"消失时间"),
        Array(551030000,0,"梦幻主题公园3"),
        //Array(270000000,0,"时间神殿　　　　　  适合 70 ~ 100 级玩家。加了怪"),
		Array(600020300,0,"狼蛛洞穴1"),
		Array(240020100,0,"火焰死亡战场"),		
		Array(551030100,0,"阴森入口"),
        Array(220060301,0,"怪异时间"),		
		Array(220070301,0,"时间停止"),
		Array(240030101,0,"火焰树林"),
        //Array(921100300,0,"蝙蝠魔之家　　　　  适合 120 ~ 150 级玩家。加了怪"),
		Array(541020200,0,"乌鲁2"),
		Array(240040500,0,"龙之巢穴入口"),
		Array(240040600,0,"主峰巢穴"),
		Array(541020000,0,"乌鲁城入口"),
		Array(240040510,0,"死龙巢穴"),
		Array(270010500,0,"时间神殿追忆5"),
        Array(270020500,0,"时间神殿后悔5"),
        Array(270030500,0,"时间神殿忘却5"),	
		Array(541020500,0,"乌鲁中心"),	
		Array(541020600,0,"毁灭的公园1"),
		Array(926010000,0,"金字塔")
		); 

//------------------------------------------------------------------------

var paohuanmonstermaps = Array(
		Array(104040002,0,"收集#v4000016#"), //红蜗牛壳
		Array(105070001,0,"收集#v4000008#"),//道符
		
		//Array(107000500,0,"去收集#v4000006##v4000034##v4000018#"), //章鱼，蛇皮，木块
		Array(104010001,0,"收集#v4000002#"), //蝴蝶结
		Array(105070100,0,"收集#v4000007#"), //火独眼
		Array(100040103,0,"收集#v4000029#"),//香蕉
        Array(105090300,0,"收集#v4000023#"), //冰独眼	
		Array(104030001,0,"收集#v4000011#"), //蘑菇孢芽
		Array(100030001,0,"收集#v4000009#"), //蓝蘑菇
		Array(103000101,0,"收集#v4000037#"), //蓝水灵
		Array(103000102,0,"收集#v4000042#"),//蝙蝠翅膀
		//Array(103000104,0,"去收集#v4000035#"),//桌布
        //Array(103000105,0,"去收集#v4000036#"), //奇妙的药		
		Array(107000000,0,"收集#v4000032#"), //鳄鱼皮
		Array(100000005,0,"收集#v4000039#"), //铁甲猪蹄
		//Array(110010000,0,"去收集#v4000043#"), //红螃蟹
		Array(110040000,0,"收集#v4000045#"), //乌龟		
		Array(211030000,0,"收集#v4000052#"), //白狼尾
		Array(200040000,0,"收集#v4000060#"), //月光精灵
		Array(211041400,0,"收集#v4000069#"), //僵尸
		Array(200010301,0,"收集#v4000074#"),//黑色飞狮尾
		//Array(200010200,0,"去收集#v4000070##v4000071##v4000072#"), //红黄蓝小狮子
		Array(221020400,0,"收集#v4000102#"),//黑积木
		Array(220010600,0,"收集#v4000106#"), //玩具熊猫棉花
		//Array(220020300,0,"去收集#v4000108#"),//熊猫娃娃
		Array(220050000,0,"收集#v4000115#"),//齿轮
		Array(220060000,0,"收集#v4000128#"),//黄小丑
		Array(220070000,0,"收集#v4000143#"),//僵尸娃娃
        Array(230030100,0,"收集#v4000162#"),//华丽鳞片
        Array(230040400,0,"收集#v4000180#"),//鲨鱼假牙	
		Array(230040100,0,"收集#v4000182#"),//石灰粉瓶
        Array(230040300,0,"收集#v4000183#"),//墨汁瓶		
		Array(701010000,0,"收集#v4000188#"),//鸭蛋
		//Array(701010200,0,"去收集#v4000189##v4000190#"),//羊毛，山羊角
        Array(701010300,0,"收集#v4000191#"),//黑山羊角
		Array(701010400,0,"收集#v4000192#"),//鼻环
		Array(101030103,0,"收集#v4000197#"),//石板
        Array(101030106,0,"收集#v4000205#"),//骷髅犬绑带	
		Array(101030110,0,"收集#v4000207#"),//骨盆
		Array(541000200,0,"收集#v4000373#"),//墨汁
		Array(251010100,0,"收集#v4000292#"),//人参汤
        Array(251010200,0,"收集#v4000294#"),//百年桔梗
		Array(260010000,0,"收集#v4000329#"),//仙人掌球
		Array(260010100,0,"收集#v4000330#"),//仙人掌刺
        Array(260010200,0,"收集#v4000331#"),//仙人掌花
		Array(261010101,0,"收集#v4000354#"),//烧杯
		Array(801010000,0,"收集#v4000089#"),//流氓A的徽章
		Array(800010001,0,"收集#v4000066#"),//云狐尾巴
		Array(800020200,0,"收集#v4000075#"),//三角头巾
		Array(800020400,0,"收集#v4000080#"),//火焰猎犬的项链
		Array(250010400,0,"收集#v4000281#"),//蛇纹皮
		Array(250010502,0,"收集#v4000298#"),//白纸张
		Array(250010700,0,"收集#v4000282#"),//蟠桃核
		Array(550000100,0,"收集#v4000465#"),//椰子壳
		Array(550000400,0,"收集#v4000472#"),//蛇笛
		Array(551000200,0,"收集#v4000469#"),//围巾
		Array(540020100,0,"收集#v4000375#"),//轮胎
		Array(541020300,0,"收集#v4000433#"),//油罐
		Array(541020500,0,"收集#v4000432#"),//青苔岩石
		Array(541020610,0,"收集#v4000434#"),//大花草
		Array(221040200,0,"收集#v4000118#"),//小太空船
		Array(222010300,0,"收集#v4000172#"),//三尾狐的尾巴
		Array(300010400,0,"收集#v4000440#"),//粗糙的皮革
		Array(300020100,0,"收集#v4000439#"),//青苔石
		Array(200081000,0,"收集#v4000085#"),//火石球的石片
		Array(211040001,0,"收集#v4000050#"),//企鹅王的嘴
		Array(211040200,0,"收集#v4000049#"),//白雪人角
		Array(240040520,0,"收集#v4000272#"),//蛋壳碎片
		Array(240040400,0,"收集#v4000268#"),//飞龙的翅膀
		Array(240010400,0,"收集#v4000241#"),//邪恶绵羊嚼过的草
		Array(240020400,0,"收集#v4000233#"),//半人马的净水	
		Array(240011000,0,"收集#v4000236#"),//橡木甲虫角
		Array(240010600,0,"收集#v4000240#"),//小火花羽毛
		Array(230020101,0,"收集#v4000166#"),//虾肉
		Array(230030001,0,"收集#v4000163#"),//海马的角
		Array(105090100,0,"收集#v4000027#"),//怪猫的眼
		Array(105090500,0,"收集#v4000028#"),//月牙牛魔王的角
		Array(221021500,0,"收集#v4000127#"),//玩具鼓
		Array(702070200,0,"收集#v4000402#"),//银人心
		Array(702010000,0,"收集#v4000394#"),//白虎尾巴
		Array(270010100,0,"收集#v4000444#"),//绿色衣襟
		Array(270010300,0,"收集#v4000447#"),//绿色头盔
		Array(270020100,0,"收集#v4000449#"),//蓝色衣襟
		Array(270020300,0,"收集#v4000452#"),//蓝色头盔
		Array(270030100,0,"收集#v4000454#"),//红色衣襟
		Array(270030400,0,"收集#v4000457#"),//红色头盔
		Array(541010040,0,"收集#v4001006#"),//火焰羽毛
		Array(211041500,0,"收集#v4000082#"),//金牙
		Array(300010100,0,"收集#v4000436#"),//烧杯
		Array(211041000,0,"收集#v4000054#"),//白角齿
		Array(211040600,0,"收集#v4000053#"),//黑角齿		
		Array(701010320,0,"收集#v4031227#"),//赤柱	
		Array(102030200,0,"收集#v4000178#"),//铁甲猪盔甲	
		Array(106010106,0,"收集#v4000068#"),//蝴蝶精的触角
		Array(101040001,0,"收集#v4000067#")//
		); 

//------------------------------------------------------------------------

var townmaps = Array(

		//Array(109010000,0,"冒险岛活动-寻找宝物"), 
		//Array(701000210,0,"挂机地方大擂台"),
		//Array(910000000,0,"自由市场"),
		Array(200000301,0,"#r家族中心#b"),
		//Array(749030000,0,"旅馆"), 
		Array(104000000,0,"明珠港口"), 
		Array(100000000,0,"射手村落"), 
		Array(101000000,0,"魔法密林"), 
		Array(102000000,0,"勇士部落"), 
		Array(103000000,0,"废弃都市"), 
		Array(120000000,0,"诺特勒斯"),
		//Array(140000000,0,"里恩"), 
		Array(105040300,0,"林中之城"),
		Array(200000000,0,"天空之城"),
		Array(211000000,0,"冰峰雪域"), 
		Array(230000000,0,"水下世界"),  
		Array(222000000,0,"童话村庄"), 
		Array(220000000,0,"玩具城堡"),
		Array(701000000,0,"东方神州"),
		Array(250000000,0,"武陵仙境"), 
		//Array(500000000,0,"泰国"),
		Array(260000000,0,"阿里安特"),
		Array(261000000,0,"玛加提亚"),		
		Array(600000000,0,"新叶城市"), 
		Array(240000000,0,"神木村庄"),   
		Array(221000000,0,"地球防御"), 
		Array(251000000,0,"百草堂地"),
		//Array(701000200,0,"上海豫园"),
		Array(550000000,0,"吉隆都市"),
		Array(551000000,0,"甘榜村"),
		Array(801000000,0,"昭和村庄"), 
		Array(540010000,0,"新加坡机"),
		Array(540000000,0,"新加坡"),
		Array(300000000,0,"艾林森林"), 
		Array(702100000,0,"藏经古阁"), 
		Array(800000000,0,"古代神社"),
		Array(1000000,0,"#r彩虹村庄#b")
	//	Array(702090400,0,"英语村"),  
	//	Array(700000000,0,"红鸾宫"), 
	//	Array(749020000,0,"蛋糕活动地图")
		);

//------------------------------------------------------------------------
/*
var fubenmaps = Array(
		Array(800020400,0,"家族PK地图"),
		Array(193000000,0,"网吧地图")						
		);

//------------------------------------------------------------------------
*/
	function start() {
		status = -1;
		action(1, 0, 0);
		}
	function action(mode, type, selection) {
	if (mode == -1) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		} else {
	if (status >= 0 && mode == 0) {
		cm.sendOk("#b好的,下次再见.");
		cm.dispose();
		return;
		}
	if (mode == 1) {
		status++;
		} else {
		status--;
		}

//------------------------------------------------------------------------"#L51##v4251202#"+蝴蝶+"大陆传送"

	if (status == 0) {

   	    var add = ""+dd+"\r\n\t\t\t"+传送中心+"\r\n"+中条+""
			//add += "\t\t\t"+闪星+""+传送中心+"\t"+闪星+" #n\r\n";
			//add += ""+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+中条猫+"\r\n";
			add += "#r#e#L0##v2030000#"+蝴蝶+"城镇传送"+蝴蝶+"#l\t\t#L1##v3800350#"+蝴蝶+"练级传送"+蝴蝶+"#l\r\n\r\n";
		    add += "#L51##v1902339#"+蝴蝶+"次元传送"+蝴蝶+"#l\t\t#L52##v4310143#"+蝴蝶+"野外BOSS"+蝴蝶+"#l\r\n\r\n";
			add += "#L7# #v4000016#"+蝴蝶+"材料传送"+蝴蝶+"#l\t\t#L10##v4170002# "+蝴蝶+"每日副本"+蝴蝶+"#l\r\n\r\n";
			//add += "#L4# #v4000016#"+蝴蝶+"跑环传送"+蝴蝶+"#l\t\t#L3##v3994731#"+蝴蝶+"每日跳跳"+蝴蝶+"#l\r\n\r\n";
			//add += "#L4#"+蝴蝶+"#r跑环材料传送\r\n\r\n";
			//add += "\t\t\t#L5111##v4310143##r"+蝴蝶+"跳跳活动"+蝴蝶+"#l\r ";
			/*add += " #L22##v5150040#"+蝴蝶+"美容美发"+蝴蝶+"#l           #L10##v2430245#"+蝴蝶+"副本传送"+蝴蝶+"#l\r\n\r\n";


            add += "   #L24##v4010000#"+蝴蝶+"矿石搬砖"+蝴蝶+"#l     #L25##v4020000#"+蝴蝶+"水晶矿搬砖"+蝴蝶+"#l\r\n\r\n";
            add += "   #L26##v4001126#"+蝴蝶+"枫叶搬砖"+蝴蝶+"#l     #L27##v4001165#"+蝴蝶+"太阳神搬砖"+蝴蝶+"#l\r\n\r\n";
            add += "   #L121#"+蝴蝶+"暴力熊"+蝴蝶+"#l";
            add += "   #L121#"+蝴蝶+"暴力熊"+蝴蝶+"#l";
            add += "   #L121#"+蝴蝶+"暴力熊"+蝴蝶+"#l";
			add += "       #L131#"+蝴蝶+"大树精"+蝴蝶+"#l\r\n\r\n";*/
		/*	add += "#L10#"+蝴蝶+"#r各种副本传送\r\n\r\n";		
				
			add += "#L4#"+蝴蝶+"#b各种搬砖地图\r\n\r\n";
		
			add += "#L7#"+蝴蝶+"#r跑环材料传送\r\n\r\n";

			add += "#L2#"+蝴蝶+"#d野外BOSS传送\r\n\r\n";
		
			add += "#L11#"+蝴蝶+"普通BOSS传送\r\n\r\n";
		
			add += "#L6#"+蝴蝶+"挑战暴力熊心疤狮\r\n\r\n";
				
			add += "#L3#"+蝴蝶+"挑战树精\r\n\r\n";
		
			add += "#L8#"+蝴蝶+"#r布莱克缤鬼娃挑战 需要190级以上 每天2次  \r\n\r\n";
		
			add += "#L9#"+蝴蝶+"#r风暴装备挑战 需要190级以上 每天2次\r\n\r\n";
		
			add += "#L12#"+蝴蝶+"#r外星碎片装备挑战 需要190级以上 每天2次\r\n\r\n";
 
			add += "#L51##r 蛋糕活动传送#l\r ";*/

		
		
		cm.sendSimple (add);    

//------------------------------------------------------------------------
				
	} else if (status == 1) {

	if (selection == 0){
		var selStr = "\r\n";
			selStr += "\t\t\t"+传送中心+"\t #n\r\n\r\n";
			selStr += "#L0#"+蝴蝶+"#b家族中心"+蝴蝶+"#l#L1#"+蝴蝶+"明珠港口"+蝴蝶+"#l#L2#"+蝴蝶+"射手村落"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L3#"+蝴蝶+"#b魔法密林"+蝴蝶+"#l#L4#"+蝴蝶+"勇士部落"+蝴蝶+"#l#L5#"+蝴蝶+"废弃都市"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L6#"+蝴蝶+"#b诺特勒斯"+蝴蝶+"#l#L7#"+蝴蝶+"林中之城"+蝴蝶+"#l#L8#"+蝴蝶+"天空之城"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L9#"+蝴蝶+"#b冰封雪域"+蝴蝶+"#l#L10#"+蝴蝶+"水下世界"+蝴蝶+"#l#L11#"+蝴蝶+"童话村庄"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L12#"+蝴蝶+"#b玩具城堡"+蝴蝶+"#l#L13#"+蝴蝶+"东方神州"+蝴蝶+"#l#L14#"+蝴蝶+"武陵仙境"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L15#"+蝴蝶+"#b阿里安特"+蝴蝶+"#l#L16#"+蝴蝶+"玛加提亚"+蝴蝶+"#l#L17#"+蝴蝶+"新叶城市"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L18#"+蝴蝶+"#b神木村庄"+蝴蝶+"#l#L19#"+蝴蝶+"地球防御"+蝴蝶+"#l#L20#"+蝴蝶+"百草堂地"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L21#"+蝴蝶+"#b吉隆都市"+蝴蝶+"#l#L22#"+蝴蝶+"甘 榜 村"+蝴蝶+"#l#L23#"+蝴蝶+"昭和村庄"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L24#"+蝴蝶+"#b新加坡机"+蝴蝶+"#l#L25#"+蝴蝶+"#r新 加 坡#b"+蝴蝶+"#l#L26#"+蝴蝶+"艾琳森林"+蝴蝶+"#l\r\n\r\n";
			selStr += "#L27#"+蝴蝶+"#b藏经古阁"+蝴蝶+"#l#L28#"+蝴蝶+"#r古代神社#b"+蝴蝶+"#l#L29#"+蝴蝶+"彩虹村庄"+蝴蝶+"#l\r\n\r\n";
		cm.sendSimple(selStr);
		towns = 1;
		}

	if (selection == 1) {
		var selStr = "\r\n";
			selStr += "\t\t\t"+传送中心+"\t #n\r\n\r\n";
			selStr += "				       #e#r升级副本#n\r\n";
		//	selStr += "\t  #L38##v3800350#"+蝴蝶+"#b金字塔（火箭升级1-250）"+蝴蝶+"#v3800350##l\r\n\r\n";
		//	selStr += "#e#r特别说明：本服主要升级途径，请前往副本传送 - 金字塔副本升级#n\r\n";
			selStr += "				       #e#r1 ~ 30级#n\r\n";
			selStr += "#L0#"+蝴蝶+"#b射手训练场2（1~15）#l    #L1#"+蝴蝶+"猪的海岸（10~20）#l\r\n\r\n";
			selStr += "#L2#"+蝴蝶+"#b地铁1号线1（20~30）#l    #L3#"+蝴蝶+"野猪的领地（20~35）#l\r\n\r\n";
			selStr += "#L4#"+蝴蝶+"#b猴子森林2（20~35）#l     #L5#"+蝴蝶+"火独眼洞穴（20~40）#l\r\n\r\n";
			selStr += "				       #e#r31 ~ 70级#n\r\n";
			selStr += "#L6#"+蝴蝶+"#b乌山入口（30~50）#l      #L7#"+蝴蝶+"云彩公园3（35~60）#l\r\n\r\n";
			selStr += "#L8#"+蝴蝶+"#b第1军营（40~60）#l       #L9#"+蝴蝶+"危险的峡谷（40~60）#l\r\n\r\n";
			selStr += "#L10#"+蝴蝶+"#b遗迹发掘地3（40~60）#l   #L11#"+蝴蝶+"露台大厅（40~70）#l\r\n\r\n";
			selStr += "#L12#"+蝴蝶+"#b地铁1号线4（40~70）#l    #L13#"+蝴蝶+"龙穴（40~70）#l\r\n\r\n";
			selStr += "#L14#"+蝴蝶+"#b巨人之林（45~70）#l      #L15#"+蝴蝶+"初级修炼场（50~70）#l\r\n\r\n";
			selStr += "#L16#"+蝴蝶+"#b大佛的邂逅（50~70）#l    #L17#"+蝴蝶+"死亡之林4（55~70）#l\r\n\r\n";
			selStr += "#L18#"+蝴蝶+"#b幽灵船2（50~80）#l\r\n\r\n";
			selStr += "				       #e#r71 ~ 120级#n\r\n";
			selStr += "#L19#"+蝴蝶+"#b黑暗庭院1（70~90）#l     #L20#"+蝴蝶+"消失时间（70~100）#l\r\n\r\n";
			selStr += "#L21#"+蝴蝶+"#b梦幻主题公园3（70~100）#l#L22#"+蝴蝶+"狼蛛洞穴1（70~120）#l\r\n\r\n";
			selStr += "#L23#"+蝴蝶+"#b火焰死亡战场（70~120）#l #L24#"+蝴蝶+"阴森入口（80~120）#l\r\n\r\n";
			selStr += "#L25#"+蝴蝶+"#b怪异时间（80~120）#l     #L26#"+蝴蝶+"时间停止（90~120）#l\r\n\r\n";
			selStr += "				       #e#r120 ~ 250级#n\r\n";
			selStr += "#L27#"+蝴蝶+"#b火焰树林（120~150）#l    #L28#"+蝴蝶+"乌鲁2（120~150）#l\r\n\r\n";
			selStr += "#L29#"+蝴蝶+"#b龙之巢穴入口（120~150）#l#L30#"+蝴蝶+"主峰巢穴（130~180）#l\r\n\r\n";
			selStr += "#L31#"+蝴蝶+"#b乌鲁城入口（130~180）#l  #L32#"+蝴蝶+"死龙巢穴（140~180）#l\r\n\r\n";
			
		//	selStr += "#L33#"+蝴蝶+"#b追忆神殿（150~200）#l    #L35#"+蝴蝶+"忘却神殿（180~250）#l\r\n\r\n";
		//	selStr += "#L36#"+蝴蝶+"#b乌鲁中心（200~250）#l    #L37#"+蝴蝶+"毁灭公园（200~250）#l\r\n\r\n";
			
			selStr += "#L33#"+蝴蝶+"#b追忆神殿（150~200）#l    #L34#"+蝴蝶+"后悔神殿（160~220）#l\r\n\r\n";
			selStr += "#L35#"+蝴蝶+"#b忘却神殿（180~250）#l    #L36#"+蝴蝶+"乌鲁中心（200~250）#l\r\n\r\n";
			selStr += "#L37#"+蝴蝶+"毁灭的公园1（200~250）#l\r\n\r\n";
		cm.sendSimple(selStr);
		monsters = 1;
		}

/*	if (selection == 2) {
		var selStr = "\r\n";
			selStr += "\t\t\t"+传送中心+"\t #n\r\n\r\n";
			selStr += "#L0#"+蝴蝶+"#b红蜗牛BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L1#"+蝴蝶+"#b仙人掌BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L2#"+蝴蝶+"#b贝壳精BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L3#"+蝴蝶+"#b树妖精BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L4#"+蝴蝶+"#b僵尸猴BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L5#"+蝴蝶+"#b猫头鹰BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L6#"+蝴蝶+"#b蘑菇王BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L7#"+蝴蝶+"#b蓝蘑菇王BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L8#"+蝴蝶+"#b僵尸蘑菇王BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L9#"+蝴蝶+"#b巨居蟹BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L10#"+蝴蝶+"#b肯德熊BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L11#"+蝴蝶+"#b艾力杰BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L12#"+蝴蝶+"#b吉米啦BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L13#"+蝴蝶+"#b大妙仙BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L14#"+蝴蝶+"#b九尾狐BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L15#"+蝴蝶+"#b火焰龙BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L16#"+蝴蝶+"#b天鹰BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L17#"+蝴蝶+"#b蝙蝠怪BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L18#"+蝴蝶+"#b多尔BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L19#"+蝴蝶+"#b大海兽BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L20#"+蝴蝶+"#b多多BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L21#"+蝴蝶+"#b玄冰独角兽BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
			selStr += "#L22#"+蝴蝶+"#b雷卡BOSS"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
		cm.sendSimple(selStr);
		bosses = 1;
		}*/
	if (selection == 2) {
		var selStr = "\r\n\t\t\t"+传送中心+"\t #n\r\n";
		for (var i = 0; i < bossmaps.length; i++) {
			if(i % 3 ==0)

		selStr +="\r\n\r\n"
		selStr += "#L" + i + "#" + bossmaps[i][2] + "";
		//selStr += "\r\n消耗#L" + i + "#" + bossmaps[i][1] + "";

		}
		cm.sendSimple(selStr);
		bosses = 1;
		}	
		
	if (selection == 3) {
		if (cm.getLevel() < 120) {
		cm.sendOk ("等级不足 120 级，无法挑战。"); 
		cm.dispose();
		} else if (cm.getBossLog("挑战树精") > 6) {
			cm.sendOk ("只能传送 6 次。"); 
		cm.dispose();
			} else if (cm.getPlayerCount(541020800) > 0 || cm.getPlayerCount(541020800) > 0) {
        cm.sendNext("当前副本有人正在挑战，稍后再试");
        cm.dispose();
		} else {
			cm.setBossLog("挑战树精")
			cm.warp(541020800);
			//cm.刷新地图(541020800);
			//cm.warp(240060200);
			cm.dispose()

                   }}
				   
		
	if (selection == 4) {
		
		var selStr = "";
        selStr +="   ┎~---------------------------------------------~┒ \r\n"
         selStr +="               #r 跑     环     地     图#k  "
		for (var i = 0; i < fubenmaps.length; i++) {
			if(i % 4 ==0)

		selStr +="\r\n"
		selStr += "#L" + i + "##b｜#k" + fubenmaps[i][2] + "#b｜#k#l";
		}
         selStr +="\r\n\r\n   ┕~---------------------------------------------~┙ \r\n"
		cm.sendSimple(selStr);
		monsters = 1;
		}
		
		if (selection == 4) {
			cm.dispose();
			cm.openNpc(9120009);
		}
		if (selection == 10) {
			cm.dispose();
			cm.openNpc(9000435,1111);
		}
		if (selection == 51) {
			cm.dispose();
			cm.openNpc(9900004,"次元传送");
		}
		if (selection == 52) {
    		if (cm.haveItem(5010019)) {
    		    cm.openNpc(9900004, "跨频道BOSS传送");
    		} else {
    		    cm.openNpc(9900004, "传送中心刷新显示");
    		}

		}
		if (selection == 5111) {
            cm.warp(109040001,0);;//cm.warp(240010101);;
		}
		
		if (selection == 7) {
			var selStr = "\r\n";
				selStr += "\t\t\t"+传送中心+"\t #n\r\n\r\n";
				selStr += "#L0#"+蝴蝶+"#b收集#v4000016##l   #L1#"+蝴蝶+"收集#v4000008##l  #L2#"+蝴蝶+"收集#v4000002##l\r\n\r\n";
				selStr += "#L3#"+蝴蝶+"#b收集#v4000007##l  #L4#"+蝴蝶+"收集#v4000029##l  #L5#"+蝴蝶+"收集#v4000023##l\r\n\r\n";
				selStr += "#L6#"+蝴蝶+"#b收集#v4000011##l  #L7#"+蝴蝶+"收集#v4000009##l  #L8#"+蝴蝶+"收集#v4000037##l\r\n\r\n";
				selStr += "#L9#"+蝴蝶+"#b收集#v4000042##l  #L10#"+蝴蝶+"收集#v4000032##l  #L11#"+蝴蝶+"收集#v4000039##l\r\n\r\n";
				selStr += "#L12#"+蝴蝶+"#b收集#v4000045##l  #L13#"+蝴蝶+"收集#v4000052##l  #L14#"+蝴蝶+"收集#v4000060##l\r\n\r\n";
				selStr += "#L15#"+蝴蝶+"#b收集#v4000069##l   #L16#"+蝴蝶+"收集#v4000074##l  #L17#"+蝴蝶+"收集#v4000102##l\r\n\r\n";
				selStr += "#L18#"+蝴蝶+"#b收集#v4000106##l   #L19#"+蝴蝶+"收集#v4000115##l  #L20#"+蝴蝶+"收集#v4000128##l\r\n\r\n";
				selStr += "#L21#"+蝴蝶+"#b收集#v4000143##l  #L22#"+蝴蝶+"收集#v4000162##l  #L23#"+蝴蝶+"收集#v4000180##l\r\n\r\n";
				selStr += "#L24#"+蝴蝶+"#b收集#v4000182##l   #L25#"+蝴蝶+"收集#v4000183##l  #L26#"+蝴蝶+"收集#v4000188##l\r\n\r\n";
				selStr += "#L27#"+蝴蝶+"#b收集#v4000191##l  #L28#"+蝴蝶+"收集#v4000192##l  #L29#"+蝴蝶+"收集#v4000197##l\r\n\r\n";
				selStr += "#L30#"+蝴蝶+"#b收集#v4000205##l  #L31#"+蝴蝶+"收集#v4000207##l  #L32#"+蝴蝶+"收集#v4000373##l\r\n\r\n";
				selStr += "#L33#"+蝴蝶+"#b收集#v4000292##l  #L34#"+蝴蝶+"收集#v4000294##l  #L35#"+蝴蝶+"收集#v4000329##l\r\n\r\n";
				selStr += "#L36#"+蝴蝶+"#b收集#v4000330##l  #L37#"+蝴蝶+"收集#v4000331##l  #L38#"+蝴蝶+"收集#v4000354##l\r\n\r\n";
				selStr += "#L39#"+蝴蝶+"#b收集#v4000089##l  #L40#"+蝴蝶+"收集#v4000066##l  #L41#"+蝴蝶+"收集#v4000075##l\r\n\r\n";
				selStr += "#L42#"+蝴蝶+"#b收集#v4000080##l  #L43#"+蝴蝶+"收集#v4000281##l  #L44#"+蝴蝶+"收集#v4000298##l\r\n\r\n";
				selStr += "#L45#"+蝴蝶+"#b收集#v4000282##l  #L46#"+蝴蝶+"收集#v4000465##l  #L47#"+蝴蝶+"收集#v4000472##l\r\n\r\n";
				selStr += "#L48#"+蝴蝶+"#b收集#v4000469##l  #L49#"+蝴蝶+"收集#v4000375##l  #L50#"+蝴蝶+"收集#v4000433##l\r\n\r\n";
				selStr += "#L51#"+蝴蝶+"#b收集#v4000432##l  #L52#"+蝴蝶+"收集#v4000434##l  #L53#"+蝴蝶+"收集#v4000118##l\r\n\r\n";
				selStr += "#L54#"+蝴蝶+"#b收集#v4000172##l  #L55#"+蝴蝶+"收集#v4000440##l  #L56#"+蝴蝶+"收集#v4000439##l\r\n\r\n";
				selStr += "#L57#"+蝴蝶+"#b收集#v4000085##l  #L58#"+蝴蝶+"收集#v4000050##l  #L59#"+蝴蝶+"收集#v4000049##l\r\n\r\n";
				selStr += "#L60#"+蝴蝶+"#b收集#v4000272##l  #L61#"+蝴蝶+"收集#v4000268##l  #L62#"+蝴蝶+"收集#v4000241##l\r\n\r\n";
				selStr += "#L63#"+蝴蝶+"#b收集#v4000233##l  #L64#"+蝴蝶+"收集#v4000236##l  #L65#"+蝴蝶+"收集#v4000240##l\r\n\r\n";
				selStr += "#L66#"+蝴蝶+"#b收集#v4000166##l  #L67#"+蝴蝶+"收集#v4000163##l  #L68#"+蝴蝶+"收集#v4000027##l\r\n\r\n";
				selStr += "#L69#"+蝴蝶+"#b收集#v4000028##l  #L70#"+蝴蝶+"收集#v4000127##l  #L71#"+蝴蝶+"收集#v4000402##l\r\n\r\n";
				selStr += "#L72#"+蝴蝶+"#b收集#v4000394##l  #L73#"+蝴蝶+"收集#v4000444##l  #L74#"+蝴蝶+"收集#v4000447##l\r\n\r\n";
				selStr += "#L75#"+蝴蝶+"#b收集#v4000449##l  #L76#"+蝴蝶+"收集#v4000452##l  #L77#"+蝴蝶+"收集#v4000454##l\r\n\r\n";
				selStr += "#L78#"+蝴蝶+"#b收集#v4000457##l  #L79#"+蝴蝶+"收集#v4001006##l  #L80#"+蝴蝶+"收集#v4000082##l\r\n\r\n";
				selStr += "#L81#"+蝴蝶+"#b收集#v4000436##l  #L82#"+蝴蝶+"收集#v4000054##l  #L83#"+蝴蝶+"收集#v4000053##l\r\n\r\n";
				selStr += "#L84#"+蝴蝶+"#b收集#v4031227##l  #L85#"+蝴蝶+"收集#v4000178##l  #L86#"+蝴蝶+"收集#v4000068##l\r\n\r\n";
				selStr += "#L87#"+蝴蝶+"#b收集#v4000067##l  \r\n\r\n";
			cm.sendSimple(selStr);
			paohuanmonsters = 1;
		}
		
		if (selection == 8) {
           cm.openNpc(1072003,1);;
            cm.dispose();
		}
		if (selection == 9) {
           cm.openNpc(9250028,1);;
            cm.dispose();
		}
		if (selection == 11) {
			var selStr = "\r\n";
				selStr += "\t\t\t"+传送中心+"\t #n\r\n\r\n";
				selStr += "#L0#"+蝴蝶+"#b蜈蚣王\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				//selStr += "#L1#"+蝴蝶+"#b艾里葛斯\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				selStr += "#L2#"+蝴蝶+"#b少林妖僧\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				selStr += "#L3#"+蝴蝶+"#b巨魔蝙蝠怪\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				selStr += "#L4#"+蝴蝶+"#b闹钟\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				//selStr += "#L5#"+蝴蝶+"#b肯德熊#l\r\n\r\n";
				selStr += "#L5#"+蝴蝶+"#b鱼王\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";//#v1382045##v1382046##v1382047##v1382048#
				selStr += "#L7#"+蝴蝶+"#b暗黑龙王\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				selStr += "#L8#"+蝴蝶+"#b品客缤\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				selStr += "#L9#"+蝴蝶+"#b蜘蛛女皇\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				//selStr += ""+蝴蝶+"#b暴力熊\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n\r\n";
				//selStr += ""+蝴蝶+"#b巨大树精\r\n#k几率获得"+蓝色箭头+""+蓝色箭头+"#l\r\n";
				//add += "#L12#"+蝴蝶+"暴力熊"+蝴蝶+"#l#L13#"+蝴蝶+"大树精"+蝴蝶+"#l\r\n\r\n";
				cm.sendSimple(selStr);
				zhaohuanbosses = 1;
		}
		if (selection == 1211) {
           cm.openNpc(1072003,2);;
            cm.dispose();
		}
		if (selection == 21) {
			if (cm.getLevel() < 120) {
					cm.sendOk ("你的等级不足120级，无法挑战。"); 
					cm.dispose();
				} else if (cm.getBossLog("幸运福袋") > 2) {
					cm.sendOk ("每天最多只能挑战3次幸运福袋！"); 
					cm.dispose();
				} else {
					cm.setBossLog("幸运福袋")
					cm.warp(910000053);
					cm.dispose();
				}}
		if (selection == 22) {
			cm.warp(600000001);
            cm.dispose();
		}
		if (selection == 23) {
			cm.warp(104040005);
            cm.dispose();
		}
		if (selection == 24) {
			cm.warp(541020000);
            cm.dispose();
		}
		if (selection == 25) {
			cm.warp(541010010);
            cm.dispose();
		}
		if (selection == 26) {
			cm.warp(600020300);
            cm.dispose();
		}
		if (selection == 27) {
			cm.warp(103000103);
            cm.dispose();
		}
	    if (selection == 131) {
			if (cm.getLevel() < 120) {
					cm.sendOk ("你的等级不足120级，无法挑战。"); 
					cm.dispose();
				} else if (cm.getBossLog("挑战树精") > 6) {
					cm.sendOk ("每天最多只能挑战6次树精！"); 
					cm.dispose();
				} else if (cm.getPlayerCount(541020800) > 0 || cm.getPlayerCount(541020800) > 0) {
					cm.sendNext("当前频道有人正在挑战，稍后再试！");
					cm.dispose();
				} else {
					cm.setBossLog("挑战树精")
					cm.warp(541020800);
					cm.刷新地图(541020800);
					cm.dispose();
				}}
		if (selection == 121) {
			if (cm.getLevel() < 120) {
		cm.sendOk ("等级不足 120 级，无法挑战。"); 
		cm.dispose();
		} else if (cm.getBossLog("挑战暴力熊") > 6) {
			cm.sendOk ("只能传送 6次。"); 
		cm.dispose();
			} else if (cm.getPlayerCount(551030200) > 0 && cm.getBossLog('挑战暴力熊') < 6|| cm.getPlayerCount(551030200) > 0) {
        cm.sendNext("当前副本有人正在挑战，稍后再试");
        cm.dispose();
		} else {
			cm.setBossLog("挑战暴力熊")
			cm.warp(551030200);
			cm.刷新地图(551030200);
			cm.dispose()
	
                   }}


//------------------------------------------------------------------------

	} else if (status == 2) {

	if (towns == 1) {
		cm.sendYesNo("你确定要去" + townmaps[selection][2] + "？");
		chosenMap = selection;
		towns = 2;

	} else if (monsters == 1) {
		cm.sendYesNo("你确定要去" + monstermaps[selection][2] + "？");
		chosenMap = selection;
		monsters = 2;

	} else if (paohuanmonsters == 1) {
		cm.sendYesNo("你确定要去" + paohuanmonstermaps[selection][2] + "？");
		chosenMap = selection;
		paohuanmonsters = 2;

	} else if (bosses == 1) {
		cm.sendYesNo("你确定要去" + bossmaps[selection][2] + "？");
		chosenMap = selection;
		bosses = 2;
		
	} else if (zhaohuanbosses == 1 && selection < 10) {
		if (selection < 10) {
			cm.sendYesNo("你确定要去" + zhaohuanbossmaps[selection][2] + "？");
			chosenMap = selection;
			zhaohuanbosses = 2;
		}
		else {
			if (selection == 121) {
				if (cm.getLevel() < 120) {
					cm.sendOk ("你的等级不足120级，无法挑战。"); 
					cm.dispose();
				} else if (cm.getBossLog("挑战暴力熊") > 2) {
					cm.sendOk ("每天最多只能挑战3次暴力熊！"); 
					cm.dispose();
				} else if (cm.getPlayerCount(551030200) > 0 && cm.getBossLog('挑战暴力熊') < 2|| cm.getPlayerCount(551030200) > 0) {
					cm.sendNext("当前频道有人正在挑战，稍后再试！");
					cm.dispose();
				} else {
					cm.setBossLog("挑战暴力熊")
					cm.warp(551030200);
					cm.刷新地图();
					cm.dispose()
				}
			}else if (selection == 131) {
				if (cm.getLevel() < 120) {
					cm.sendOk ("你的等级不足120级，无法挑战。"); 
					cm.dispose();
				} else if (cm.getBossLog("挑战树精") > 2) {
					cm.sendOk ("每天最多只能挑战3次树精！"); 
					cm.dispose();
				} else if (cm.getPlayerCount(541020800) > 0 || cm.getPlayerCount(541020800) > 0) {
					cm.sendNext("当前频道有人正在挑战，稍后再试！");
					cm.dispose();
				} else {
					cm.setBossLog("挑战树精")
					cm.warp(541020800);
					cm.刷新地图();
					cm.dispose();
				}
			}
		}
	} else if (fuben == 1) {
		cm.sendYesNo("你确定要去" + fubenmaps[selection][2] + "？");
		chosenMap = selection;
		fuben = 2;

	}

//----------------------------------------------------------------------

	} else if (status == 3) {

	if (towns == 2) {
		if(cm.getMeso()>=townmaps[chosenMap][1]){
		cm.warp(townmaps[chosenMap][0], 0);
		cm.gainMeso(-townmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (monsters == 2) {
		if(cm.getMeso()>=monstermaps[chosenMap][1]){
		cm.warp(monstermaps[chosenMap][0], 0);
		cm.gainMeso(-monstermaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (paohuanmonsters == 2) {
		if(cm.getMeso()>=paohuanmonstermaps[chosenMap][1]){
		cm.warp(paohuanmonstermaps[chosenMap][0], 0);
		cm.gainMeso(-paohuanmonstermaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (bosses == 2) {
		if(cm.getMeso()>=bossmaps[chosenMap][1]){
		cm.warp(bossmaps[chosenMap][0], 0);
		cm.gainMeso(-bossmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();
	
	} else if (zhaohuanbosses == 2) {
		if(cm.getMeso()>=zhaohuanbossmaps[chosenMap][1]){
		cm.warp(zhaohuanbossmaps[chosenMap][0], 0);
		cm.gainMeso(-zhaohuanbossmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

	} else if (fuben == 2) {
		if(cm.getMeso()>=fubenmaps[chosenMap][1]){
		cm.warp(fubenmaps[chosenMap][0], 0);
		cm.gainMeso(-fubenmaps[chosenMap][1]);
		}else{
		cm.sendOk("你没有足够的金币哦!");
		}
		cm.dispose();

                }

//------------------------------------------------------------------------

		}
		}
		}