/*
天启冒险岛(079)游戏服务端
天启QQ：870074996
 */
var 蛋 = 5220040;
var status = 0;
var cjCount = 2;
//物品ID，抽奖概率，物品数量，(0/不广播，1广播)

var itemList1 = Array(
		Array(2290096, 5, 1, 1), //冒险岛勇士
		Array(2079995, 4, 1, 1), //龙背标
		Array(2022552, 88, 1, 1), //轮回
		Array(2049104, 888, 1, 1),//恶魔卷轴
		Array(2049124, 999, 1, 1),//高级混沌卷轴%20
		Array(2049100, 788, 1, 1),//混沌卷%60
		Array(2340000, 788, 1, 1),//祝福卷轴
		Array(2460005, 888, 1, 1),//坚定放大镜
		Array(2531000, 888, 1, 1),//防爆卷轴
		Array(2531000, 555, 1, 1),//高级防爆卷轴
		Array(4310108, 666, 1, 1),//点卷币
		Array(1032206, 166, 1, 1),//神话耳环复原1阶段
		Array(1032207, 167, 1, 1),//神话耳环复原2阶段
		Array(1032208, 168, 1, 1),//神话耳环复原3阶段
		Array(1032209, 22, 1, 1),//神话耳环复原4阶段
        Array(1012170, 67, 1, 1),//恐怖鬼娃的伤口
		Array(1012171, 68, 1, 1),//恐怖鬼娃的伤口
		Array(1012172, 69, 1, 1),//恐怖鬼娃的伤口
		Array(1012173, 18, 1, 1),//恐怖鬼娃的伤口
		Array(1032030, 33, 1, 1),//勇气耳环
		Array(1032039, 135, 1, 1),//暗月耳环
		Array(1032060, 134, 1, 1),//阿尔泰耳环
		Array(1032061, 123, 1, 1),//发光的阿尔泰耳环
		Array(1032062, 28, 1, 1),//元素耳环
		Array(1032083, 16, 1, 1),//末代不速之客耳环
		Array(1032084, 28, 1, 1),//至尊不速之客耳环
	    Array(1032221, 20, 1, 1),//中级贝勒德耳环
		Array(1032222, 5, 1, 1),//高级贝勒德耳环
		Array(1032223, 2, 1, 1),//最高就贝勒德耳环
		
	    Array(1112421, 166, 1, 1),//灵感灯戒指
		Array(1112422, 233, 1, 1),//炫色板戒指
		Array(1112423, 188, 1, 1),//银笔尖戒指 
		Array(1112424, 156, 1),//黑羽笔戒指
		Array(1112425, 167, 1),//金怀表戒指
		Array(1112426, 137, 1, 1),//蒲公英戒指
		Array(1113040, 20, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113063, 19, 1, 1),//守护巨匠不朽戒指
		Array(1113064, 26, 1, 1),//狂战士的匠人不朽戒指
		Array(1113065, 24, 1, 1),//霸王的匠人永恒戒指
		Array(1113066, 23, 1, 1),//神使匠人的永恒戒指
		Array(1112672, 5, 1, 1),//传说枫叶银戒指
		Array(1113073, 20, 1, 1),//中级贝勒德戒指
		Array(1113074, 11, 1, 1),//高级贝勒德戒指
		Array(1113075, 2, 1, 1),//最高级贝勒德戒指
		Array(1112743, 2, 1, 1),//专属枫叶紫金戒指
		Array(1122267, 5, 1),//最高级贝勒德吊坠
		Array(1132246, 88, 1, 1),//最高级贝勒德腰带
		Array(1122236, 42, 1, 1),//觉醒的心之项链
		Array(1122237, 43, 1, 1),//觉醒的心之项链
		Array(1122238, 44, 1, 1),//觉醒的心之项链
		Array(1122239, 45, 1, 1),//觉醒的心之项链
		Array(1122240, 46, 1, 1),//觉醒的心之项链
		Array(1132211, 68, 1, 1),//冒险岛强韧意志黄色腰带
		Array(1132212, 67, 1, 1),//冒险岛强韧意志绿色腰带
		Array(1132213, 66, 1, 1),//冒险岛强韧意志蓝色腰带
		Array(1132214, 15, 1, 1),//冒险岛强韧意志红色腰带
		Array(1022021, 133, 1, 1),//晕呼呼红色眼睛
		Array(1022022, 134, 1, 1),//晕呼呼绿色眼睛
		Array(1022066, 165,1, 1),//蓝海星眼睛
		Array(1022073, 75, 1, 1),//划痕眼睛
		Array(1022089, 76, 1, 1),//考古学家眼睛
		Array(1022097, 42, 1, 1),//龙眼睛
		Array(1022117, 38, 1, 1),//玛瑙龙眼睛
		Array(1022132, 36, 1, 1),//升级眼睛
		Array(1022134, 34, 1, 1),//泪滴
		Array(1022137, 8, 1, 1),//神圣拯救者护目镜
		Array(1422156, 16, 1, 1),//红色巨锤
		Array(1402214, 13, 1, 1),//红色双手剑
		Array(1432182, 14, 1, 1),//红色长枪
		Array(1382226, 17, 1, 1),//红色长仗
		Array(1472230, 14, 1, 1),//红色拳套
		Array(1332242, 15, 1, 1),//红色切割者
		Array(1452220, 15, 1, 1),//红色弓
		Array(1462208, 18, 1, 1),//红色之弩
		Array(1482183, 20, 1, 1),//红色拳甲
		Array(1492194, 21, 1, 1),//红色短枪
		Array(1462252, 3, 1, 1),//传说神器弩
		Array(1302355, 3, 1, 1),//传说神器单手剑
		Array(1402268, 2, 1, 1),//传说神器双手剑
		Array(1022134, 3, 1, 1),//传说神器短刀
		Array(1432227, 3, 1, 1),//传说神器枪
		Array(1442285, 3, 1, 1),//传说神器矛
		Array(1452266, 3, 1, 1),//传说神器弓
		Array(1472275, 3, 1, 1),//传说神器拳套
		Array(1482232, 3, 1, 1),//传说神器指节
		Array(1492245, 3, 1, 1),//传说神器短枪
		Array(1322204, 3, 1, 1),//传说神器单手钝器
		Array(1422141, 3, 1, 1),//传说神器双手钝器
		Array(1112668, 2, 1, 1),//传说戒指
		Array(1032129, 1, 1, 1),//希望树耳环
		Array(1122185, 1, 1, 1),//希望树项链
		Array(1132135, 1, 1, 1),//希望树腰带
		Array(1132169, 133, 1, 1),//T2腰带
		Array(1004234, 134, 1, 1),//T2头盔
		Array(1082613, 135, 1, 1),//T2护手
		Array(1052804, 136, 1, 1),//T2套服
		Array(1072972, 137, 1, 1),//T2鞋子
		Array(1102713, 138, 1, 1),//T2披风
		Array(1099011, 139, 1, 1),//T2盾牌
		Array(1132174, 45, 1, 1),//T1腰带
		Array(1003798, 46, 1, 1),//T1帽子
		Array(1082543, 47, 1, 1),//T1手套
		Array(1052888, 48, 1, 1),//T1套服
		Array(1072743, 49, 1, 1),//T1鞋子
		Array(1102481, 48, 1, 1),//T1披风
		Array(1098004, 55, 1, 1)//T1盾牌
    );
	
	
        
var itemlist21 = Array(
		Array(1132156, 16, 1, 1),//T0腰带
		Array(1003601, 21, 1, 1),//T0头盔
		Array(1082472, 22, 1, 1),//T0手套
		Array(1052509, 25, 1, 1),//T0衣服
		Array(1098007, 29, 1, 1),//T0盾牌
		Array(1072711, 24, 1, 1),//T0鞋子
		Array(1302290, 24, 1, 1),//T0单手剑
		Array(1332239, 13, 1, 1),//T0短刀
		Array(1382223, 17, 1, 1),//T0长仗
		Array(1402211, 12, 1, 1),//T0双手剑
		Array(1432179, 14, 1, 1),//T0枪
		Array(1442235, 12, 1, 1),//T0矛
		Array(1452217, 11, 1, 1),//T0弓
		Array(1472227, 8, 1, 1),//T0拳套
		Array(1482180, 18, 1, 1),//T0指节
		Array(1492191, 19, 1, 1),//T0短枪
		Array(1102456, 16, 1, 1),//T0披风
		Array(1302275, 67, 1, 1),//T1单手剑
		Array(1332225, 68, 1, 1),//T1短刀
		Array(1382208, 69, 1, 1),//T1长仗
		Array(1402196, 67, 1, 1),//T1双手剑
		Array(1432167, 70, 1, 1),//T1枪
		Array(1442223, 70, 1, 1),//T1矛
		Array(1452205, 67, 1, 1),//T1弓
		Array(1462193, 75, 1, 1),//T1弩
		Array(1472214, 66, 1, 1),//T1拳套
		Array(1482168, 78, 1, 1),//T1爪子
		Array(1492179, 72, 1, 1)//T1短枪
);

var itemList = Array(
		Array(2290096, 35, 1, 1), //冒险岛勇士
		Array(2079995, 18, 1, 1), //龙背标
		
		Array(2022552, 288, 1, 1), //轮回
		
		Array(2049104, 888, 1, 1),//恶魔卷轴
		Array(2049124, 999, 1, 1),//高级混沌卷轴%20
		
		Array(2460005, 888, 1, 1),//坚定放大镜
		Array(2531000, 888, 1, 1),//防爆卷轴
		Array(2531000, 555, 1, 1),//高级防爆卷轴
		Array(4310108, 666, 1, 1),//点卷币
		
		//Array(4443200, 777, 1, 1),//B级敏捷
		Array(1032206, 96, 1, 1),//神话耳环复原1阶段
		Array(1032207, 97, 1, 1),//神话耳环复原2阶段
		Array(1032208, 98, 1, 1),//神话耳环复原3阶段
		Array(1032209, 52, 1, 1),//神话耳环复原4阶段
        Array(1012170, 167, 1, 1),//恐怖鬼娃的伤口
		Array(1012171, 168, 1, 1),//恐怖鬼娃的伤口
		Array(1012172, 169, 1, 1),//恐怖鬼娃的伤口
		Array(1012173, 28, 1, 1),//恐怖鬼娃的伤口
		Array(1032030, 33, 1, 1),//勇气耳环
		Array(1032039, 135, 1, 1),//暗月耳环
		Array(1032060, 134, 1, 1),//阿尔泰耳环
		Array(1032061, 123, 1, 1),//发光的阿尔泰耳环
		Array(1032062, 28, 1, 1),//元素耳环
		Array(1032083, 36, 1, 1),//末代不速之客耳环
		Array(1032084, 28, 1, 1),//至尊不速之客耳环
	    Array(1032221, 20, 1, 1),//中级贝勒德耳环
		Array(1032222, 65, 1, 1),//高级贝勒德耳环
		Array(1032223, 2, 1, 1),//最高就贝勒德耳环
		
	    Array(1112421, 266, 1, 1),//灵感灯戒指
		Array(1112422, 233, 1, 1),//炫色板戒指
		Array(1112423, 188, 1, 1),//银笔尖戒指 
		Array(1112424, 156, 1),//黑羽笔戒指
		Array(1112425, 167, 1),//金怀表戒指
		Array(1112426, 137, 1, 1),//蒲公英戒指
		Array(1113040, 20, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113063, 19, 1, 1),//守护巨匠不朽戒指
		Array(1113064, 26, 1, 1),//狂战士的匠人不朽戒指
		Array(1113065, 24, 1, 1),//霸王的匠人永恒戒指
		Array(1113066, 23, 1, 1),//神使匠人的永恒戒指
		Array(1112672, 5, 1, 1),//传说枫叶银戒指
		Array(1113073, 20, 1, 1),//中级贝勒德戒指
		Array(1113074, 11, 1, 1),//高级贝勒德戒指
		Array(1113075, 2, 1, 1),//最高级贝勒德戒指
		Array(1112743, 2, 1, 1),//专属枫叶紫金戒指
		Array(1122265, 100, 1, 1),//中级贝勒德吊坠
		Array(1122266, 33, 1, 1),//高级贝勒德吊坠
		Array(1122267, 5, 1),//最高级贝勒德吊坠
		Array(1132244, 155, 1, 1),//中级贝勒德腰带
		Array(1132245, 133, 1, 1),//高级贝勒德腰带
		Array(1132246, 58, 1, 1),//最高级贝勒德腰带
		Array(1122236, 42, 1, 1),//觉醒的心之项链
		Array(1122237, 43, 1, 1),//觉醒的心之项链
		Array(1122238, 44, 1, 1),//觉醒的心之项链
		Array(1122239, 45, 1, 1),//觉醒的心之项链
		Array(1122240, 46, 1, 1),//觉醒的心之项链
		Array(1132211, 68, 1, 1),//冒险岛强韧意志黄色腰带
		Array(1132212, 67, 1, 1),//冒险岛强韧意志绿色腰带
		Array(1132213, 66, 1, 1),//冒险岛强韧意志蓝色腰带
		Array(1132214, 25, 1, 1),//冒险岛强韧意志红色腰带
		Array(1022021, 133, 1, 1),//晕呼呼红色眼睛
		Array(1022022, 134, 1, 1),//晕呼呼绿色眼睛
		Array(1022066, 125,1, 1),//蓝海星眼睛
		Array(1022073, 75, 1, 1),//划痕眼睛
		Array(1022089, 76, 1, 1),//考古学家眼睛
		Array(1022097, 42, 1, 1),//龙眼睛
		Array(1022117, 38, 1, 1),//玛瑙龙眼睛
		Array(1022132, 36, 1, 1),//升级眼睛
		Array(1022134, 34, 1, 1),//泪滴
		Array(1022137, 18, 1, 1),//神圣拯救者护目镜
		Array(1422156, 16, 1, 1),//红色巨锤
		Array(1402214, 13, 1, 1),//红色双手剑
		Array(1432182, 14, 1, 1),//红色长枪
		Array(1382226, 17, 1, 1),//红色长仗
		Array(1472230, 14, 1, 1),//红色拳套
		Array(1332242, 15, 1, 1),//红色切割者
		Array(1452220, 15, 1, 1),//红色弓
		Array(1462208, 18, 1, 1),//红色之弩
		Array(1482183, 20, 1, 1),//红色拳甲
		Array(1492194, 21, 1, 1),//红色短枪
		Array(1462252, 4, 1, 1),//传说神器弩
		Array(1302355, 4, 1, 1),//传说神器单手剑
		Array(1402268, 4, 1, 1),//传说神器双手剑
		Array(1022134, 4, 1, 1),//传说神器短刀
		Array(1432227, 3, 1, 1),//传说神器枪
		Array(1442285, 3, 1, 1),//传说神器矛
		Array(1452266, 3, 1, 1),//传说神器弓
		Array(1472275, 4, 1, 1),//传说神器拳套
		Array(1482232, 10, 1, 1),//传说神器指节
		Array(1492245, 10, 1, 1),//传说神器短枪
		Array(1322204, 10, 1, 1),//传说神器单手钝器
		Array(1422141, 10, 1, 1),//传说神器双手钝器
		Array(1112668, 1, 1, 1),//传说戒指
		Array(1032129, 1, 1, 1),//希望树耳环
		Array(1122185, 1, 1, 1),//希望树项链
		Array(1132135, 11, 1, 1),//希望树腰带
		Array(1132287, 111, 1, 1),//T3腰带
		Array(1004492, 112, 1, 1),//T3帽子
		Array(1082647, 111, 1, 1),//T3手套
		Array(1052929, 111, 1, 1),//T3套装
		Array(1073057, 111, 1, 1),//T3鞋子
		Array(1102828, 111, 1, 1),//T3披风
		Array(1099003, 111, 1, 1),//T3盾牌
		Array(1102828, 111, 1, 1),//T3披风
		Array(1132169, 133, 1, 1),//T2腰带
		Array(1004234, 134, 1, 1),//T2头盔
		Array(1082613, 135, 1, 1),//T2护手
		Array(1052804, 136, 1, 1),//T2套服
		Array(1072972, 137, 1, 1),//T2鞋子
		Array(1102713, 138, 1, 1),//T2披风
		Array(1099011, 139, 1, 1),//T2盾牌
		Array(1132174, 88, 1, 1),//T1腰带
		Array(1003798, 46, 1, 1),//T1帽子
		Array(1082543, 47, 1, 1),//T1手套
		Array(1052888, 48, 1, 1),//T1套服
		Array(1072743, 49, 1, 1),//T1鞋子
		Array(1102481, 48, 1, 1),//T1披风
		Array(1098004, 55, 1, 1)//T1盾牌
    );
	
	
        
var itemlist2 = Array(
		Array(1132156, 16, 1, 1),//T0腰带
		Array(1003601, 21, 1, 1),//T0头盔
		Array(1082472, 22, 1, 1),//T0手套
		Array(1052509, 25, 1, 1),//T0衣服
		Array(1098007, 29, 1, 1),//T0盾牌
		Array(1072711, 24, 1, 1),//T0鞋子
		Array(1302290, 24, 1, 1),//T0单手剑
		Array(1332239, 13, 1, 1),//T0短刀
		Array(1382223, 17, 1, 1),//T0长仗
		Array(1402211, 12, 1, 1),//T0双手剑
		Array(1432179, 14, 1, 1),//T0枪
		Array(1442235, 12, 1, 1),//T0矛
		Array(1452217, 11, 1, 1),//T0弓
		Array(1472227, 28, 1, 1),//T0拳套
		Array(1482180, 18, 1, 1),//T0指节
		Array(1492191, 19, 1, 1),//T0短枪
		Array(1102456, 16, 1, 1),//T0披风
		Array(1132287, 144, 1, 1),//T3腰带
		Array(1004492, 143, 1, 1),//T3帽子
		Array(1082647, 135, 1, 1),//T3手套
		Array(1052929, 136, 1, 1),//T3套装
		Array(1073057, 142, 1, 1),//T3鞋子
		Array(1102828, 112, 1, 1),//T3披风
		Array(1099003, 135, 1, 1),//T3盾牌
		Array(1102828, 115, 1, 1),//T3披风
		Array(1302275, 67, 1, 1),//T1单手剑
		Array(1332225, 88, 1, 1),//T1短刀
		Array(1382208, 69, 1, 1),//T1长仗
		Array(1402196, 67, 1, 1),//T1双手剑
		Array(1432167, 69, 1, 1),//T1枪
		Array(1442223, 90, 1, 1),//T1矛
		Array(1452205, 67, 1, 1),//T1弓
		Array(1462193, 115, 1, 1),//T1弩
		Array(1472214, 66, 1, 1),//T1拳套
		Array(1482168, 78, 1, 1),//T1爪子
		Array(1492179, 72, 1, 1)//T1短枪
);


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            // cm.sendOk("你没有 " + cm.显示物品(5220000) + " ？");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.getmoneyb() >= 10) {
            var zs = "";
            for (var cts = 0; cts <= itemList1.length; cts++) {
                if (itemList1[cts] != undefined) {
                    zs += "#v" + itemList1[cts][0] + "#" ;
                }
            }
			for (var cts2 = 0; cts2 <= itemlist21.length; cts2++) {
                if (itemlist21[cts2] != undefined) {
                    zs += "#v" + itemlist21[cts2][0] + "#" ;
                }
            }
            cm.sendOk("欢迎光临，10元宝抽1次，运气好能抽到极品装备哦#r\r\nPS：抽奖前请确认你背包有足够的位置，道具被吞，概不负责！\r\n奖池如下:\r\n" + zs);
        } else {
            //cm.sendOk("抽一次奖需要10张" + cm.显示物品(5220000) + "抽十次，你背包里有足够的#b" + cm.显示物品(5220000) + "#k吗，运气好能抽到极品装备哦#r\r\nPS：抽奖前请确认你背包有足够的位置，道具被吞，概不负责！\r\n");
            cm.sendOk("你没有10元宝 ？");
            cm.safeDispose();
        }
    } else if (status == 1) {
        if (cm.getSpace(1) < 1 || cm.getSpace(2) < 1 || cm.getSpace(4) < 1|| cm.getSpace(3) < 1) {
            cm.sendOk("请把装备栏,消耗栏,其他栏，空出1个格子，设置栏空出1个格子出来");
            cm.dispose();
            return;
        }
        //for(var cjs = 0; cjs < cjCount;cjs++){
        
        var finalitem = Array();
		var finalitemT = Array();
		var strs = "您获得了：\r\n";
		// for (var ct = 0; ct <= 10; ct++) {
			var chance = Math.floor(Math.random() * 1000);
			for (var i = 0; i < itemList.length; i++) {
				if (itemList[i][1] >= chance) {
					finalitem.push(itemList[i]);
				}
			}
			for (var i1 = 0; i1 < itemlist2.length; i1++) {
				if (itemlist2[i1][1] >= chance) {
					finalitem.push(itemlist2[i1]);
				}
			}
			if (finalitem.length != 0) {
				var item;
				var finalchance = Math.floor(Math.random() * finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
				var notice = finalitem[finalchance][3];
				item = cm.gainGachaponItem(itemId, quantity, "元宝抽奖", 1, "恭喜获得道具!", 14);
				// cm.道具喇叭("抽奖公告", "[" + cm.getPlayer().getName() + "]通过抽奖获得", item);
				if (item != -1) {
					cm.setmoneyb(-10);	
					cm.setBossRankCount2("抽奖积分",1);
					cm.logToFile_chr("游戏记录/元宝抽奖记录.txt", " 玩家角色名称："+cm.getPlayer().getName()+"  账号："+cm.getPlayer().getClient().getAccountName()+" " + cm.getItemName(item) + " 共消耗元宝 -10 最终元宝 "+(cm.getmoneyb())+"\n");	
					finalitemT.push(item);
					//cm.sendOk("你获得了 " + cm.显示物品(item) + " x #b"+quantity+"#k");
				} else {
					//cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有十格以上的空间。");
				}
				//cm.safeDispose();
			} else {
				cm.sendOk("今天的运气可真差，什么都没有拿到。");
				//cm.safeDispose();
			}
		// }
		for (var cts = 0; cts <= finalitemT.length; cts++) {
			if (finalitemT[cts] != undefined) {
				strs += "" + cm.显示物品(finalitemT[cts]) + "\r\n";
			}
		}
		cm.sendOk(strs);
        cm.safeDispose();

    }
}
