var 点券图标 = "#fUI/CashShop/CashItem/0#";
var status = 0;
//普通奖池
var itemList1 = [
	//物品id，几率，数字越大概率越大，数量
//之前的系列
/*[1005745,50,1,1],
[1000127,50,1,1],
[1001126,50,1,1],
[1001131,50,1,1],
[1001137,50,1,1],
[1001143,50,1,1],
[1002597,50,1,1],
[1002605,50,1,1],
[1002608,50,1,1],
[1002661,50,1,1],
[1002667,50,1,1],
[1002696,50,1,1],
[1002697,50,1,1],
[1002714,50,1,1],
[1002723,50,1,1],
[1002726,50,1,1],
[1002728,50,1,1],
[1002735,50,1,1],
[1002736,50,1,1],
[1002745,50,1,1],*/
[1002747,50,1,1],
[1002748,50,1,1],
[1002785,50,1,1],
[1002796,50,1,1],
[1002936,50,1,1],
[1002945,50,1,1],
[1002957,50,1,1],
//[1002971,50,1,1],
[1002984,50,1,1],
[1003006,50,1,1],
[1003010,50,1,1],
[1003011,50,1,1],
[1003051,50,1,1],
//[1003065,50,1,1],
[1003078,50,1,1],
[1003104,50,1,1],
[1003367,50,1,1],
[1003420,50,1,1],
[1003422,50,1,1],
[1003435,50,1,1],
[1003482,50,1,1],
[1003483,50,1,1],
[1003484,50,1,1],
[1003506,50,1,1],
[1003668,50,1,1],
[1003688,50,1,1],
[1003713,50,1,1],
[1003778,50,1,1],
[1003843,50,1,1],
[1003845,50,1,1],
[1003859,50,1,1],
[1003862,50,1,1],
[1003882,50,1,1],
[1003889,50,1,1],
[1003901,50,1,1],
[1003918,50,1,1],
[1003919,50,1,1],
[1003921,50,1,1],
[1003925,50,1,1],
[1003940,50,1,1],
[1003943,50,1,1],
[1003954,50,1,1],
[1004025,50,1,1],
[1004034,50,1,1],
[1004056,50,1,1],
[1004164,50,1,1],
[1004170,50,1,1],
[1004191,50,1,1],
[1004201,50,1,1],
[1004254,50,1,1],
[1004287,50,1,1],
[1004289,50,1,1],
[1004295,50,1,1],
[1004336,50,1,1],
[1004337,50,1,1],
[1004346,50,1,1],
[1004355,50,1,1],
[1004402,50,1,1],
[1004414,50,1,1],
[1004416,50,1,1],
[1004453,50,1,1],
[1004472,50,1,1],
[1004499,50,1,1],
[1004500,50,1,1],
[1004503,50,1,1],
[1004533,50,1,1],
[1004576,50,1,1],
[1004590,50,1,1],
[1004601,50,1,1],
[1004603,50,1,1],
[1004610,50,1,1],
[1004618,50,1,1],
[1004619,50,1,1],
[1004620,50,1,1],
[1004633,50,1,1],
[1004692,50,1,1],
[1004700,50,1,1],
[1004701,50,1,1],
[1004711,50,1,1],
[1004718,50,1,1],
[1004725,50,1,1],
[1004726,50,1,1],
[1004727,50,1,1],
[1004730,50,1,1],
[1004847,50,1,1],
[1004862,50,1,1],
[1004863,50,1,1],
[1004931,50,1,1],
[1004944,50,1,1],
[1004949,50,1,1],
[1004952,50,1,1],
[1004956,50,1,1],
[1004962,50,1,1],
[1004963,50,1,1],
[1004968,50,1,1],
[1005016,50,1,1],
[1005034,50,1,1],
[1005067,50,1,1],
[1005253,50,1,1],
[1005283,50,1,1],
[1005308,50,1,1],
[1005309,50,1,1],
[1005316,50,1,1],
[1005332,50,1,1],
[1005333,50,1,1],
[1005343,50,1,1],
[1005363,50,1,1],
[1005399,50,1,1],
[1005400,50,1,1],
[1005402,50,1,1],
[1005410,50,1,1],
[1005420,50,1,1],
[1005533,50,1,1],
[1005634,50,1,1],
[1005719,50,1,1],
[1005791,50,1,1],
[1005792,50,1,1],
[1005992,50,1,1],
[1006001,50,1,1],
[1006010,50,1,1],
[1006087,50,1,1],
[1007000,50,1,1],
[1007003,50,1,1]
];

var useNx = 5000;
var sel0 = -1;
function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }

    if (status == 0) {
    	var txt = "#d\t\t\t#b欢迎来到『冒险岛』抽奖中心#n#k\r\n";
    	txt += "#r#L1##b点券抽奖#l\r\n\r\n\r\n";
		//txt += "#d#L2##b枫叶抽奖#l\r\n\r\n\r\n";
		txt += "";
		
		var txt2 = "";
		for (var i = 0; i < itemList1.length;  i++){
			txt2 += "#i"+itemList1[i][0]+":#";
		}
    	cm.sendSimple(txt + txt2);
    } else if (status == 1) {
		sel0 = selection;
		cm.sendGetNumber("#d请输入抽奖次数\r\n"
		+"#d点卷抽奖5000一次\r\n"
		//+"#r抽奖有保底，请看群文件"
		+"#r当前拥有点卷数量"+点券图标+": "+cm.getPlayer().getCSPoints(1)+"#k\r\n#r " ,
		1, 1, 99999
		);
	} else if(status == 2) {
    	switch (sel0) {
			case 1:
                if (cm.getPlayer().getCSPoints(1) < (useNx*selection)) {
					cm.sendOk("枫叶不足"+(useNx*selection)+"，无法抽奖");
					cm.dispose();
					return;
				} else {
					cm.getPlayer().modifyCSPoints(1, -useNx*selection);
				}
				break;
			case 2:
                if (!cm.haveItem(4001126,5000*selection)) {
					cm.sendOk("#v4001126#数量不足#r "+(5000*selection)+" #k，无法抽奖");
					cm.dispose();
					return;
				} else {
					cm.gainItem(4001126, -(5000*selection));
				}
				break;
			default:
				cm.sendOk("脚本出错，请联系管理员");
				cm.dispose();
				return;
        }
		var txt = "恭喜你获得道具：\r\n";
		for (var i = 0; i < selection; i++) {
			var item;
			var ran = Math.floor(Math.random() * 100);
			var ran1 = null;
			ran1 = finalGift(itemList1);
			if(cm.getBossRankCount("屏蔽"+ran1[0]) > 0){
				cm.gainGachaponItem2(4001126, 1, "自由金猪", ran1[3]);
			//}else{
			//	cm.gainGachaponItem2(ran1[0], ran1[2], "自由金猪", 1);
			}
			//cm.gainItem(2000005, 1);
			cm.gainItem(ran1[0] ,ran1[2])
			//cm.worldMessage("『抽奖捷报』：恭喜玩家."+ cm.getChar().getName() +"  获得["+ Packages.server.MapleItemInformationProvider.getInstance().getName(ran1[0]) +"]让我们热烈的祝福他/她吧！");
			txt += "#v" + ran1[0] + "#\r\n";
			//var result = cm.setBossRankCount("随机奖池抽奖");
			/*
			var ran2 = null;
			if (result%10 == 0) {//十连抽保底
				ran2 = finalGift(itemList1);
				cm.gainItem(ran2[0] ,ran2[2])
				txt += "额外道具：#v" + ran2[0] + "#\r\n";
			}
			*/
		}
		cm.sendOk(txt);
		cm.dispose();
		return;
    }
}

function finalGift(lists) {
	var maxChance = 0;
	for (var i in lists) {
		if (lists[i][1] > maxChance) {
			maxChance = lists[i][1];
		}
	}
	var chance = Math.floor(Math.random() * maxChance);
	var finalitem = Array();
	for (var i = 0; i < lists.length; i++) {
		if (lists[i][1] >= chance) {
			finalitem.push(lists[i]);
		}
	}
	var ran1 = Math.floor(Math.random() * finalitem.length);
	return finalitem[ran1];
}