var status = -1;
var 正在进行 = "#fUI/UIWindow/Quest/Tab/disabled/1#";
var 可以开始 = "#fUI/UIWindow/Quest/Tab/enabled/0#";
var 任务简介 = "#fUI/UIWindow/Quest/summary#";
var 奖励 = "#fUI/UIWindow/Quest/reward#";
var 选择获得 = "#fUI/UIWindow/Quest/select#";
var 几率获得 = "#fUI/UIWindow/Quest/prob#";
var 无条件获得 = "#fUI/UIWindow/Quest/basic#";
var 三眼章鱼 = "#fUI/UIWindow/Minigame/Omok/stone/3/white/0#";
var 花蘑菇 = "#fUI/UIWindow/Minigame/Omok/stone/0/black/0#";
var 绿水灵 = "#fUI/UIWindow/Minigame/Omok/stone/1/white/0#";
var 猪猪 = "#fUI/UIWindow/Minigame/Omok/stone/2/black/0#";
var 熊熊 = "#fUI/UIWindow/Minigame/Omok/stone/6/black/0#";
var 红冠 = "#fUI/GuildMark.img/Mark/Etc/00009023/14#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1022223/4/0#";
var 音符1 = "#fEffect/CharacterEff/1112949/0/0#";
var 音符2 = "#fEffect/CharacterEff/1112949/1/0#";
var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 星星1 = "#fEffect/CharacterEff/1051294/0/0#";
var 星星2 = "#fEffect/CharacterEff/1051295/0/0#";
var 星星3 = "#fEffect/CharacterEff/1051296/0/0#";
var 音符 = "#fEffect/CharacterEff/1003276/0/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var 小雪花 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 爱心1 = "#fEffect/CharacterEff/1032063/0/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";

var 铅笔图标 = "#fUI/UIWindow.img/PvP/btWrite/mouseOver/0#";
var 警报灯 = "#fUI/StatusBar/BtClaim/normal/0#";
var H字母 = "#fUI/CashShop/CSEffect/effect/1#";
var 金币图标 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 游戏标题 = "#fString/ZEVMS.img/游戏标题/游戏标题#";

var 蓝条 = "#fUI/ChatBalloon.img/pet/18/head#";
var 蓝右头 = "#fUI/ChatBalloon.img/pet/18/ne#";
var 蓝左头 = "#fUI/ChatBalloon.img/pet/18/nw#";
var 蓝条条 = "#fUI/ChatBalloon.img/pet/25/n#";
var 进行中 = "#fUI/UIWindow.img/counsel/Loading/3#";
var 皇冠 = "#fUI/UIWindow.img/SkillMacro/Macroicon/4/iconMouseOver#";
var 邪恶小兔 = "#fEffect/CharacterEff/1112960/3/0#";  //邪恶小兔 【小】
/*
注意事项:
name 不能超过16个中文
*/
var costMap = [
    [
        //任务分类
        "金银岛",
        [
            {name: "明珠港郊外", msg: "明珠港多少人的回忆....", max_level: 30, min_level: 10, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石)
                meso: 300000, dy: 200, nx: 1000, exp: 10000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

            },
            //任务需要物品列表
            {id: 4000000, num: 500},
            {id: 4000016, num: 500},
            {id: 4000004, num: 500}
        ], [
        {name: "海岸草丛Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
            gy_items: [
                [4001165, 588],
                [4321010, 38]
            ],
            //选择奖励
            xz_items: [],
            //几率获得 物品ID 数量 概率
            jl_items: [
                [3994789, 1, 100],
                [4322899, 1, 60]
            ]

        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000016, num: 500},
        {id: 4000004, num: 500}
    ], [
        {name: "海岸草丛Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000019, num: 500},
        {id: 4000010, num: 500},
        {id: 4000004, num: 500}
    ], [
        {name: "海岸草丛Ⅲ", msg: "你现在已经接触到你现在第一个野外BOSS的地图了.", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 500, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000019, num: 500},
        {id: 4000004, num: 500},
        {id: 4000003, num: 500},
        {id: 2210006, num: 3}
    ], [
        {name: "三叉路", msg: "我想知道你的选择.", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10400,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000010, num: 500},
        {id: 4000001, num: 500}
    ], [
        {name: "废都森林I", msg: "噢..你选择了废弃都市.加油!", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000010, num: 500},
        {id: 4001343, num: 500}
    ], [
        {name: "废都森林II", msg: "都跟你立牌牌说了危险你还是选择了..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000010, num: 500},
        {id: 4000012, num: 500}
    ], [
        {name: "废都森林III", msg: "噢.死胡同..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000016, num: 500},
        {id: 4000002, num: 500}
    ], [
        {name: "逆恩森林Ⅲ", msg: "..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4001343, num: 500},
        {id: 4000002, num: 500},
        {id: 4000012, num: 500}
    ], [
        {name: "逆恩森林Ⅱ", msg: "..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000019, num: 500},
        {id: 4000009, num: 500}
    ], [
        {name: "逆恩森林Ⅰ", mapid: 103020000, msg: "..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000009, num: 500},
        {id: 4000002, num: 400}
    ], [
        {name: "废都南方工地", msg: "这个地方你应该熟悉..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 500},
        {id: 4000006, num: 500},
        {id: 4000001, num: 500}
    ], [
        {name: "坠落主义", msg: "这个是一个隐藏地图..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 500},
        {id: 4000006, num: 300}
    ], [
        {name: "沼泽地Ⅰ", msg: "你好像进入了下水道..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000032, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "沼泽地Ⅱ", msg: "你好像进入了下水道..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000032, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "沼泽地Ⅲ", msg: "你好像进入了下水道..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000032, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "鳄鱼潭Ⅰ", msg: "好多好多鳄鱼..", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 50000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000032, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "鳄鱼潭Ⅱ", msg: "好多好多鳄鱼..", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 200, nx: 1000, exp: 50000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000032, num: 500},
        {id: 4000034, num: 500},
        {id: 4000033, num: 500}
    ], [
        {name: "黑森林西入口", msg: "神秘的地方..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 100, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000006, num: 500},
        {id: 4000215, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "黑森林", msg: "选择选择..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000010, num: 500},
        {id: 4000015, num: 500},
        {id: 4000012, num: 500}
    ], [
        {name: "勇士部落迷宫入口", msg: "哦..", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000020, num: 500},
        {id: 4000215, num: 500},
        {id: 4001344, num: 500}
    ], [
        {name: "幽深峡谷Ⅲ", msg: "哦..", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000020, num: 500},
        {id: 4000215, num: 500},
        {id: 4001344, num: 500}
    ], [
        {name: "幽深的峡谷Ⅱ", msg: "哦..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20500,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000020, num: 500},
        {id: 4000018, num: 800},
        {id: 4001344, num: 500}
    ], [
        {name: "幽深的峡谷Ⅰ", msg: "哦..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20500,
            //固有装备奖励
 gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000020, num: 500},
        {id: 4000018, num: 800},
        {id: 4001344, num: 500}
    ], [
        {name: "火焰之地Ⅰ", msg: "嗯.来了..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 500},
        {id: 4000024, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "火焰之地Ⅱ", msg: "嗯.都说危险还来..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 500},
        {id: 4000024, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "火焰之地Ⅲ", msg: "嗯.都说危险还来..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 500},
        {id: 4000024, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "火焰之地Ⅳ", msg: "嗯.都说危险还来..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 500},
        {id: 4000024, num: 500},
        {id: 4000026, num: 500}
    ], [
        {name: "火焰之地Ⅴ", msg: "嗯.死胡同..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 500},
        {id: 4000024, num: 500},
        {id: 4000026, num: 500}
    ], [
        {name: "黑森林通道", msg: "嗯.迷宫..", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000015, num: 500},
        {id: 4000006, num: 500}
    ], [
        {name: "射手村迷宫入口", msg: "..", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000012, num: 500},
        {id: 4000010, num: 500},
        {id: 4000009, num: 500}
    ], [
        {name: "迷宫通道", msg: "..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000002, num: 500},
        {id: 4000039, num: 500}
    ], [
        {name: "黑森林打猎场I", msg: "..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000012, num: 500},
        {id: 4000013, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "黑森林打猎场II", msg: "..", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000026, num: 500},
        {id: 4000013, num: 500}
    ], [
        {name: "废都北入口", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000033, num: 1000},
        {id: 4000018, num: 500},
        {id: 4000006, num: 500}
    ], [
        {name: "废都北方工地", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000001, num: 800},
        {id: 4000006, num: 800},
        {id: 4000004, num: 800}
    ], [
        {name: "勇士部落西部", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 800},
        {id: 4000018, num: 500},
        {id: 4000005, num: 500}
    ], [
        {name: "西部岩山Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 800},
        {id: 4000018, num: 500},
        {id: 4000016, num: 500}
    ], [
        {name: "西部岩山Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
           gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 800},
        {id: 4000018, num: 500},
        {id: 4000005, num: 500}
    ], [
        {name: "西部岩山Ⅲ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 800},
        {id: 4000012, num: 500},
        {id: 4000005, num: 500}
    ], [
        {name: "西部岩山Ⅳ", msg: "死胡同....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000026, num: 500},
        {id: 4000024, num: 500}
    ], [
        {name: "勇士村西入口", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000003, num: 500},
        {id: 4000018, num: 500}
    ], [
        {name: "勇士部落东入口", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000019, num: 500},
        {id: 4000016, num: 500},
        {id: 4000003, num: 500}
    ], [
        {name: "东部岩山Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 50000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4001344, num: 500},
        {id: 4000016, num: 500},
        {id: 4000003, num: 500}
    ], [
        {name: "东部岩山Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 5000, dy: 20, nx: 100, exp: 1200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4001344, num: 500},
        {id: 4000005, num: 500},
        {id: 4000003, num: 800}
    ], [
        {name: "东部岩山Ⅲ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000018, num: 500},
        {id: 4000005, num: 500},
        {id: 4000003, num: 800}
    ], [
        {name: "东部岩山Ⅳ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 600},
        {id: 4000018, num: 600}
    ], [
        {name: "东部岩山Ⅴ", msg: "你好像遇到了BOSS....", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 5000, nx: 2000, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 600},
        {id: 4000018, num: 600},
        {id: 4000195, num: 500}
    ], [
        {name: "东部岩山Ⅵ", msg: "....", max_level: 45, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 30000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000215, num: 600},
        {id: 4000018, num: 600},
        {id: 4000024, num: 500}
    ], [
        {name: "东部岩山Ⅶ", msg: "死胡同....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 20000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000014, num: 500},
        {id: 4000018, num: 600},
        {id: 4000024, num: 500}
    ], [
        {name: "岩石路Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 500},
        {id: 4000012, num: 500},
        {id: 4000019, num: 500}
    ], [
        {name: "岩石路Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 500},
        {id: 4000012, num: 500},
        {id: 4000215, num: 500}
    ], [
        {name: "岩石路Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000012, num: 500},
        {id: 4000215, num: 500}
    ], [
        {name: "岩石路Ⅲ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000018, num: 500},
        {id: 4000215, num: 500}
    ], [
        {name: "遗迹发掘地Ⅰ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000195, num: 600},
        {id: 4000196, num: 600}
    ], [
        {name: "遗迹发掘地Ⅱ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000195, num: 600},
        {id: 4000196, num: 600},
        {id: 4000197, num: 500}
    ], [
        {name: "遗迹发掘地Ⅲ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000196, num: 600},
        {id: 4000197, num: 600}
    ], [
        {name: "遗迹之墓Ⅰ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 80000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000204, num: 500},
        {id: 4000205, num: 500}
    ], [
        {name: "遗迹之墓Ⅱ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1200000, dy: 200, nx: 1000, exp: 102000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]


        },
        //任务需要物品列表
        {id: 4000204, num: 500},
        {id: 4000205, num: 500},
        {id: 4000206, num: 200}
    ], [
        {name: "遗迹之墓Ⅲ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]


        },
        //任务需要物品列表
        {id: 4000204, num: 500},
        {id: 4000205, num: 500},
        {id: 4000206, num: 300}
    ], [
        {name: "遗迹之墓Ⅳ", msg: "....", max_level: 80, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 2500000, dy: 200, nx: 1000, exp: 800000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]


        },
        //任务需要物品列表
        {id: 4000207, num: 500},
        {id: 4000208, num: 500}
    ], [
        {name: "遗迹之峭壁", msg: "死胡同....", max_level: 80, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 3000000, dy: 500, nx: 2000, exp: 100000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]


        },
        //任务需要物品列表
        {id: 4000207, num: 500},
        {id: 4000208, num: 500}
    ], [
        {name: "勇士部落东部", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10600,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000018, num: 500},
        {id: 4000019, num: 500},
        {id: 4001344, num: 500}
    ], [
        {name: "魔法密林北部", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000010, num: 500},
        {id: 4000003, num: 500},
        {id: 4000019, num: 500}
    ], [
        {name: "大木林Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000010, num: 500},
        {id: 4000004, num: 500},
        {id: 4000016, num: 500}
    ], [
        {name: "大木林Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000010, num: 500},
        {id: 4000004, num: 500},
        {id: 4000019, num: 500}
    ], [
        {name: "大木林Ⅲ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000005, num: 500},
        {id: 4000012, num: 500},
        {id: 4001344, num: 500}
    ], [
        {name: "魔法密林北郊", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000010, num: 500},
        {id: 4000016, num: 500}
    ], [
        {name: "魔法密林南郊", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 100, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000010, num: 500},
        {id: 4000003, num: 500}
    ], [
        {name: "隆隆森林", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000010, num: 500},
        {id: 4000012, num: 500}
    ], [
        {name: "魔法森林南部", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000004, num: 500},
        {id: 4000010, num: 500},
        {id: 4000019, num: 500}
    ], [
        {name: "射手村东部树林", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10300,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000001, num: 500},
        {id: 4000017, num: 500},
        {id: 4000019, num: 500}
    ], [
        {name: "射手村东部草丛", msg: "杀猪....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000001, num: 500},
        {id: 4000017, num: 500}
    ], [
        {name: "射手村东部小山", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000011, num: 500},
        {id: 4000016, num: 500}
    ], [
        {name: "射手训练场Ⅰ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000004, num: 500},
        {id: 4000003, num: 500}
    ], [
        {name: "射手训练场Ⅱ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000000, num: 500},
        {id: 4000010, num: 500},
        {id: 4000001, num: 500}
    ], [
        {name: "射手训练场Ⅲ", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000016, num: 500},
        {id: 4000010, num: 500},
        {id: 4000001, num: 500}
    ], [
        {name: "射手村西部小山", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000003, num: 500},
        {id: 4001343, num: 500},
        {id: 4000002, num: 500}
    ], [
        {name: "射手村西部树林", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 300000, dy: 200, nx: 1000, exp: 10200,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000019, num: 500},
        {id: 4000000, num: 500},
        {id: 4000016, num: 500}
    ], [
        {name: "森林迷宫I", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 10800,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000012, num: 500},
        {id: 4000004, num: 500}
    ], [
        {name: "森林迷宫II", msg: "....", max_level: 30, min_level: 10, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 20500,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000012, num: 500},
        {id: 4000010, num: 500}
    ], [
        {name: "森林迷宫III", msg: "....", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 102000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000025, num: 500},
        {id: 4000013, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "森林迷IV", msg: "....", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000025, num: 500},
        {id: 4000022, num: 500}
    ], [
        {name: "森林迷宫V", msg: "死胡同....", max_level: 60, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 2000000, dy: 200, nx: 1000, exp: 300000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000029, num: 500},
        {id: 4000013, num: 500},
        {id: 4000034, num: 500}
    ], [
        {name: "蚂蚁洞Ⅰ", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 50000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 800},
        {id: 4000008, num: 500}
    ], [
        {name: "蚂蚁洞Ⅱ", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 600000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 800},
        {id: 4000008, num: 500}
    ], [
        {name: "蚂蚁洞Ⅲ", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 700000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 800},
        {id: 4000008, num: 800}
    ], [
        {name: "蚂蚁洞Ⅳ", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 800},
        {id: 4000008, num: 1200}
    ], [
        {name: "黑暗通道", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
             gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]


        },
        //任务需要物品列表
        {id: 4000015, num: 600},
        {id: 4000008, num: 600},
        {id: 4000042, num: 500}
    ], [
        {name: "蝙蝠洞", msg: "....", max_level: 40, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000008, num: 500},
        {id: 4000042, num: 500}
    ], [
        {name: "幽深蚂蚁洞Ⅰ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000008, num: 500},
        {id: 4000007, num: 500}
    ], [
        {name: "幽深蚂蚁洞Ⅱ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000008, num: 500},
        {id: 4000007, num: 600}
    ], [
        {name: "蚂蚁广场", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000015, num: 500},
        {id: 4000008, num: 500},
        {id: 4000007, num: 500}
    ], [
        {name: "火独眼兽洞穴Ⅰ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 60000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000007, num: 500},
        {id: 4000023, num: 500}
    ], [
        {name: "火独眼兽洞穴Ⅱ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 80000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000007, num: 600},
        {id: 4000023, num: 600}
    ], [
        {name: "火独眼兽洞穴Ⅲ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 80000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000007, num: 700},
        {id: 4000023, num: 700}
    ], [
        {name: "火独眼兽洞穴Ⅳ", msg: "....", max_level: 40, min_level: 15, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 80000, dy: 200, nx: 1000, exp: 80000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000007, num: 700},
        {id: 4000023, num: 700}
    ], [
        {name: "龙族打猎场", msg: "....", max_level: 60, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000014, num: 500},
        {id: 4000015, num: 500},
        {id: 4000030, num: 200}
    ], [
        {name: "冰独眼兽洞穴Ⅰ", msg: "....", max_level: 60, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000014, num: 500},
        {id: 4000023, num: 500},
        {id: 4000030, num: 200}
    ], [
        {name: "冰独眼兽洞穴Ⅱ", msg: "....", max_level: 70, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 200, nx: 1000, exp: 400000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000014, num: 400},
        {id: 4000023, num: 500},
        {id: 4000027, num: 200}
    ], [
        {name: "寺院入口", msg: "....", max_level: 50, min_level: 20, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 500000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 1000}
    ], [
        {name: "寺院通道Ⅰ", msg: "....", max_level: 80, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 800000, dy: 200, nx: 1000, exp: 200000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 1000}
    ], [
        {name: "寺院通道Ⅱ", msg: "....", max_level: 80, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 300, nx: 1000, exp: 300000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 1000}
    ], [
        {name: "寺院通道Ⅲ", msg: "....", max_level: 90, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 500, nx: 1000, exp: 600000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 1000},
        {id: 4000028, num: 200},
        {id: 4000046, num: 200}
    ], [
        {name: "寺院通道Ⅳ", msg: "....", max_level: 90, min_level: 40, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 500, nx: 1000, exp: 800000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 1000},
        {id: 4000028, num: 200},
        {id: 4000046, num: 200}
    ], [
        {name: "龙穴", msg: "....", max_level: 80, min_level: 25, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 500, nx: 888, exp: 600000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 800},
        {id: 4000027, num: 100},
        {id: 4000014, num: 300}
    ], [
        {name: "龙族之地", msg: "....", max_level: 80, min_level: 25, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 500, nx: 888, exp: 800000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 60},
        {id: 4000185, num: 30},
        {id: 4000014, num: 30}
    ], [
        {name: "冰冷的摇篮", msg: "....", max_level: 80, min_level: 25, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1500000, dy: 500, nx: 888, exp: 800000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000185, num: 500},
        {id: 4000014, num: 500}
    ], [
        {name: "龙族之巢", msg: "....", max_level: 90, min_level: 60, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 2500000, dy: 500, nx: 888, exp: 1200000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000185, num: 500},
        {id: 4000030, num: 500}
    ], [
        {name: "怪猫的领土", msg: "....", max_level: 80, min_level: 35, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 500, nx: 888, exp: 500000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],//皇家
                    [3994789, 1, 30]//吸血
                ]

        },
        //任务需要物品列表
        {id: 4000023, num: 600},
        {id: 4000027, num: 300}
    ], [
        {name: "海边瓜棚", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 500, nx: 500, exp: 300000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000043, num: 500},
        {id: 4000026, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "红螃蟹海滩Ⅰ", msg: "....", max_level: 50, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 1000000, dy: 500, nx: 500, exp: 300000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000043, num: 800},
        {id: 4000026, num: 500},
        {id: 4000029, num: 500}
    ], [
        {name: "青螃蟹海滩Ⅰ", msg: "....", max_level: 60, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 2000000, dy: 500, nx: 500, exp: 800000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000043, num: 600},
        {id: 4000044, num: 600}
    ], [
        {name: "阳光沙滩", msg: "这里有BOSS快跑....", max_level: 70, min_level: 30, onlyMap: true},
        //任务奖励
        {
            //奖励 金币 点卷 抵用卷 元宝(钻石)
            meso: 3000000, dy: 500, nx: 500, exp: 1000000,
            //固有装备奖励
            gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],//皇家
                    [4322899, 1, 60]//暗影币
                ]

        },
        //任务需要物品列表
        {id: 4000043, num: 600},
        {id: 4000044, num: 600},
        {id: 4000045, num: 600}
    ]
    ], [
        //任务分类
        "冰封雪域",
        [
            {name: "冰雪山丘", msg: "......", max_level: 50, min_level: 27, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 200, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 50]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000086, num: 800},
            {id: 4000088, num: 800}
        ], [
            {name: "冰面Ⅰ", msg: "......", max_level: 70, min_level: 45, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 100, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 50]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000048, num: 600},
            {id: 4000051, num: 200}
        ], [
            {name: "冰面Ⅱ", msg: "......", max_level: 70, min_level: 45, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 200, nx: 300,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 50]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000048, num: 500},
            {id: 4000051, num: 500},
            {id: 4003005, num: 500}
        ], [
            {name: "结冰的平原Ⅰ", msg: "......", max_level: 73, min_level: 50, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 80]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000051, num: 500},
            {id: 4000052, num: 500}
        ], [
            {name: "雪人谷", msg: "......", max_level: 73, min_level: 50, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 80]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000051, num: 500},
            {id: 4000052, num: 500},
            {id: 4003004, num: 300}
        ], [
            {name: "寒冰平原", msg: "......", max_level: 73, min_level: 50, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4001126, 80]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000051, num: 500},
            {id: 4000052, num: 500},
            {id: 4003005, num: 200}
        ], [
            {name: "冰雪峡谷Ⅰ", msg: "......", max_level: 80, min_level: 45, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]
            },
            //任务需要物品列表
            {id: 4000049, num: 500},
            {id: 4000048, num: 500}
        ], [
            {name: "冰雪峡谷Ⅱ", msg: "......", max_level: 93, min_level: 60, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000049, num: 500},
            {id: 4003005, num: 200}
        ], [
            {name: "尖锐的绝壁Ⅰ", msg: "......", max_level: 83, min_level: 45, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000055, num: 500},
            {id: 4000048, num: 500},
            {id: 4000056, num: 500}
        ], [
            {name: "尖锐的绝壁Ⅱ", msg: "......", max_level: 83, min_level: 51, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000055, num: 500},
            {id: 4000056, num: 500},
            {id: 4000057, num: 500}
        ], [
            {name: "狼的领土Ⅰ", msg: "......", max_level: 90, min_level: 50, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000053, num: 350},
            {id: 4000051, num: 500},
            {id: 4000052, num: 500}
        ], [
            {name: "狼的领土Ⅱ", msg: "......", max_level: 90, min_level: 50, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000053, num: 100},
            {id: 4000051, num: 500},
            {id: 4000052, num: 500}
        ], [
            {name: "危险的绝壁", msg: "......", max_level: 97, min_level: 51, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 500,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000056, num: 300},
            {id: 4000055, num: 300}
        ], [
            {name: "狼的领土Ⅲ", msg: "......", max_level: 95, min_level: 53, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 100},
            {id: 4000052, num: 600}
        ], [
            {name: "狼的领土Ⅳ", msg: "......", max_level: 95, min_level: 53, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 100},
            {id: 4000052, num: 600}
        ], [
            {name: "狼的领土Ⅴ", msg: "......", max_level: 95, min_level: 53, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 50, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 100},
            {id: 4000052, num: 600}
        ], [
            {name: "死亡之林Ⅰ", msg: "......", max_level: 72, min_level: 52, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]
            },
            //任务需要物品列表
            {id: 4000054, num: 100},
            {id: 4000052, num: 500}
        ], [
            {name: "死亡之林Ⅱ", msg: "......", max_level: 72, min_level: 52, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500}
        ], [
            {name: "死亡之林Ⅲ", msg: "......", max_level: 72, min_level: 52, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500}
        ], [
            {name: "死亡之林Ⅳ", msg: "......", max_level: 72, min_level: 52, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500}
        ], [
            {name: "废矿区Ⅰ", msg: "......", max_level: 72, min_level: 36, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500},
            {id: 4000076, num: 300}
        ], [
            {name: "废矿区Ⅱ", msg: "......", max_level: 72, min_level: 36, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500},
            {id: 4000076, num: 300}
        ], [
            {name: "废矿区Ⅲ", msg: "......", max_level: 72, min_level: 36, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500},
            {id: 4000076, num: 300}
        ], [
            {name: "废矿区Ⅳ", msg: "......", max_level: 72, min_level: 36, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 2380,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000054, num: 350},
            {id: 4000052, num: 500},
            {id: 4000076, num: 300}
        ], [
            {name: "通道", msg: "......", max_level: 56, min_level: 36, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000076, num: 1000}
        ], [
            {name: "艰苦洞穴Ⅰ", msg: "......", max_level: 87, min_level: 38, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000081, num: 300},
            {id: 4000079, num: 300},
            {id: 4000078, num: 300}
        ], [
            {name: "艰苦洞穴Ⅱ", msg: "......", max_level: 87, min_level: 38, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000079, num: 500},
            {id: 4000078, num: 500}
        ], [
            {name: "艰苦洞穴Ⅲ", msg: "......", max_level: 105, min_level: 38, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 3000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000080, num: 300},
            {id: 4000079, num: 300},
            {id: 4000081, num: 300}
        ], [
            {name: "云彩公园Ⅰ", msg: "......", max_level: 50, min_level: 30, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000059, num: 1000}
        ], [
            {name: "云彩公园Ⅱ", msg: "......", max_level: 60, min_level: 30, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000059, num: 800},
            {id: 4000060, num: 300}
        ], [
            {name: "云彩公园Ⅲ", msg: "......", max_level: 60, min_level: 25, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000059, num: 600},
            {id: 4000060, num: 600}
        ], [
            {name: "云彩公园Ⅳ", msg: "......", max_level: 60, min_level: 25, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000059, num: 600},
            {id: 4000060, num: 600}
        ], [
            {name: "云彩公园Ⅴ", msg: "......", max_level: 67, min_level: 25, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 30, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000061, num: 600},
            {id: 4000060, num: 600}
        ], [
            {name: "云彩公园Ⅵ", msg: "......", max_level: 67, min_level: 40, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000061, num: 800},
            {id: 4000060, num: 600}
        ], [
            {name: "三色庭院的通道", msg: "......", max_level: 48, min_level: 28, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 20, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000073, num: 1000}
        ], [
            {name: "红色庭院Ⅰ", msg: "......", max_level: 48, min_level: 28, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 20, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000073, num: 1000}
        ], [
            {name: "红色庭院Ⅱ", msg: "......", max_level: 68, min_level: 48, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000070, num: 1000}
        ], [
            {name: "黄色庭院Ⅰ", msg: "......", max_level: 48, min_level: 28, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 20, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000073, num: 1000}
        ], [
            {name: "黄色庭院Ⅱ", msg: "......", max_level: 68, min_level: 48, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000071, num: 1000}
        ], [
            {name: "蓝色庭院Ⅰ", msg: "......", max_level: 48, min_level: 28, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 20, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000073, num: 1000}
        ], [
            {name: "蓝色庭院Ⅱ", msg: "......", max_level: 68, min_level: 48, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000072, num: 1000}
        ], [
            {name: "天空楼梯Ⅰ", msg: "......", max_level: 68, min_level: 48, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 40, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000072, num: 300},
            {id: 4000070, num: 300},
            {id: 4000071, num: 300}
        ], [
            {name: "天空楼梯Ⅱ", msg: "......", max_level: 88, min_level: 68, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 60, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000074, num: 500}
        ], [
            {name: "黑暗庭院Ⅰ", msg: "......", max_level: 88, min_level: 68, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 60, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000074, num: 500}
        ], [
            {name: "黑暗庭院Ⅱ", msg: "......", max_level: 88, min_level: 68, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                dy: 60, nx: 1000,
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000074, num: 500}
        ]
    ], [
        "时间停止之湖",
        [
            {name: "控制地区", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000120, num: 1000}
        ], [
            {name: "库尔兰草原", msg: "......", max_level: 55, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000117, num: 1000}
        ], [
            {name: "鲁斯韦尔草原", msg: "......", max_level: 61, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000122, num: 500},
            {id: 4000121, num: 500}
        ], [
            {name: "露台大厅", msg: "......", max_level: 47, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 1200},
            {id: 4000107, num: 500}
        ], [
            {name: "白云露台<1>", msg: "......", max_level: 47, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 600},
            {id: 4000107, num: 600}
        ], [
            {name: "白云露台<2>", msg: "......", max_level: 49, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]
            },
            //任务需要物品列表
            {id: 4000109, num: 200},
            {id: 4000107, num: 800}
        ], [
            {name: "白云露台<3>", msg: "......", max_level: 54, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 500},
            {id: 4000107, num: 800},
            {id: 4000110, num: 300}
        ], [
            {name: "白云露台<4>", msg: "......", max_level: 54, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 500},
            {id: 4000107, num: 500},
            {id: 4000110, num: 500}
        ], [
            {name: "白云露台<5>", msg: "......", max_level: 54, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 500},
            {id: 4000003, num: 500},
            {id: 4000110, num: 500}
        ], [
            {name: "天空露台<1>", msg: "......", max_level: 47, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 600},
            {id: 4000107, num: 600}
        ], [
            {name: "天空露台<2>", msg: "......", max_level: 54, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000106, num: 500},
            {id: 4000107, num: 500},
            {id: 4000110, num: 300}
        ], [
            {name: "天空露台<3>", msg: "......", max_level: 54, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000109, num: 300},
            {id: 4000107, num: 600},
            {id: 4000110, num: 300}
        ], [
            {name: "天空露台<4>", msg: "......", max_level: 49, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000109, num: 300},
            {id: 4000107, num: 600}
        ], [
            {name: "天空露台<5>", msg: "......", max_level: 51, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000109, num: 600},
            {id: 4000108, num: 600}
        ], [
            {name: "玩具工厂<骨干工程1>", msg: "......", max_level: 51, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 600}
        ], [
            {name: "玩具工厂<第1工程>第3地区", msg: "......", max_level: 51, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 600}
        ], [
            {name: "玩具工厂<第1工程>第2地区", msg: "......", max_level: 59, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 600},
            {id: 4000111, num: 500},
            {id: 4000112, num: 500}
        ], [
            {name: "玩具工厂<第1工程>第1地区", msg: "......", max_level: 59, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000112, num: 800}
        ], [
            {name: "玩具工厂<第1工程>第5地区", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 800},
            {id: 4000111, num: 300}
        ], [
            {name: "玩具工厂<第1工程>第6地区", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 500},
            {id: 4000111, num: 800}
        ], [
            {name: "玩具工厂<机房>", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000111, num: 800}
        ], [
            {name: "玩具工厂<骨干工程2>", msg: "......", max_level: 51, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000111, num: 800}
        ], [
            {name: "玩具工厂<第2工程>第2地区", msg: "......", max_level: 59, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000111, num: 600},
            {id: 4000112, num: 600}
        ], [
            {name: "玩具工厂<第2工程>第1地区", msg: "......", max_level: 59, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000112, num: 800}
        ], [
            {name: "玩具工厂<第2工程>第4地区", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 800},
            {id: 4000111, num: 300}
        ], [
            {name: "玩具工厂<第2工程>第5地区", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000108, num: 600},
            {id: 4000111, num: 600}
        ], [
            {name: "时间隧道", msg: "......", max_level: 55, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000113, num: 600},
            {id: 4000114, num: 600}
        ], [
            {name: "时间之路<2>", msg: "......", max_level: 52, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1000}
        ], [
            {name: "时间之路<1>", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1200}
        ], [
            {name: "时间之路<3>", msg: "......", max_level: 52, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1000}
        ], [
            {name: "时间之路<4>", msg: "......", max_level: 61, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1200}
        ], [
            {name: "时间漩涡", msg: "......", max_level: 55, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000114, num: 1000}
        ], [
            {name: "丢失的时间<1>", msg: "......", max_level: 56, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1000}
        ], [
            {name: "丢失的时间<2>", msg: "......", max_level: 61, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000115, num: 1200}
        ], [
            {name: "扭曲的时间<1>", msg: "......", max_level: 81, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000128, num: 600},
            {id: 4000129, num: 600}
        ], [
            {name: "扭曲的时间<2>", msg: "......", max_level: 92, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000130, num: 500},
            {id: 4000131, num: 300}
        ], [
            {name: "扭曲的时间<3>", msg: "......", max_level: 98, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000132, num: 800}
        ], [
            {name: "扭曲的时间<4>", msg: "......", max_level: 108, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000134, num: 800}
        ], [
            {name: "怪异的回廊", msg: "......", max_level: 123, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000151, num: 100}
        ], [
            {name: "时间消失之路<1>", msg: "......", max_level: 82, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000143, num: 600},
            {id: 4000144, num: 600}
        ], [
            {name: "时间消失之路<2>", msg: "......", max_level: 91, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000146, num: 600},
            {id: 4000145, num: 600}
        ], [
            {name: "时间消失之路<3>", msg: "......", max_level: 100, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000147, num: 800}
        ], [
            {name: "时间消失之路<4>", msg: "......", max_level: 110, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000149, num: 800}
        ], [
            {name: "消失的回廊", msg: "......", max_level: 123, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 50],
                    [3994789, 1, 30]
                ]

            },
            //任务需要物品列表
            {id: 4000152, num: 100}
        ], [
            {name: "乌山入口", msg: "......", max_level: 60, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000169, num: 600},
            {id: 4000018, num: 300},
            {id: 4000215, num: 300}
        ], [
            {name: "乌山深处", msg: "......", max_level: 60, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000169, num: 600},
            {id: 4000018, num: 400},
            {id: 4000215, num: 400}
        ], [
            {name: "小山泉", msg: "......", max_level: 65, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000169, num: 600},
            {id: 4000018, num: 300},
            {id: 4000170, num: 200}
        ], [
            {name: "小池塘", msg: "......", max_level: 68, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000215, num: 300},
            {id: 4000018, num: 300},
            {id: 4000170, num: 600}
        ], [
            {name: "老虎树林Ⅰ", msg: "......", max_level: 68, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000171, num: 200},
            {id: 4000170, num: 600}
        ], [
            {name: "老虎树林Ⅱ", msg: "......", max_level: 68, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000171, num: 300},
            {id: 4000170, num: 600}
        ], [
            {name: "老虎山坡", msg: "......", max_level: 68, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000171, num: 300},
            {id: 4000170, num: 600}
        ], [
            {name: "乌山峡谷", msg: "......", max_level: 71, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000171, num: 500},
            {id: 4000172, num: 500}
        ], [
            {name: "狐狸山坡", msg: "......", max_level: 71, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000172, num: 800}
        ], [
            {name: "鬼怪山脊", msg: "......", max_level: 75, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000173, num: 1000}
        ]
    ], [
        "水下世界",
        [
            {name: "海底叉路", msg: "......", max_level: 55, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000154, num: 500},
            {id: 4000153, num: 500},
            {id: 4000158, num: 800}
        ], [
            {name: "水晶峡谷", msg: "......", max_level: 55, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000154, num: 600},
            {id: 4000159, num: 600}
        ], [
            {name: "红珊瑚树林", msg: "......", max_level: 57, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000159, num: 600},
            {id: 4000155, num: 600},
            {id: 4000157, num: 150}
        ], [
            {name: "海螺山丘", msg: "......", max_level: 58, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000159, num: 600},
            {id: 4000156, num: 600},
            {id: 4000157, num: 100}
        ], [
            {name: "西海叉路", msg: "......", max_level: 58, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000155, num: 60},
            {id: 4000156, num: 60},
            {id: 4000157, num: 20}
        ], [
            {name: "深海峡谷1", msg: "......", max_level: 107, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000182, num: 1200},
            {id: 4000179, num: 600}
        ], [
            {name: "深海峡谷2", msg: "......", max_level: 107, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000182, num: 800},
            {id: 4000179, num: 800}
        ], [
            {name: "受难船的墓地", msg: "......", max_level: 117, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000181, num: 800},
            {id: 4000179, num: 800},
            {id: 4000180, num: 800}
        ], [
            {name: "危海峡谷2", msg: "......", max_level: 112, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000181, num: 1500},
            {id: 4000180, num: 500}
        ], [
            {name: "危海峡谷1", msg: "......", max_level: 112, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000181, num: 500},
            {id: 4000180, num: 500},
            {id: 4000180, num: 500}
        ], [
            {name: "东海叉路", msg: "......", max_level: 47, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000167, num: 600}
        ], [
            {name: "海草之塔", msg: "......", max_level: 47, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000167, num: 500},
            {id: 4000166, num: 500}
        ], [
            {name: "沙城", msg: "......", max_level: 44, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000165, num: 500},
            {id: 4000164, num: 500}
        ], [
            {name: "大鱼峡谷", msg: "......", max_level: 44, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000165, num: 500},
            {id: 4000164, num: 500}
        ], [
            {name: "蓝海草路", msg: "......", max_level: 40, min_level: 1000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000162, num: 500},
            {id: 4000163, num: 500}
        ], [
            {name: "蘑菇珊瑚山丘", msg: "......", max_level: 39, min_level: 1700, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000162, num: 500},
            {id: 4000161, num: 500},
            {id: 4000160, num: 300}
        ], [
            {name: "矩形地带", msg: "......", max_level: 38, min_level: 1700, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000161, num: 500},
            {id: 4000160, num: 500}
        ]
    ], [
        "武陵桃园",
        [
            {name: "通天林入口", msg: "......", max_level: 56, min_level: 1135, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000276, num: 600},
            {id: 4000277, num: 600}
        ], [
            {name: "通天林小道", msg: "......", max_level: 58, min_level: 1135, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000276, num: 600},
            {id: 4000277, num: 600},
            {id: 4000278, num: 300}
        ], [
            {name: "通天林深处", msg: "......", max_level: 58, min_level: 1136, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000278, num: 600},
            {id: 4000277, num: 600}
        ], [
            {name: "花蛇的地盘", msg: "......", max_level: 60, min_level: 1381, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000280, num: 600},
            {id: 4000281, num: 800},
            {id: 4000279, num: 300}
        ], [
            {name: "野生熊的地盘2", msg: "......", max_level: 75, min_level: 1511, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000283, num: 100},
            {id: 4000284, num: 60},
            {id: 4000285, num: 30}
        ], [
            {name: "野生熊的地盘3", msg: "......", max_level: 75, min_level: 1511, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000283, num: 1000},
            {id: 4000284, num: 300},
            {id: 4000285, num: 600}
        ], [
            {name: "流浪熊的地盘", msg: "......", max_level: 75, min_level: 1551, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000283, num: 1000},
            {id: 4000285, num: 1000}
        ], [
            {name: "通天林的尽处", msg: "......", max_level: 60, min_level: 1410, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000281, num: 1000},
            {id: 4000279, num: 500},
            {id: 4000280, num: 500}
        ], [
            {name: "蟠桃果林1", msg: "......", max_level: 77, min_level: 1513, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000282, num: 1200},
            {id: 4000288, num: 300}
        ], [
            {name: "蟠桃果林2", msg: "......", max_level: 77, min_level: 1531, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000282, num: 600},
            {id: 4000288, num: 600}
        ], [
            {name: "蟠桃果林3", msg: "......", max_level: 77, min_level: 1513, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000282, num: 600},
            {id: 4000288, num: 600}
        ], [
            {name: "迷雾森林", msg: "......", max_level: 70, min_level: 1501, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000299, num: 900},
            {id: 4000298, num: 600}
        ], [
            {name: "仙人森林", msg: "......", max_level: 81, min_level: 1510, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000299, num: 900},
            {id: 4000298, num: 600},
            {id: 4000289, num: 300}
        ], [
            {name: "妖怪森林", msg: "......", max_level: 81, min_level: 1510, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000299, num: 500},
            {id: 4000298, num: 500},
            {id: 4000289, num: 500}
        ], [
            {name: "孤立的湿地", msg: "......", max_level: 79, min_level: 1591, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000295, num: 1000}
        ], [
            {name: "久老的湿地", msg: "......", max_level: 83, min_level: 1591, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000295, num: 1000},
            {id: 4000295, num: 200}
        ], [
            {name: "桔梗谷", msg: "......", max_level: 69, min_level: 1418, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000294, num: 800},
            {id: 4000293, num: 200}
        ], [
            {name: "百年药草地", msg: "......", max_level: 69, min_level: 1481, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000294, num: 600},
            {id: 4000293, num: 600}
        ], [
            {name: "五十年药草地", msg: "......", max_level: 63, min_level: 1421, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000292, num: 600},
            {id: 4000291, num: 300}
        ], [
            {name: "十年药草地", msg: "......", max_level: 62, min_level: 1412, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000291, num: 800}
        ], [
            {name: "初级修炼场", msg: "......", max_level: 65, min_level: 1415, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000286, num: 600}
        ], [
            {name: "下级修炼场", msg: "......", max_level: 66, min_level: 1451, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000286, num: 800},
            {id: 4000287, num: 300}
        ], [
            {name: "中级修炼场", msg: "......", max_level: 66, min_level: 1451, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000286, num: 350},
            {id: 4000287, num: 800}
        ], [
            {name: "上级修炼场", msg: "......", max_level: 66, min_level: 1461, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000287, num: 1000}
        ]
    ], [
        "尼哈沙漠",
        [
            {name: "阿里安特东门外", msg: "......", max_level: 36, min_level: 1511, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000324, num: 500},
            {id: 4000325, num: 300}
        ], [
            {name: "流浪团之地", msg: "......", max_level: 36, min_level: 1511, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000324, num: 300},
            {id: 4000325, num: 500}
        ], [
            {name: "干枯的沙漠", msg: "......", max_level: 42, min_level: 1911, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000326, num: 600},
            {id: 4000327, num: 200}
        ], [
            {name: "炽热的沙漠", msg: "......", max_level: 39, min_level: 1900, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000326, num: 800}
        ], [
            {name: "白砂沙漠", msg: "......", max_level: 39, min_level: 1800, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000326, num: 400},
            {id: 4000328, num: 800}
        ], [
            {name: "仙人掌沙漠2", msg: "......", max_level: 43, min_level: 2000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000330, num: 600},
            {id: 4000331, num: 600}
        ], [
            {name: "仙人掌沙漠1", msg: "......", max_level: 40, min_level: 2000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000330, num: 800}
        ], [
            {name: "阿里安特西门外", msg: "......", max_level: 40, min_level: 1711, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000330, num: 200},
            {id: 4000329, num: 600}
        ], [
            {name: "阿里安特北门外", msg: "......", max_level: 44, min_level: 1888, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000333, num: 800}
        ], [
            {name: "北沙漠之路１", msg: "......", max_level: 44, min_level: 1214, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000333, num: 800}
        ], [
            {name: "北沙漠之路２", msg: "......", max_level: 47, min_level: 1215, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000335, num: 800},
            {id: 4000334, num: 200}
        ], [
            {name: "红沙沙漠", msg: "......", max_level: 47, min_level: 1215, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000335, num: 600},
            {id: 4000334, num: 300}
        ], [
            {name: "沙漠自由牧民的废墟", msg: "......", max_level: 47, min_level: 1215, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000335, num: 500},
            {id: 4000334, num: 500}
        ], [
            {name: "沙哈地带3", msg: "......", max_level: 39, min_level: 1119, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000350, num: 1000}
        ], [
            {name: "沙哈地带4", msg: "沙哈地带4 实际在大地图上就是 沙哈地带2......", max_level: 44, min_level: 1911, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000350, num: 500},
            {id: 4000351, num: 500}
        ], [
            {name: "沙哈地带1", msg: "......", max_level: 44, min_level: 1824, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000351, num: 800}
        ], [
            {name: "沉睡的沙漠", msg: "......", max_level: 47, min_level: 1911, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000350, num: 500},
            {id: 4000352, num: 500}
        ], [
            {name: "梦游沙漠", msg: "......", max_level: 47, min_level: 2114, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000351, num: 500},
            {id: 4000352, num: 500}
        ], [
            {name: "研究所B-1 地区", msg: "......", max_level: 62, min_level: 1142, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000359, num: 1000}
        ], [
            {name: "研究所A-1 地区", msg: "......", max_level: 65, min_level: 1142, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000359, num: 300},
            {id: 4000360, num: 800}
        ], [
            {name: "研究所C-1 地区", msg: "......", max_level: 69, min_level: 1149, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000364, num: 1200}
        ], [
            {name: "研究所C-2 地区", msg: "......", max_level: 73, min_level: 1849, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000364, num: 1000},
            {id: 4000364, num: 1000}
        ], [
            {name: "研究所C-3 地区", msg: "......", max_level: 73, min_level: 1513, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000364, num: 1200}
        ], [
            {name: "研究所B-3 地区", msg: "......", max_level: 57, min_level: 1737, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000357, num: 1200}
        ], [
            {name: "研究所A-3 地区", msg: "......", max_level: 60, min_level: 1737, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000357, num: 300},
            {id: 4000358, num: 800}
        ], [
            {name: "研究所101号", msg: "......", max_level: 50, min_level: 1727, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000353, num: 800},
            {id: 4000356, num: 300}
        ], [
            {name: "研究所102号", msg: "......", max_level: 53, min_level: 1727, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000353, num: 300},
            {id: 4000356, num: 800}
        ], [
            {name: "研究所103号", msg: "......", max_level: 53, min_level: 1730, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000356, num: 1200}
        ], [
            {name: "研究所201号", msg: "......", max_level: 83, min_level: 1760, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000354, num: 800},
            {id: 4000363, num: 200}
        ], [
            {name: "研究所202号", msg: "......", max_level: 88, min_level: 1768, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000361, num: 800}
        ], [
            {name: "研究所203号", msg: "......", max_level: 88, min_level: 1763, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000361, num: 800},
            {id: 4000361, num: 300}
        ]
    ], [
        "米纳尔森林",
        [
            {name: "神木村西边森林", msg: "......", max_level: 89, min_level: 1765, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000226, num: 800},
            {id: 4000229, num: 300}
        ], [
            {name: "神木村东边森林", msg: "......", max_level: 87, min_level: 1767, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000236, num: 1200}
        ], [
            {name: "米纳尔森林西边境界", msg: "......", max_level: 91, min_level: 1765, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000260, num: 500},
            {id: 4000230, num: 500},
            {id: 4000261, num: 500}
        ], [
            {name: "米纳尔森林东边境界", msg: "......", max_level: 91, min_level: 1771, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000237, num: 1200}
        ], [
            {name: "怪脾气森林", msg: "......", max_level: 93, min_level: 1607, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000231, num: 500},
            {id: 4000260, num: 500}
        ], [
            {name: "天空之巢路口", msg: "......", max_level: 100, min_level: 1751, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000241, num: 500},
            {id: 4000238, num: 500}
        ], [
            {name: "冰冷死亡战场", msg: "......", max_level: 103, min_level: 1813, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000233, num: 600},
            {id: 4000234, num: 300}
        ], [
            {name: "寒冰半人马领土", msg: "......", max_level: 103, min_level: 1831, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000233, num: 800}
        ], [
            {name: "喷火龙栖息地", msg: "......", max_level: 103, min_level: 1813, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000233, num: 500}
        ], [
            {name: "冰火战场", msg: "......", max_level: 103, min_level: 1813, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000233, num: 500},
            {id: 4000232, num: 500}
        ], [
            {name: "火焰半人马领土", msg: "......", max_level: 103, min_level: 1813, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000233, num: 800}
        ], [
            {name: "火焰死亡战场", msg: "......", max_level: 103, min_level: 1831, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000234, num: 500},
            {id: 4000233, num: 500}
        ], [
            {name: "格瑞芬多森林", msg: "......", max_level: 103, min_level: 1831, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000234, num: 300},
            {id: 4000233, num: 300}
        ], [
            {name: "暗黑半人马领土", msg: "......", max_level: 103, min_level: 1831, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000234, num: 800}
        ], [
            {name: "尖峭的山丘", msg: "......", max_level: 93, min_level: 1711, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000231, num: 300},
            {id: 4000261, num: 300}
        ], [
            {name: "天空之巢Ⅰ", msg: "......", max_level: 98, min_level: 1715, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000238, num: 600},
            {id: 4000240, num: 300}
        ], [
            {name: "天空之巢Ⅱ", msg: "......", max_level: 98, min_level: 1715, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000238, num: 500},
            {id: 4000240, num: 500}
        ], [
            {name: "山羊峡谷", msg: "......", max_level: 103, min_level: 1800, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000241, num: 500},
            {id: 4000242, num: 500}
        ], [
            {name: "森林岔道", msg: "......", max_level: 103, min_level: 1800, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000241, num: 500},
            {id: 4000242, num: 500}
        ], [
            {name: "龙林入口", msg: "......", max_level: 108, min_level: 1815, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000262, num: 600},
            {id: 4000263, num: 300}
        ], [
            {name: "龙林1", msg: "......", max_level: 120, min_level: 1805, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000262, num: 500},
            {id: 4000263, num: 500},
            {id: 4000267, num: 100}
        ], [
            {name: "龙林2", msg: "......", max_level: 115, min_level: 1910, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000266, num: 500},
            {id: 4000264, num: 500}
        ], [
            {name: "龙林3", msg: "......", max_level: 120, min_level: 1912, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000265, num: 500},
            {id: 4000267, num: 100}
        ], [
            {name: "火焰树林", msg: "......", max_level: 120, min_level: 1915, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000266, num: 300},
            {id: 4000267, num: 300}
        ], [
            {name: "消失的树林", msg: "......", max_level: 120, min_level: 1905, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000266, num: 300},
            {id: 4000267, num: 300}
        ], [
            {name: "龙的峡谷", msg: "......", max_level: 116, min_level: 1921, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000268, num: 600},
            {id: 4000269, num: 300}
        ], [
            {name: "峡谷岔道", msg: "......", max_level: 116, min_level: 1921, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000268, num: 500},
            {id: 4000269, num: 500}
        ], [
            {name: "峡谷西边", msg: "......", max_level: 118, min_level: 1918, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000270, num: 800}
        ], [
            {name: "峡谷东边", msg: "......", max_level: 118, min_level: 1981, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000270, num: 800}
        ], [
            {name: "飞龙的峡谷", msg: "......", max_level: 118, min_level: 1912, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000268, num: 500},
            {id: 4000269, num: 500},
            {id: 4000270, num: 500}
        ], [
            {name: "龙之巢穴入口", msg: "......", max_level: 118, min_level: 1918, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000270, num: 500}
        ], [
            {name: "遭破坏的龙之巢穴", msg: "......", max_level: 120, min_level: 2222, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000272, num: 600},
            {id: 4000271, num: 200}
        ], [
            {name: "危险的龙之巢穴", msg: "......", max_level: 125, min_level: 2222, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000272, num: 500},
            {id: 4000271, num: 300}
        ], [
            {name: "死龙巢穴", msg: "......", max_level: 128, min_level: 2222, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000274, num: 500},
            {id: 4000273, num: 300}
        ], [
            {name: "被遗忘的龙之巢穴", msg: "......", max_level: 128, min_level: 2222, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000274, num: 500},
            {id: 4000273, num: 500}
        ], [
            {name: "主巢穴山峰", msg: "......", max_level: 128, min_level: 2222, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000273, num: 500}
        ]
    ], [
        "时间神殿",
        [
            {name: "追忆之路1", msg: "......", max_level: 106, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000444, num: 1000},
            {id: 4000443, num: 300}
        ], [
            {name: "追忆之路2", msg: "......", max_level: 109, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000445, num: 1000},
            {id: 4000443, num: 300}
        ], [
            {name: "追忆之路3", msg: "......", max_level: 113, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000447, num: 1000},
            {id: 4000459, num: 100},
            {id: 4000443, num: 200}
        ], [
            {name: "追忆之路4", msg: "......", max_level: 116, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000447, num: 200},
            {id: 4000448, num: 600},
            {id: 4000443, num: 200}
        ], [
            {name: "追忆之路5", msg: "......", max_level: 116, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000448, num: 600},
            {id: 4000443, num: 200}
        ], [
            {name: "后悔之路1", msg: "......", max_level: 121, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000449, num: 600},
            {id: 4000443, num: 150}
        ], [
            {name: "后悔之路2", msg: "......", max_level: 124, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000450, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "后悔之路3", msg: "......", max_level: 128, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000452, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "后悔之路4", msg: "......", max_level: 131, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000452, num: 300},
            {id: 4000453, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "后悔之路5", msg: "......", max_level: 131, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000453, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "忘却之路1", msg: "......", max_level: 136, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000454, num: 1000},
            {id: 4000443, num: 100}
        ], [
            {name: "忘却之路2", msg: "......", max_level: 139, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000455, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "忘却之路3", msg: "......", max_level: 143, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000457, num: 1000},
            {id: 4000443, num: 150}
        ], [
            {name: "忘却之路4", msg: "......", max_level: 146, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000457, num: 300},
            {id: 4000458, num: 800},
            {id: 4000443, num: 150}
        ], [
            {name: "忘却之路5", msg: "......", max_level: 146, min_level: 3000, onlyMap: true},
            //任务奖励
            {
                //奖励 金币 点卷 抵用卷 元宝(钻石) 经验
                //固有装备奖励
                gy_items: [
                    [4001165, 588],
                    [4321010, 38]
                ],
                //选择奖励
                xz_items: [],
                //几率获得 物品ID 数量 概率
                jl_items: [
                    [3994789, 1, 100],
                    [4322899, 1, 60]
                ]

            },
            //任务需要物品列表
            {id: 4000458, num: 800},
            {id: 4000443, num: 150}
        ]
    ]
];
var costlist = [];
var m_status;
var beaty, startype = -1, sels;
var quest, quest_info, quest_jl;
var gy_item, xz_item, jl_item;
var w_text, x_text, j_text, t_text;
var all_quest_quan = 0;

function start() {
    action(1, 0, 0);
}

/*
系统参数日志
m_ 前缀
m_s: 1 开始记录 2 完成
m_f: 放弃任务

*/
function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        if (startype == 1) {
            while (status > 0) {
                status--;
            }
        }
        status--;
        if (startype == 0) {
            status = 998;
        }
    } else {
        cm.dispose();
        return;
    }
    if (status == -1) {
        cm.sendOk("准备好了再来找我吧!");
        cm.dispose();
        return;
    }
    if (selection == 99999) {
        status = 0;
    }
    if (status == 0) {
        var
            text = "         " + 皇冠 + "#e#r独家超怀旧336个任务专题#k#n" + 皇冠 + "\r\n"
        text += "\t\t" + 绿水灵 + "#dHi~这里有很多任务哦!!!" + 进行中 + "" + 音符 + "\r\n" + H字母 + "操作小提示：每天研究一下有什么任务可以做，历经半年，全管理员手敲，只为您找回儿时回忆！\r\n" + H字母 + "练级同时可以收集主线任务材料，#r送点券+抵用+副本门票物品相当划算哦#k#l\r\n";//\r\n\t#b目前已经完成：#r#e"+cm.getzx()+"#n#b 个任务#dHi~这里有很多任务哦!!!\r\n#b

        text += " #k#n" + 蓝左头 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "#d[任务如下]" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝条 + "" + 蓝右头 + "\r\n"


        for (var i = 0; i < costMap.length; i++) {
            var l_quan = costMap[i].length - 1;
            text += "#L" + i + "#" + printf(costMap[i][0], 31) + " 共计：#r" + fprint(l_quan, 3) + "#b个任务#l\r\n";
            all_quest_quan += l_quan;
        }
        //cm.sendSimple(text + "\r\n\r\n#b目前管理员已添加了共计：#e#r" + all_quest_quan + "#b#n 个任务");
		//cm.sendSimple(text + "\r\n\r\n#b目前管理员已添加了共计：#e#r336#b#n 个任务");
		cm.sendSimple(text + "\r\n\r\n         #b此任务系统每天晚上24点自动重置刷新");
    } else if (status == 1) {
        costlist = costMap[selection];
        var quest_quan = 0;
        var text = "#r#e" + costlist[0] + "\r\n#n#b";
        for (var i = 1; i < costlist.length; i++) {
            quest = costlist[i][0];
            var m_s = cm.getBossLog("m_s:" + quest.name);
            if (m_s != 2) {//判断等级之间 || 正在开始任务
                if (cm.getBossLog("m_f:" + quest.name) == 0) {//判断放弃
                    text += "#L" + i + "##b " + printf(quest.name, 31) + "" + (m_s == 1 ? 正在进行 : 可以开始 ) + "#l\r\n";
                    quest_quan++;
                }
            }
            // 屏蔽等级
            // var hf_level = false;
            // var over_level = false;
            // if (cm.getPlayer().getLevel() >= quest.min_level && cm.getPlayer().getLevel() <= quest.max_level) {
            //     hf_level = true;
            // }
            // if (cm.getPlayer().getLevel() > quest.max_level) {
            //     over_level = true;
            // }
            // if (m_s != 2 && !over_level) {//判断等级之间 || 正在开始任务
            //     if (cm.getBossLog("m_f:" + quest.name) == 0) {//判断放弃
            //         text += "#L" + i + "#LEV#r" + fprint(quest.min_level, 3) + "#b-#r" + fprint(quest.max_level, 3) + "#b " + printf(quest.name, 31) + "" + (m_s == 1 ? 正在进行 : (hf_level ? 可以开始 : "")) + "#l\r\n";
            //         quest_quan++;
            //     }
            // }
        }
        if (quest_quan != 0) {
            cm.sendSimple("#b#e目前为您查询到了：#r" + quest_quan + "#b 个任务,加油!#n#k\r\n\t\t\t\t   #b#L99999#返回首页#l#k\r\n" + text);
        } else {
            cm.sendOk("#b哇塞……暂时无数据,等待开放!");
            cm.dispose();
        }
    } else if (status == 2) {
        beaty = costlist[selection];
        quest_info = beaty[0];
        quest_jl = beaty[1];
        m_status = cm.getBossLog("m_s:" + quest_info.name);
        // 屏蔽等级
        // var text = "#b" + 任务简介 + " - #b" + quest_info.name + "\r\n#r#e等级要求 #b#nLEV#r" + fprint(quest_info.min_level, 3) + "#b-#r" + fprint(quest_info.max_level, 3) + "" + (quest_info.onlyMap ? "\r\n#b完成任务时所在地图:#r" + quest_info.name + "#k" : "") + "#k\r\n" + quest_info.msg + "";
        var text = "#b" + 任务简介 + " - #b" + quest_info.name + "\r\n" + (quest_info.onlyMap ? "\r\n#b完成任务时所在地图:#r" + quest_info.name + "#k" : "") + "#k\r\n" + quest_info.msg + "";
        text += "\r\n\r\n#e#b任务需要物品:#n#k\r\n";
        for (var i = 2; i < beaty.length; i++) {
            text += "#i" + beaty[i].id + ":##b#z" + beaty[i].id + "##k × #r#e" + beaty[i].num + " #n#b已拥有：#e#r#c" + beaty[i].id + "##n\r\n";
        }
        text += "\r\n\r\n";
        text += 奖励 + "\r\n";
        // 屏蔽等级
        // var avg_level = parseInt((quest_info.min_level + quest_info.max_level) / 2);
        //无条件获得
        gy_item = quest_jl.gy_items == null ? 0 : quest_jl.gy_items;//固有奖励数组
        w_text = "";
        for (var i = 0; i < gy_item.length; i++) {
            w_text += "#i" + gy_item[i][0] + ":##b#z" + gy_item[i][0] + "##k × #r#e" + gy_item[i][1] + "#k#n\r\n";
        }
        if (quest_jl.meso != null) {
            w_text += 三眼章鱼 + " 奖励 #r#e" + quest_jl.meso + "#k#n 金币\r\n";
        }
        if (quest_jl.exp != null) {
            w_text += 绿水灵 + " 奖励 #r#e" + quest_jl.exp + "#k#n 经验\r\n";

        }
        if (quest_jl.nx != null) {
            w_text += 花蘑菇 + " 奖励 #r#e" + quest_jl.nx + "#k#n 点卷\r\n";
        } else if (quest_info.onlyMap) {
            quest_jl.nx = quest_info.min_level;
            w_text += 花蘑菇 + " 奖励 #r#e" + quest_jl.nx + "#k#n 点卷\r\n";
        }
        if (quest_jl.dy != null) {
            w_text += 猪猪 + " 奖励 #r#e" + quest_jl.dy + "#k#n 抵用卷\r\n";
        } else if (quest_info.onlyMap) {
            quest_jl.dy = quest_info.max_level;
            w_text += 猪猪 + " 奖励 #r#e" + quest_jl.dy + "#k#n 抵用卷\r\n";
        }
        if (quest_jl.zb != null) {
            w_text += 熊熊 + " 奖励 #r#e" + quest_jl.zb + "#k#n 钻石\r\n";
        }
        if (w_text != "") {
            text += 无条件获得 + "\r\n" + w_text;
        }

        //选择获得
        xz_item = quest_jl.xz_items == null ? 0 : quest_jl.xz_items;//固有奖励数组
        x_text = "";
        if (m_status == 0) {
            for (var i = 0; i < xz_item.length; i++) {
                x_text += "#i" + xz_item[i][0] + ":##b#z" + xz_item[i][0] + "##k × #r#e" + xz_item[i][1] + "#k#n\r\n";
            }
        } else {
            for (var i = 0; i < xz_item.length; i++) {
                x_text += "#L" + i + "##i" + xz_item[i][0] + ":##b#z" + xz_item[i][0] + "##k × #r#e" + xz_item[i][1] + "#k#n#l\r\n";
            }
        }
        if (x_text != "") {
            text += "\r\n" + 选择获得 + "\r\n" + x_text;
        }


        //几率获得
        jl_item = quest_jl.jl_items == null ? 0 : quest_jl.jl_items;//固有奖励数组
        j_text = "";
        for (var i = 0; i < jl_item.length; i++) {
            j_text += "#i" + jl_item[i][0] + ":##b#z" + jl_item[i][0] + "##k × #r#e" + jl_item[i][1] + "#k#n - #b" + fprint(jl_item[i][2], 3) + "%几率获得#k\r\n";
        }
        if (j_text != "") {
            text += "\r\n" + 几率获得 + "\r\n" + j_text;
        }


        if (m_status == 0) {
            startype = 0;
            cm.sendAcceptDecline(text);
        } else {
            startype = 1;
            cm.sendNext(text);
        }
    } else if (status == 3) {
        if (startype == 0) {
            // 屏蔽等级限制
            // if (cm.getPlayer().getLevel() < quest_info.min_level || cm.getPlayer().getLevel() > quest_info.max_level) {
            //     cm.sendOk("#b接受任务不在等级区间！");
            //     cm.dispose();
            //     return;
            // }
            cm.setBossLog("m_s:" + quest_info.name);
            cm.sendOk("任务#b接受#k成功~!\r\n我在这儿等你完成哦~!");
            cm.dispose();
        } else if (startype == 1) {
            sels = selection;
            if (m_status != 1) {
                cm.sendOk("#r这个任务你已经做过了哦~!");
                cm.dispose();
                return;
            }


            if ((cm.getMeso() + quest_jl.meso) >= 2147483647) {
                cm.sendOk("#r金币空间不足");
                cm.dispose();
                return;
            }

            for (var i = 2; i < beaty.length; i++) {
                if (!cm.haveItem(beaty[i].id, beaty[i].num)) {
                    cm.sendOk("#b身上没有#r#i" + beaty[i].id + "##t" + beaty[i].num + "# × " + beaty[i].num + "");
                    cm.dispose();
                    return;
                }
            }

            var text = "";

            text += 奖励 + "\r\n";

            //无条件获得
            if (w_text != "") {
                text += 无条件获得 + "\r\n" + w_text;
            }

            //选择获得
            x_text = "";
            if (xz_item != 0) {
                x_text += "#i" + xz_item[sels][0] + ":##b#z" + xz_item[sels][0] + "##k × #r#e" + xz_item[sels][1] + "#k#n\r\n";
            }
            if (x_text != "") {
                text += "\r\n" + 选择获得 + "\r\n" + x_text;
            }

            t_text = text;

            //几率获得
            if (j_text != "") {
                text += "\r\n" + 几率获得 + "\r\n" + j_text;
            }


            cm.sendYesNo("#r#e请确认您的任务奖励清单背包是否能放下!#k#n\r\n" + text);
        }
    } else if (status == 4) {
        for (var i = 2; i < beaty.length; i++) {
            cm.gainItem(beaty[i].id, -beaty[i].num);
        }

        if (quest_jl.meso != null) {
            cm.gainMeso(quest_jl.meso);
        }
        if (quest_jl.exp != null) {
            cm.gainExp(quest_jl.exp);
        }
        if (quest_jl.nx != null) {
            cm.gainNX(quest_jl.nx);
        }
        if (quest_jl.dy != null) {
            cm.gainDY(quest_jl.dy);
        }
        if (quest_jl.zb != null) {
            cm.gainzb(quest_jl.zb);
        }

        for (var i = 0; i < gy_item.length; i++) {
            cm.gainItem(gy_item[i][0], gy_item[i][1]);
        }
        if (xz_item != 0) {
            cm.gainItem(xz_item[sels][0], xz_item[sels][1]);
        }
        j_text = "";
        for (var i = 0; i < jl_item.length; i++) {
            if (Math.floor((Math.random() * 100) + 1) <= jl_item[i][2]) {
                cm.gainItem(jl_item[i][0], jl_item[i][1]);
                j_text += "#i" + jl_item[i][0] + ":##b#z" + jl_item[i][0] + "##k × #r#e" + jl_item[i][1] + "#k#n\r\n";
            }
        }
        if (j_text != "") {
            t_text += "\r\n" + 几率获得 + "\r\n" + j_text;
        }
        cm.setBossLog("m_f:" + quest_info.name);
		cm.setBossLog1("主线任务完成次数", 1);
        //cm.setBossLog("主线任务完成次数", 1, "角色");
        cm.sendOk("#b恭喜你已经完成了 #r" + quest_info.name + "#b 任务 \r\n" + t_text);
        //cm.gainzx(1);
        cm.喇叭(2, "恭喜 " + cm.getChar().getName() + " 历经艰辛终于完成了 " + quest_info.name + " 任务！");
        cm.dispose();
    } else if (status == 997) {
        cm.sendOk("准备好了就来找我吧~!");
        cm.dispose();
    } else if (status == 998) {
        startype = -1;
        cm.sendSimple("你是否真的要#b拒绝#k这个任务?\r\n\r\n拒绝后将无法在接受这项任务。\r\n#b#L99999#不,我只是想返回首页.#l\r\n#r#L0#是的,这个任务不太适合我.#l");
    } else if (status == 999) {
        cm.setBossLog("m_f:" + quest_info.name);
        cm.sendOk("此任务已从你的任务列表永久消失了~!");
        cm.dispose();
    } else {
        cm.sendOk("脚本错误请联系技术处理");
        cm.dispose();
    }
}


function printf(msg, ws) {
    msg = msg + "";
    var text = "";
    for (var j = ws - msg.replaceAll("[^\\x00-\\xff]", "**").getBytes().length; j > 0; j--) {
        text += " ";
    }
    return msg + text;
}

function fprint(msg, ws) {
    msg = msg + "";
    var text = "";
    for (var j = ws - msg.replaceAll("[^\\x00-\\xff]", "**").getBytes().length; j > 0; j--) {
        text += " ";
    }
    return text + msg;
}
