var 萌新系统 = "#fEffect/CharacterEff1.img/QQ1408745/0/9#";
var dd = " ";
var 粉心 = "#fEffect/CharacterEff/1112903/0/0#";
var 群粉心 = ""+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+"\r\n";
var 选择道具 = "#fUI/UIWindow.img/QuestIcon/3/0#";//选择道具
var 红箭头 = "#fUI/UIWindow.img/Quest/icon9/0#";//红色右箭头
var 蓝箭头 = "#fUI/UIWindow.img/Quest/icon8/0#";//蓝色右箭头
var 短刀 = 1332289
var 长仗 = 1382273
var 枪 = 1432227
var 弓 = 1452266
var 弩 = 1462252
var 拳套 =1472275
var 爪 =1482232
var 手枪 =1492245
var 双手剑 =1402268

var 红色短刀 =1332242
var 红色长仗 =1332226
var 红色枪 =1432182
var 红色弓 =1452220
var 红色弩 =1462208
var 红色拳套 =1472230
var 红色爪 =1482232
var 红色手枪 =1492194
var 红色双手剑 =1402214

var 银杏叶 ="#fMap/MapHelper/weather/maple/3#";
function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
	        text +=""+dd+"\r\n\t\t\t"+萌新系统+"\r\n"+群粉心+"";
            //text += ""+选择道具+"\r\n\r\n";
            text += ""+蓝箭头+"#i1002511#T5六件套 + #i1402039#T5九件武器\r\n"
            text += ""+蓝箭头+"#i1002487#[全属+10]"+蓝箭头+"#i1042250#[全属+10]"+蓝箭头+"#i1072448#[全属+10]\r\n"
            text += ""+蓝箭头+"#i1102292#[全属+10]"+蓝箭头+"#i1062228#[全属+10]"+蓝箭头+"#i1082312#[全属+10]\r\n"
            text += ""+蓝箭头+"#i1702520#[全属+10]"+蓝箭头+"#i1115173#[全属+10]"+蓝箭头+"#i1115084#[全属+10]\r\n"
            text += ""+蓝箭头+"#i1115201#[全属+10]"+蓝箭头+"#i1142263#[全属+5]"+蓝箭头+"#i2000005#*100\r\n"

            text += ""+蓝箭头+"#i2022511# *100个"+蓝箭头+"#i2022506# *7天\r\n"
            text += ""+蓝箭头+"#i5010019# *3天 "+蓝箭头+"#i5030000# *7天 "+蓝箭头+"#i5000025# *7天\r\n"
			text += ""+红箭头+"学习#s8#"+红箭头+"学习#s1004#"+红箭头+"学习#i5190001#"+红箭头+"学习#i5190006#\r\n\r\n"
            text += ""+红箭头+"金币:3000万；"+红箭头+"抵用券:30000；"+红箭头+"点券:30000\r\n\r\n"

            text += "\t\t\t#r#e#L1##v2022509#领取新手礼包#v2022509##l\r\n\r\n"

			//text +="#k\r\n#d┕==== "+银杏叶+" =========================================#d┙#k\r\n";"+蓝箭头+"#i1112947#[全属+10]

            cm.sendSimple(text);
        } else if (status == 1) {
            if (selection == 1) {
                if (cm.getPlayer().getOneTimeLog('新手礼包')<=0)  {
         //   cm.gainPet(5000025, "小金猪", 13,30 , 30, 30);
            cm.getPlayer().setOneTimeLog('新手礼包');
            //cm.gainItem(5532002,-1);
            cm.teachSkill(8,1,1);//群宠技能  10000018
            cm.teachSkill(1004,1,1);//骑兽技能
            cm.gainItem(5190001,1);//自动服用mp
            cm.gainItem(5190006,1);//自动服用hp
			cm.gainItem(2022520,1);//拍卖盒子
			cm.gainItem(2022511,100);//破功
            cm.gainItem(2022506,1,7);//分身
            cm.gainItem(5010019,1,3);//VIP3日
            cm.gainItem(5000025,1,7);//给宠物7天.小金猪
            cm.gainItem(5030000,1,7);//商店7日权
			
			//cm.gainItem(1112947,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//特效戒子悬浮
			cm.gainItem(1115201,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//魂魄戒子
            cm.gainItem(1002511,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手帽子T5
            cm.gainItem(1052461,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手套装
            cm.gainItem(1072666,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手鞋子
            cm.gainItem(1082345,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手手套
            cm.gainItem(1102168,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手披风
            cm.gainItem(1132154,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手腰带
			
            cm.gainItem(1402039,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手剑
			cm.gainItem(1332056,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5短刀
			cm.gainItem(1382039,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5杖
			cm.gainItem(1452045,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓
			cm.gainItem(1492022,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓
			cm.gainItem(1482022,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓
			cm.gainItem(1462040,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓
			cm.gainItem(1472055,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓
			cm.gainItem(1432040,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//T5弓

            cm.给抵用券(30000);//抵用券
            cm.给点券(30000);//点券
            cm.gainMeso(30000000);//金币
			//cm.gainItem(2370007,10);//2000经验
            cm.gainItem(2000019,100);//超级药水
			//cm.getPlayer().setLimitBreak(cm.getPlayer().getDamage() + 300000);//破功
            cm.gainItem(1002487,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手帽子恐龙
            cm.gainItem(1042250,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手套装
            cm.gainItem(1072448,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手手套
            cm.gainItem(1702520,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手鞋子
			cm.gainItem(1115173,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手戒指
			cm.gainItem(1115084,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手戒指
			cm.gainItem(1102292,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手
			cm.gainItem(1062228,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手
			cm.gainItem(1082312,0,0,10,10,10,10,100,100,10,10,10,10,0,0,0,0);//新手
            text += ""+蓝箭头+"#i1102292#[全属+10]"+蓝箭头+"#i1062228#[全属+10]"+蓝箭头+"#i1082312#[全属+10]\r\n"
            cm.gainItem(1142263,0,0,5,5,5,5,0,0,5,5,5,5,0,0,0,0);//新手勋章
            //cm.gainItem(1142686,0,0,5,5,5,5,0,0,5,5,5,5,0,0,0,0);//内测勋章
            //cm.gainItem(1142688,0,0,5,5,5,5,5,5,5,5,5,5,5,5,30,50);//VIP勋章
            cm.sendOk("新手礼包领取成功！");
			cm.worldMessage(5,"萌新公告：玩家["+cm.getName()+"]来到开心冒险岛！大佬们快去收徒了!好好爱他/她！");//1师给弹窗
			cm.worldMessage(5,"萌新公告：玩家["+cm.getName()+"]来到开心冒险岛！大佬们快去收徒了!好好爱他/她！");//1师给弹窗
			cm.worldMessage(5,"萌新公告：玩家["+cm.getName()+"]来到开心冒险岛！大佬们快去收徒了!好好爱他/她！");//1师给弹窗
            cm.dispose();
                } else {
                    cm.sendOk("#g你已经领取过一次了，不可以重复领取哦！\r\n");
                    cm.dispose();
                }
           
           
                
            } 
            }
        }
    }
