
var 卡通图标粉红熊 = "#fUI/UIWindow.img/Minigame/Omok/stone/6/black/1#";//
var 副本 = "武器收集";
var 副本1 = "武器收集完成";
var status = -1;
var itemLista = Array(// 材料代码 奖励金币 奖励经验 备用 备用 备用 材料需求数量 标记代码
	Array(1432004,1000000, 1500, 0, 0, 0,3,26,""), 		
	Array(1432006,1000000, 1500, 0, 0, 0,3,26,""), 	
	Array(1442010,1000000, 1500, 0, 0, 0,3,26,""), 		
	Array(1442005,1000000, 1500, 0, 0, 0,3,26,""), 	
	Array(1432007,1000000, 1500, 0, 0, 0,3,26,""), 	
	Array(1442008,1000000, 1500, 0, 0, 0,3,26,""), 		
	Array(1442019,1000000, 1500, 0, 0, 0,3,26,""), 		
	Array(1432010,1000000, 1500, 0, 0, 0,3,26,""), 	
	Array(1322018,1000000, 1500, 0, 0, 0,3,26,""), 		
	Array(1422009,1000000, 1500, 0, 0, 0,3,26,""), 	
	Array(1422005,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1322019,1000000, 1500, 0, 0, 0,3,26,""),  
	Array(1322028,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1322020,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1422012,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1412003,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1412007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1312010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1312009,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1402011,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1402012,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332017,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1302012,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1372007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1372015,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1382007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1382006,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1382010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1382008,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452008,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452004,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452009,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452011,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452015,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462006,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462008,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462009,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462011,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462013,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472021,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472019,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472025,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472026,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472029,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472027,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472031,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332011,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332015,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332003,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332018,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332019,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332022,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332023,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1482007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1482008,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1482009,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1482010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1492008,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1492007,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1492009,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1492010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332027,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1442020,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1422013,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1372010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1382035,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1302056,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1312030,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1322045,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1402035,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1412021,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1422027,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1432030,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1442044,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452019,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462015,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332052,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472053,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332051,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1492012,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1302023,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1312015,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1322029,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1402005,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1402016,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1412010,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1432011,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1452017,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1462018,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1472033,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1332026,1000000, 1500, 0, 0, 0,3,26,""), 
	Array(1482011,1000000, 1500, 0, 0, 0,3,26,"")
 
 

 
 
);		
var 本阶段完成奖励装备 = 1132011;
var selectedItem = -1;
var selequantity = -1;
var selectedCos = -1;
var selectedtimes = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "             #b " + 卡通图标粉红熊 + "[武器收集系统]" + 卡通图标粉红熊 + "\r\n #r每完成一个获得能力值+1\r\n收集完所有材料可以获得#v"+本阶段完成奖励装备+"# #r四维:0 #g双攻:0#k\r\n         ";
		var txt = " \r\n\r\n#L999##r#e我收集齐了所有材料(完成度："+cm.getPlayer().getBossLog1(副本)+"/"+itemLista.length+")\r\n\r\n";
        for (var i = 0; i < itemLista.length; i++) {
        if (cm.getPlayer().getBossLog1(副本 + itemLista[i][0]) > 0) {
            continue;
        }
            selStr += "\r\n#L" + i + "#收集#b#v" + itemLista[i][0] + "# #k * #r" + itemLista[i][6] + "#k 个 完成度："+cm.getPlayer().getBossLog1(副本+itemLista[i][0])+"/1#l";
        }
        cm.sendSimple(selStr+txt);
    } else if (status == 1) {
		if (selection < 997 ){ 
        var item = itemLista[selection];
		    A = item[0];
            B= item[1];
			C = item[2];
			D= item[3];
			E= item[4];
			F = item[5];
			G= item[6];
			H= item[0];	
            I = item[8];	
		    txta = "经验 * " + C + "\r\n\r\n金币 * " + B + " \r\n\r\n";
		
		cm.sendYesNo("#k收集齐 可以获得\r\n奖励如下：\r\n\r\n" + txta + "#r能力值+1#l"); //
		} else if (selection == 999) {
		    if (cm.getPlayer().getBossLog1(副本) < itemLista.length) {
			cm.sendOk("你并未完成要求");
			cm.dispose();
			return;	
			
			} else if (cm.getPlayer().getBossLog1(副本1) >=1) {
			cm.sendOk("你已经领取过一次了");
			cm.dispose();
			return;	
			
			} else {
			////cm.getPlayer().gainAp
			cm.gainItem(本阶段完成奖励装备, 1,true);			
			cm.getPlayer().setBossLog1(副本1,1)
			cm.worldMessage(6, "玩家 " + cm.getPlayer().getName() + " 领取了 " + 副本 + " 完整的收集奖励");
            cm.sendOk("领取了 " + 副本 + "  的完成收集奖励 ");
            cm.dispose();
			} 
		}
    } else if (status == 2) {
		if (cm.getPlayer().getBossLog1(副本+H) > 0) {
			cm.sendOk("你已经领取过了，一个账号只能领取一次");
			cm.dispose();
			return;
		}
        if (cm.haveItem(A, G) ) {//修炼点代码 记得换	   
        cm.gainMeso(+B);       
		cm.gainExp(C);
		cm.getPlayer().setBossLog1(副本+H,1);
		cm.getPlayer().setBossLog1(副本,1);		
		cm.gainItem(A, -G);
		cm.getPlayer().gainAp(1);//给能力值
		cm.worldMessage(6, "玩家 " + cm.getPlayer().getName() + " 领取了 " + 副本 + " "+I+" 的收集奖励");
		//cm.laba(cm.getPlayer().getName() + " : " + " 领取了 " + 副本 + " 的收集奖励", 11);
		cm.dispose();
        } else {
            cm.sendOk("你没有收集到足够的物品");
			            cm.dispose();
						            return;
        }
        status = -1;
    }
}