

var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var xx = "#fItem/Etc/0427/04270001/Icon9/0#";  //小黄星
var 广播 = "#fUI/CN_Chat/ChattingRoom/BtVolUp/0/normal/0#";
var 感叹 = "#fUI/UIWindow/Quest/icon0#";
var 箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 获取 = "#fUI/UIWindow.img/QuestIcon/4/0#";
var 获得 = "#fUI/UIWindow.img/QuestIcon/4/0#";
var 无条件 = "#fUI/UIWindow/Quest/basic#";
var 几率获 = "#fUI/UIWindow/Quest/prob#";
var 功能名称 = "每日需要";
var 要求捐献 = 50000;
var 是 = 2146000001;
var 否 = 2146000002;
var 返回 = 2146000003;
var 交提 = 2143000001;
var 查询 = 2143000002;
var 重置 = 2143000003;
var 道具 = 2143000004;

var 家族id;

var 任务 = {
	记录: "每日需要任务",
	额外奖励: 2022465, 数量: 1,
	神秘奖励: [//神秘奖励概率为百分比！从数组中获得1个奖励
		{ 代码: 1122174, 数量: 1, 概率: 1000 },
		{ 代码: 1032121, 数量: 1, 概率: 1000 },
		{ 代码: 1082401, 数量: 1, 概率: 1000 },
		{ 代码: 1042231, 数量: 1, 概率: 1000 },
		{ 代码: 1062148, 数量: 1, 概率: 1000 },
		{ 代码: 1072618, 数量: 1, 概率: 1000 },


	],
	阶段奖励: [
		{
			阶段: 0, 点券: 100, 抵用: 100, 金币: 100000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 1, 点券: 200, 抵用: 200, 金币: 200000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 2, 点券: 300, 抵用: 300, 金币: 300000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 3, 点券: 400, 抵用: 400, 金币: 400000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 4, 点券: 500, 抵用: 500, 金币: 500000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 5, 点券: 600, 抵用: 600, 金币: 600000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 6, 点券: 700, 抵用: 700, 金币: 700000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 7, 点券: 800, 抵用: 800, 金币: 800000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 8, 点券: 900, 抵用: 900, 金币: 900000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
		{
			阶段: 9, 点券: 1000, 抵用: 1000, 金币: 1000000, 经验: 0.03, 奖励物品: [
				{ 代码: 2022509, 数量: 1 },
			]
		},
	]
};

var 每日奖励 = [
    [0,100,100,100000,0.03,2022509,1],
	[1,200,200,200000,0.03,2022509,1],
	[2,300,300,300000,0.03,2022509,1],
	[3,400,400,400000,0.03,2022509,1],
	[4,500,500,500000,0.03,2022509,1],
	[5,600,600,600000,0.03,2022509,1],
	[6,700,700,700000,0.03,2022509,1],
	[7,800,800,800000,0.03,2022509,1],
	[8,900,900,900000,0.03,2022509,1],
	[9,1000,1000,1000000,0.03,2022509,1]
	]

var 每日任务材料 = [
	{ 类型: "狩猎", 代码: 4000016, 要求: { 最小: 300, 最大: 1000 } },   // 红蜗牛壳
	{ 类型: "狩猎", 代码: 4000008, 要求: { 最小: 300, 最大: 1000 } },   // 道符
	{ 类型: "狩猎", 代码: 4000002, 要求: { 最小: 300, 最大: 1000 } },   // 蝴蝶结
	{ 类型: "狩猎", 代码: 4000007, 要求: { 最小: 300, 最大: 1000 } },   // 火独眼
	{ 类型: "狩猎", 代码: 4000029, 要求: { 最小: 300, 最大: 1000 } },   // 香蕉
	{ 类型: "狩猎", 代码: 4000023, 要求: { 最小: 300, 最大: 1000 } },   // 冰独眼
	{ 类型: "狩猎", 代码: 4000011, 要求: { 最小: 300, 最大: 1000 } },   // 蘑菇孢芽
	{ 类型: "狩猎", 代码: 4000009, 要求: { 最小: 300, 最大: 1000 } },   // 蓝蘑菇
	{ 类型: "狩猎", 代码: 4000037, 要求: { 最小: 300, 最大: 1000 } },   // 蓝水灵
	{ 类型: "狩猎", 代码: 4000042, 要求: { 最小: 300, 最大: 1000 } },   // 蝙蝠翅膀
	{ 类型: "狩猎", 代码: 4000035, 要求: { 最小: 300, 最大: 1000 } },   // 桌布
	{ 类型: "狩猎", 代码: 4000036, 要求: { 最小: 300, 最大: 1000 } },   // 奇妙的药
	{ 类型: "狩猎", 代码: 4000032, 要求: { 最小: 300, 最大: 1000 } },   // 鳄鱼皮
	{ 类型: "狩猎", 代码: 4000039, 要求: { 最小: 300, 最大: 1000 } },   // 铁甲猪蹄
	{ 类型: "狩猎", 代码: 4000043, 要求: { 最小: 300, 最大: 1000 } },   // 红螃蟹
	{ 类型: "狩猎", 代码: 4000045, 要求: { 最小: 300, 最大: 1000 } },   // 乌龟
	{ 类型: "狩猎", 代码: 4000052, 要求: { 最小: 300, 最大: 1000 } },   // 白狼尾
	{ 类型: "狩猎", 代码: 4000060, 要求: { 最小: 300, 最大: 1000 } },   // 月光精灵
	{ 类型: "狩猎", 代码: 4000069, 要求: { 最小: 300, 最大: 1000 } },   // 僵尸
	{ 类型: "狩猎", 代码: 4000074, 要求: { 最小: 300, 最大: 1000 } },   // 黑色飞狮尾
	{ 类型: "狩猎", 代码: 4000102, 要求: { 最小: 300, 最大: 1000 } },   // 黑积木
	{ 类型: "狩猎", 代码: 4000106, 要求: { 最小: 300, 最大: 1000 } },   // 玩具熊猫棉花
	{ 类型: "狩猎", 代码: 4000108, 要求: { 最小: 300, 最大: 1000 } },   // 熊猫娃娃
	{ 类型: "狩猎", 代码: 4000115, 要求: { 最小: 300, 最大: 1000 } },   // 齿轮
	{ 类型: "狩猎", 代码: 4000128, 要求: { 最小: 300, 最大: 1000 } },   // 黄小丑
	{ 类型: "狩猎", 代码: 4000143, 要求: { 最小: 300, 最大: 1000 } },   // 僵尸娃娃
	{ 类型: "狩猎", 代码: 4000162, 要求: { 最小: 300, 最大: 1000 } },   // 华丽鳞片
	{ 类型: "狩猎", 代码: 4000180, 要求: { 最小: 300, 最大: 1000 } },   // 鲨鱼假牙
	{ 类型: "狩猎", 代码: 4000182, 要求: { 最小: 300, 最大: 1000 } },   // 石灰粉瓶
	{ 类型: "狩猎", 代码: 4000183, 要求: { 最小: 300, 最大: 1000 } },   // 墨汁瓶
	{ 类型: "狩猎", 代码: 4000188, 要求: { 最小: 300, 最大: 1000 } },   // 鸭蛋
	{ 类型: "狩猎", 代码: 4000191, 要求: { 最小: 300, 最大: 1000 } },   // 黑山羊角
	{ 类型: "狩猎", 代码: 4000192, 要求: { 最小: 300, 最大: 1000 } },   // 鼻环
	{ 类型: "狩猎", 代码: 4000197, 要求: { 最小: 300, 最大: 1000 } },   // 石板
	{ 类型: "狩猎", 代码: 4000205, 要求: { 最小: 300, 最大: 1000 } },   // 骷髅犬绑带
	{ 类型: "狩猎", 代码: 4000207, 要求: { 最小: 300, 最大: 1000 } },   // 骨盆
	{ 类型: "狩猎", 代码: 4000373, 要求: { 最小: 300, 最大: 1000 } },   // 墨汁
	{ 类型: "狩猎", 代码: 4000292, 要求: { 最小: 300, 最大: 1000 } },   // 人参汤
	{ 类型: "狩猎", 代码: 4000294, 要求: { 最小: 300, 最大: 1000 } },   // 百年桔梗
	{ 类型: "狩猎", 代码: 4000329, 要求: { 最小: 300, 最大: 1000 } },   // 仙人掌球
	{ 类型: "狩猎", 代码: 4000330, 要求: { 最小: 300, 最大: 1000 } },   // 仙人掌刺
	{ 类型: "狩猎", 代码: 4000331, 要求: { 最小: 300, 最大: 1000 } },   // 仙人掌花
	{ 类型: "狩猎", 代码: 4000354, 要求: { 最小: 300, 最大: 1000 } },   // 烧杯
	{ 类型: "狩猎", 代码: 4000089, 要求: { 最小: 300, 最大: 1000 } },   // 流氓A的徽章
	{ 类型: "狩猎", 代码: 4000066, 要求: { 最小: 300, 最大: 1000 } },   // 云狐尾巴
	{ 类型: "狩猎", 代码: 4000075, 要求: { 最小: 300, 最大: 1000 } },   // 三角头巾
	{ 类型: "狩猎", 代码: 4000080, 要求: { 最小: 300, 最大: 1000 } },   // 火焰猎犬的项链
	{ 类型: "狩猎", 代码: 4000281, 要求: { 最小: 300, 最大: 1000 } },   // 蛇纹皮
	{ 类型: "狩猎", 代码: 4000298, 要求: { 最小: 300, 最大: 1000 } },   // 白纸张
	{ 类型: "狩猎", 代码: 4000282, 要求: { 最小: 300, 最大: 1000 } },   // 蟠桃核
	{ 类型: "狩猎", 代码: 4000465, 要求: { 最小: 300, 最大: 1000 } },   // 椰子壳
	{ 类型: "狩猎", 代码: 4000472, 要求: { 最小: 300, 最大: 1000 } },   // 蛇笛
	{ 类型: "狩猎", 代码: 4000469, 要求: { 最小: 300, 最大: 1000 } },   // 围巾
	{ 类型: "狩猎", 代码: 4000375, 要求: { 最小: 300, 最大: 1000 } },   // 轮胎
	{ 类型: "狩猎", 代码: 4000433, 要求: { 最小: 300, 最大: 1000 } },   // 油罐
	{ 类型: "狩猎", 代码: 4000432, 要求: { 最小: 300, 最大: 1000 } },   // 青苔岩石
	{ 类型: "狩猎", 代码: 4000434, 要求: { 最小: 300, 最大: 1000 } },   // 大花草
	{ 类型: "狩猎", 代码: 4000118, 要求: { 最小: 300, 最大: 1000 } },   // 小太空船
	{ 类型: "狩猎", 代码: 4000172, 要求: { 最小: 300, 最大: 1000 } },   // 三尾狐的尾巴
	{ 类型: "狩猎", 代码: 4000440, 要求: { 最小: 300, 最大: 1000 } },   // 粗糙的皮革
	{ 类型: "狩猎", 代码: 4000439, 要求: { 最小: 300, 最大: 1000 } },   // 青苔石
	{ 类型: "狩猎", 代码: 4000085, 要求: { 最小: 300, 最大: 1000 } },   // 火石球的石片
	{ 类型: "狩猎", 代码: 4000050, 要求: { 最小: 300, 最大: 1000 } },   // 企鹅王的嘴
	{ 类型: "狩猎", 代码: 4000049, 要求: { 最小: 300, 最大: 1000 } },   // 白雪人角
	{ 类型: "狩猎", 代码: 4000272, 要求: { 最小: 300, 最大: 1000 } },   // 蛋壳碎片
	{ 类型: "狩猎", 代码: 4000268, 要求: { 最小: 300, 最大: 1000 } },   // 飞龙的翅膀
	{ 类型: "狩猎", 代码: 4000241, 要求: { 最小: 300, 最大: 1000 } },   // 邪恶绵羊嚼过的草
	{ 类型: "狩猎", 代码: 4000233, 要求: { 最小: 300, 最大: 1000 } },   // 半人马的净水
	{ 类型: "狩猎", 代码: 4000236, 要求: { 最小: 300, 最大: 1000 } },   // 橡木甲虫角
	{ 类型: "狩猎", 代码: 4000240, 要求: { 最小: 300, 最大: 1000 } },   // 小火花羽毛
	{ 类型: "狩猎", 代码: 4000166, 要求: { 最小: 300, 最大: 1000 } },   // 虾肉
	{ 类型: "狩猎", 代码: 4000163, 要求: { 最小: 300, 最大: 1000 } },   // 海马的角
	{ 类型: "狩猎", 代码: 4000027, 要求: { 最小: 300, 最大: 1000 } },   // 怪猫的眼
	{ 类型: "狩猎", 代码: 4000028, 要求: { 最小: 300, 最大: 1000 } },   // 月牙牛魔王的角
	{ 类型: "狩猎", 代码: 4000127, 要求: { 最小: 300, 最大: 1000 } },   // 玩具鼓
	{ 类型: "狩猎", 代码: 4000402, 要求: { 最小: 300, 最大: 1000 } },   // 银人心
	{ 类型: "狩猎", 代码: 4000394, 要求: { 最小: 300, 最大: 1000 } },   // 白虎尾巴
	{ 类型: "狩猎", 代码: 4000444, 要求: { 最小: 300, 最大: 1000 } },   // 绿色衣襟
	{ 类型: "狩猎", 代码: 4000447, 要求: { 最小: 300, 最大: 1000 } },   // 绿色头盔
	{ 类型: "狩猎", 代码: 4000449, 要求: { 最小: 300, 最大: 1000 } },   // 蓝色衣襟
	{ 类型: "狩猎", 代码: 4000452, 要求: { 最小: 300, 最大: 1000 } },   // 蓝色头盔
	{ 类型: "狩猎", 代码: 4000454, 要求: { 最小: 300, 最大: 1000 } },   // 红色衣襟
	{ 类型: "狩猎", 代码: 4000457, 要求: { 最小: 300, 最大: 1000 } },   // 红色头盔
	{ 类型: "狩猎", 代码: 4001006, 要求: { 最小: 300, 最大: 1000 } },   // 火焰羽毛
	{ 类型: "狩猎", 代码: 4000082, 要求: { 最小: 300, 最大: 1000 } },   // 金牙
	{ 类型: "狩猎", 代码: 4000436, 要求: { 最小: 300, 最大: 1000 } },   // 烧杯
	{ 类型: "狩猎", 代码: 4000054, 要求: { 最小: 300, 最大: 1000 } },   // 白角齿
	{ 类型: "狩猎", 代码: 4000053, 要求: { 最小: 300, 最大: 1000 } },   // 黑角齿
//	{ 类型: "挖矿", 代码: 4004000, 要求: { 最小: 100, 最大: 1000 } },
//	{ 类型: "挖矿", 代码: 4004001, 要求: { 最小: 100, 最大: 1000 } },
//	{ 类型: "挖矿", 代码: 4004002, 要求: { 最小: 100, 最大: 1000 } },
//	{ 类型: "挖矿", 代码: 4004003, 要求: { 最小: 100, 最大: 1000 } },
//	{ 类型: "挖矿", 代码: 4004004, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010000, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010001, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010002, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010003, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010004, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010005, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4010006, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020000, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020001, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020002, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020003, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020004, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020005, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020006, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020007, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "挖矿", 代码: 4020008, 要求: { 最小: 100, 最大: 1000 } },
	{ 类型: "锻造", 代码: 1302030, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1332025, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1382012, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1412011, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1422014, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1432012, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1442024, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1452022, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1462019, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1472032, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1482020, 要求: { 最小: 1, 最大: 1 } },
	{ 类型: "锻造", 代码: 1492020, 要求: { 最小: 1, 最大: 1 } },
]

function Random(min, max) {
	var randoms = Math.floor(Math.random() * (max + 1 - min) + min);
	return randoms;
}

function 生成任务() {
	var random = Math.floor(Math.random() * 每日任务材料.length);
	var que = 每日任务材料[random];
	修改配置("任务材料", que.代码);
	修改配置("材料数量", Random(que.要求.最小, que.要求.最大));
	修改配置("任务类型", que.类型);
}

var 功能列表 = [
	{
		坐标: 2147000001, 核心界面: "双倍购买", 修改: "核心界面",
		内容列表: [
			{ 代码: 5210002, 货币: "点券", 价格: 100, 时限: 3, 限制: 2, 记录: "点券双倍" },
			{ 代码: 5210002, 货币: "抵用", 价格: 200, 时限: 3, 限制: 2, 记录: "抵用双倍" },
			{ 代码: 5360015, 货币: "点券", 价格: 200, 时限: 2, 限制: 2, 记录: "点券双爆" },
			{ 代码: 5360015, 货币: "抵用", 价格: 400, 时限: 2, 限制: 2, 记录: "抵用双爆" },
		]
	},
	{
		坐标: 2147000002, 核心界面: "在线奖励", 修改: "核心界面",
		内容列表: [
			{
				时间: 60, 点券: 0, 抵用: 100, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4321010, 数量: 50 },//时装星星
					{ 代码: 3605006, 数量: 2 },//女神的赐福
				]
			},
			{
				时间: 120, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4321010, 数量: 100 },//时装星星
					{ 代码: 3605006, 数量: 3 },//女神的赐福
				]
			},
			{
				时间: 180, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4321010, 数量: 200 },//时装星星
					{ 代码: 3605006, 数量: 4 },//女神的赐福
				]
			},
			{
				时间: 240, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4321010, 数量: 300 },//时装星星
					{ 代码: 3605006, 数量: 5 }, //女神的赐福
				]
			},
			{
				时间: 360, 点券: 400, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4321010, 数量: 500 },//时装星星
					{ 代码: 3605006, 数量: 10 }, //女神的赐福

				]
			},
		]
	},
	{
		坐标: 2147000003, 核心界面: "每日任务", 修改: "核心界面",
	},
	{
		坐标: 2147000004, 核心界面: "每日副本", 修改: "核心界面",
		内容列表: [
			{
				记录: "废弃组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 2022699, 数量: 3 },
					{ 代码: 4170016, 数量: 1 },
				]
			},
			{
				记录: "玩具组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4170016, 数量: 1 },
				]
			},
			{
				记录: "女神组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4170016, 数量: 1 },
				]
			},
			{
				记录: "毒雾组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4170016, 数量: 1 },
				]
			},
			/*{
				记录: "男女组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4170016, 数量: 5 },
				]
			},*/
			{
				记录: "海盗组队副本", 要求: 6, 点券: 200, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 4170016, 数量: 1 },
				]
			},
			{
				记录: "统计完成副本", 要求: 5, 点券: 500, 抵用: 0, 金币: 0, 经验: 0, 限制: 1,
				奖励: [
					{ 代码: 2022699, 数量: 3 },
					{ 代码: 4321010, 数量: 300 },
					{ 代码: 2022309, 数量: 50 },
				]
			},
		]
	},
]

var 配置, Arr1, 选择, 双倍, 在线, 副本, 筛选;
function start() {
	status = -1;
	action(1, 0, 0);
}

/*
cm.getPlayer().getAccYjLog("名字");//角色
cm.getPlayer().getAccYjLog("名字",true);//账号

cm.getPlayer().setAccYjLog("名字",次数);//永久LOG
cm.getPlayer().setBossLog("名字",次数);//每日LOG
*/

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1) {
			status++;
		} else {
			status--;
		}
		if (status == 0) {
			//cm.getPlayer().setBossLog("废弃组队副本", 3);//每日LOG
			配置 = 读取配置();
			if (cm.getPlayer().getBossLog("每日任务清理") ) {
				修改配置("任务材料", 0); 修改配置("任务类型", ""); 修改配置("材料数量", 0); 修改配置("任务状态", 0); 修改配置("累计完成任务", 0);
				cm.getPlayer().setBossLog("每日任务清理", 1);//每日LOG
				配置 = 读取配置();
			}
			核心界面 = 配置["核心界面"];
			var text = "#d\r\n";
			text += "#k┏━#r冒险岛提示#k━━━━━━━━━━━━━━━━━━━┓\r\n";
			text += "\t#d" + 广播 + " 欢迎来到:[#r" + 功能名称 + "#d]\r\n";
			//text += "\t#d" + 广播 + " 捐赠进度会在每周日[#r23:59#d]分清空记录！\r\n";
			for (var i = 0; i < 功能列表.length; i++) {
				if (核心界面 == 功能列表[i].核心界面) {
					Arr1 = 功能列表[i];
					text += "#L" + 功能列表[i].坐标 + "##r" + 功能列表[i].核心界面 + "" + 关 + "#l";
				} else {
					text += "#L" + 功能列表[i].坐标 + "##b" + 功能列表[i].核心界面 + "" + 开 + "#l";
				}
			}
			text += "\r\n\r\n" + 分割线() + "\r\n";

			switch (核心界面) {
				case "双倍购买":
					if (选择 == null) {
						for (var i = 0; i < Arr1.内容列表.length; i++) {
							双倍 = Arr1.内容列表[i];
							var 记录 = cm.getPlayer().getBossLog(双倍.记录);
							var 记录提示 = "每日限制[#b" + 记录 + "#d/#r" + 双倍.限制 + "#d]";
							text += "#d#L" + i + "#" + xx + "花费:" + 双倍.价格 + "" + (双倍.货币 == "点券" ? "#r" : "#k") + "" + 双倍.货币 + "#d" + 箭头 + "购买#v" + 双倍.代码 + ":#[#b" + 双倍.时限 + "小时#d]" + 记录提示 + "" + xx + "#l\r\n";
						}
					} else {
						var 检测条件 = true;
						双倍 = Arr1.内容列表[选择];
						var 记录 = cm.getPlayer().getBossLog(双倍.记录);
						var 记录提示 = "每日限制[#b" + 记录 + "#d/#r" + 双倍.限制 + "#d]";
						if (判断费用(双倍.货币) < 双倍.价格) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":需要消费" + (双倍.货币 == "点券" ? "#r" : "#k") + "" + 双倍.货币 + "[#b" + 判断费用(双倍.货币) + "#d/#r" + 双倍.价格 + "#d]\r\n";
						} else if (记录 >= 双倍.限制) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":每日限制[#b" + 记录 + "#d/#r" + 双倍.限制 + "#d]\r\n";
						}
						text += "\t#d" + xx + "花费:" + 双倍.价格 + "" + (双倍.货币 == "点券" ? "#r" : "#k") + "" + 双倍.货币 + "#d" + 箭头 + "购买#v" + 双倍.代码 + ":#[#b" + 双倍.时限 + "小时#d]" + 记录提示 + "" + xx + "\r\n\r\n";
						if (检测条件 == true) {
							text += "\t\t\t\t\t\t\t 是否要购买呢？\r\n";
							text += "\t\t\t\t\t\t";
							text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
							text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l";
						} else {
							text += "\r\n\t\t\t\t\t\t\t\t#d" + 感叹 + ":[#r条件不满足#d]";
						}
					}
					break;
				case "在线奖励":
					text += "  ";
					var 检测条件 = true;
					for (var i = 0; i < Arr1.内容列表.length; i++) {
						var is = Arr1.内容列表[i];
						var 领取的记录 = cm.getPlayer().getBossLog("在线时间" + is.时间);
						if (选择 == i) {
							在线 = Arr1.内容列表[选择];
							if (领取的记录 == 0) {
								text += "#L" + i + "##r" + 美化(3, "" + is.时间, true) + "分钟奖励#d" + 关 + "#l";
							} else {
								text += "#L" + i + "##k" + 美化(3, "" + is.时间, true) + "分钟奖励#d" + 关 + "#l";
							}
						} else {
							if (领取的记录 == 0) {
								text += "#L" + i + "##b" + 美化(3, "" + is.时间, true) + "分钟奖励#d" + 开 + "#l";
							} else {
								text += "#L" + i + "##k" + 美化(3, "" + is.时间, true) + "分钟奖励#d" + 关 + "#l";
							}
						}
						if ((i + 1) % 3 == 0) {
							text += "\r\n  ";
						}
					}
					if (在线 != null) {
						text += "\r\n\r\n" + 分割线() + "\r\n";
						text += "\t#d" + 广播 + ":要求在线时间：#r" + 在线.时间 + "#d (#b当前在线时长:#r" + cm.getPlayer().getTodayOnlineTime() + "#d)\r\n";
						var 记录 = cm.getPlayer().getBossLog("在线时间" + 在线.时间);
						if (cm.getPlayer().getTodayOnlineTime() < 在线.时间) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":在线时间不足[#b" + cm.getPlayer().getTodayOnlineTime() + "#d/#r" + 在线.时间 + "#d]\r\n";
						} else if (记录 >= 在线.限制) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":每日领取次数[#b" + 记录 + "#d/#r" + 在线.限制 + "#d]\r\n";
						}
						var 空间 = 判断背包空间_素组(在线.奖励);
						if (空间.bool == false) {
							检测条件 = false;
							text += "" + 空间.text;
						}
						text += "" + 呈现奖励货币("点券", 在线.点券) + "";
						text += "" + 呈现奖励货币("抵用", 在线.抵用) + "";
						text += "" + 呈现奖励货币("金币", 在线.金币) + "";
						text += "" + 呈现奖励货币("经验", 在线.经验) + "";
						if (在线.奖励.length != 0) {
							text += "  " + 无条件 + "\r\n";
							for (var j = 0; j < 在线.奖励.length; j++) {
								text += "\t#v" + 在线.奖励[j].代码 + ":##z" + 在线.奖励[j].代码 + "# x " + 在线.奖励[j].数量 + "个\r\n";
							}
							text += "\r\n\r\n";
						}
						if (检测条件 == true) {
							text += "\t\t\t\t\t\t\t 是否要领取呢？\r\n";
							text += "\t\t\t\t\t\t";
							text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
							text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l";
						} else {
							if (记录 == 0) {
								text += "\r\n\t\t\t\t\t\t\t\t#d" + 感叹 + ":[#r条件不满足#d]";
							} else {
								text += "\r\n\t\t\t\t\t\t\t\t#d" + 感叹 + ":[#r已领取过了#d]";
							}
						}
					}
					break;
				case "每日任务":
					if (配置["任务状态"] == 0 || 配置["任务状态"] == null) {
						text += "\t\t\t\t是否要开启每日任务呢？\r\n";
						text += "\t\t\t\t\t\t";
						text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
						text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l";
					} else {
						var 完成 = 配置["累计完成任务"];
						var 上限 = 任务.阶段奖励.length;
						//var 进度 = 完成 / 上限 * 100;
						var 进度 = cm.getPlayer().getBossLog(任务.记录) / 上限 * 100;
						var 检测条件 = true;
						if (cm.getPlayer().getBossLog(任务.记录) < 上限) {
							筛选 = 任务.阶段奖励[完成];
							var 材料 = 配置["任务材料"];
							var 数量 = 配置["材料数量"];
							var 持有 = 物品数量(材料);
							//text += "\t#d" + 广播 + ":每日任务完成进度#B" + 进度 + "#[#b" + 完成 + "#d/#r" + 上限 + "#d]\r\n";
							text += "\t#d" + 广播 + ":每日任务完成进度#B" + 进度 + "#[#b" + cm.getPlayer().getBossLog(任务.记录) + "#d/#r" + 上限 + "#d]\r\n";
							text += "\t#d" + 广播 + ":完成所有任务可额外获得奖励:#v" + 任务.额外奖励 + ":# x " + 任务.数量 + "个\r\n";
							text += "\t#d" + 广播 + ":任务会随机生成类型，必须按照要求进行完成！\r\n";
							text += "\t#d" + 广播 + ":每次" + xx + "#r重置#d" + xx + "需要消耗200抵用券！\r\n";
							text += "" + 分割线() + "\r\n";
							text += "\t#d" + 广播 + ":本次任务：类型[#r" + 配置["任务类型"] + "#d]\r\n";
							if (持有 < 数量) {
								检测条件 = false;
								进度提示 = "[#k" + 持有 + "#d / #r" + 数量 + "#d](#g进行中#d)";
							} else {
								进度提示 = "[#k" + 持有 + "#d / #r" + 数量 + "#d](#r可完成#d)";
							}
							text += "\t#d" + 广播 + ":进度：#v" + 材料 + ":##b#z" + 材料 + "##d " + 进度提示 + "\r\n";
							text += " #L" + 交提 + "#" + xx + "#r交提#d" + xx + "#l#L" + 查询 + "#" + xx + "#r查询#d" + xx + "#l#L" + 重置 + "#" + xx + "#r重置#d" + xx + "#l#L" + 道具 + "#" + xx + "#r道具#d" + xx + "#l\r\n\r\n\r\n";
							text += "  " + 无条件 + "\r\n";
							//for (var j = 0; j < 每日奖励.length; j++) {
							text += "" + 呈现奖励货币("点券", 每日奖励[cm.getPlayer().getBossLog(任务.记录)][1]) + "";
							text += "" + 呈现奖励货币("抵用", 每日奖励[cm.getPlayer().getBossLog(任务.记录)][2]) + "";
							text += "" + 呈现奖励货币("金币", 每日奖励[cm.getPlayer().getBossLog(任务.记录)][3]) + "";
							text += "" + 呈现奖励货币("经验", Math.floor(每日奖励[cm.getPlayer().getBossLog(任务.记录)][4] * levelExp())) + "";
							text += "\t#v" + 每日奖励[cm.getPlayer().getBossLog(任务.记录)][5] + ":##z" + 每日奖励[cm.getPlayer().getBossLog(任务.记录)][5] + "# x " + 每日奖励[cm.getPlayer().getBossLog(任务.记录)][6] + "个\r\n";
							/*for (var j = 0; j < 筛选.奖励物品.length; j++) {
								text += "\t#v" + 筛选.奖励物品[j].代码 + ":##z" + 筛选.奖励物品[j].代码 + "# x " + 筛选.奖励物品[j].数量 + "个\r\n";
							}*/
							//}
							text += "  " + 几率获 + " \r\n";
							//text += "\t？？[#r神秘物品、下等or中等or高等五彩水晶#d]\r\n";
							text += "\t \t #v1122174:# #v1032121:# #v1082401:# #v1042231:# #v1062148:# #v1072618:# \r\n";
						} else {
							if (cm.getPlayer().getBossLog(任务.记录.特殊奖励) == 0) {
								var 判断背包 = 判断背包空间_单个(任务.额外奖励);
								if (判断背包.bool == true) {
									text += "\t#d" + 广播 + ":每日任务完成进度#B" + 进度 + "#[#b" + cm.getPlayer().getBossLog(任务.记录) + "#d/#r" + 上限 + "#d]\r\n";
									text += "\t#d" + 广播 + ":完成所有任务可额外获得奖励:#v" + 任务.额外奖励 + ":# x " + 任务.数量 + "个\r\n";
									text += "\t\t\t\t\t\t\t 是否要领取呢？\r\n";
									text += "\t\t\t\t\t\t";
									text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
									text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l";
								} else {
									text += 判断背包.text;
								}
							} else {
								text += "\r\n\t#d" + 广播 + ":今天的任务已经全部完成了哦！[#b" + cm.getPlayer().getBossLog(任务.记录) + "#d/#r" + 上限 + "#d]\r\n";
							}
						}
					}
					break;
				case "每日副本":
					text += "";
					for (var i = 0; i < Arr1.内容列表.length; i++) {
						var is = Arr1.内容列表[i];
						var 记录 = cm.getPlayer().getBossLog(is.记录);
						var 领取的记录 = cm.getPlayer().getBossLog("每日副本" + is.记录);
						if (选择 == i) {
							副本 = Arr1.内容列表[选择];
							if (领取的记录 == 0) {
								text += "#L" + i + "##r" + is.记录 + "[" + 美化(2, "" + 记录, false) + "/" + 美化(2, "" + is.要求, false) + "]次#d" + 关 + "#l";
							} else {
								text += "#L" + i + "##k" + is.记录 + "[完 成]次#d" + 关 + "#l";
							}
						} else {
							if (领取的记录 == 0) {
								text += "#L" + i + "##b" + is.记录 + "[" + 美化(2, "" + 记录, false) + "/" + 美化(2, "" + is.要求, false) + "]次#d" + 开 + "#l";
							} else {
								text += "#L" + i + "##k" + is.记录 + "[完 成]次#d" + 关 + "#l";
							}
						}
						if ((i + 1) % 2 == 0) {
							text += "\r\n";
						}
					}
					if (副本 != null) {
						text += "\r\n\r\n" + 分割线() + "\r\n";
						var 完成记录 = cm.getPlayer().getBossLog(副本.记录);
						text += "\t#d" + 广播 + ":要求完成次数：#r" + 副本.要求 + "#d次 (#b当前已完成:#r" + 完成记录 + "#d次)\r\n";
						var 检测条件 = true;
						var 领取记录 = cm.getPlayer().getBossLog("每日副本" + 副本.记录);
						if (完成记录 < 副本.要求) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":完成次数不足：[#b" + 完成记录 + "#d/#r" + 副本.要求 + "#d]\r\n";
						} else if (领取记录 >= 副本.限制) {
							检测条件 = false;
							text += "\t#d" + 感叹 + ":每日领取次数[#b" + 领取记录 + "#d/#r" + 副本.限制 + "#d]\r\n";
						}
						var 空间 = 判断背包空间_素组(副本.奖励);
						if (空间.bool == false) {
							检测条件 = false;
							text += "" + 空间.text;
						}
						text += "" + 呈现奖励货币("点券", 副本.点券) + "";
						text += "" + 呈现奖励货币("抵用", 副本.抵用) + "";
						text += "" + 呈现奖励货币("金币", 副本.金币) + "";
						text += "" + 呈现奖励货币("经验", 副本.经验) + "";
						if (副本.奖励.length != 0) {
							text += "  " + 无条件 + "\r\n";
							for (var j = 0; j < 副本.奖励.length; j++) {
								text += "\t#v" + 副本.奖励[j].代码 + ":##z" + 副本.奖励[j].代码 + "# x " + 副本.奖励[j].数量 + "个\r\n";
							}
							text += "\r\n\r\n";
						}
						if (检测条件 == true) {
							text += "\t\t\t\t\t\t\t 是否要领取呢？\r\n";
							text += "\t\t\t\t\t\t";
							text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
							text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l";
						} else {
							if (领取记录 == 0) {
								text += "\r\n\t\t\t\t\t\t\t\t#d" + 感叹 + ":[#r条件不满足#d]";
							} else {
								text += "\r\n\t\t\t\t\t\t\t\t#d" + 感叹 + ":[#r已领取过了#d]";
							}
						}
					}
					break;
				default:
					break;
			}
			text += "\r\n\r\n#k┗━━━━━━━━━━━━━━━━━━━━━━━━━┛#d\r\n";
			cm.sendYesNo(text);
		} else if (status == 1) {
			sele1 = selection;
			for (var i = 0; i < 功能列表.length; i++) {
				if (sele1 == 功能列表[i].坐标) {
					if(cm.getPlayer().getLevel() < 30 && 功能列表[i].核心界面 == "每日任务"){
						修改配置(功能列表[i].修改, "");
						cm.sendOk("#e#d该功能必须达到30级以上才能开启！");
						status = -1;
						return;
					}
					修改配置(功能列表[i].修改, 功能列表[i].核心界面);
					选择 = null;
					在线 = null;
					副本 = null;
					start();
					return;
				}
			}
			switch (核心界面) {
				case "双倍购买":
					if (选择 == null) {
						选择 = sele1;
					} else {
						选择 = null;
						if (sele1 == 是) {
							更改费用(双倍.货币, -双倍.价格);
							cm.getPlayer().setBossLog(双倍.记录, 1);//每日LOG
							cm.gainItem(双倍.代码, 1, 双倍.时限,true);//
							cm.getPlayer().dropMessage(6, "购买完成！");
						}
					}
					start();
					return;
				case "在线奖励":
					for (var i = 0; i < Arr1.内容列表.length; i++) {
						if (sele1 == i) {
							选择 = sele1;
							break;
						}
					}
					if (sele1 == 是) {
						更改呈现奖励("点券", +在线.点券);
						更改呈现奖励("抵用", +在线.抵用);
						更改呈现奖励("金币", +在线.金币);
						更改呈现奖励("经验", +在线.经验);
						cm.getPlayer().setBossLog("在线时间" + 在线.时间,1);//每日LOG
						if (在线.奖励.length != 0) {
							for (var j = 0; j < 在线.奖励.length; j++) {
								cm.gainItem(在线.奖励[j].代码, 在线.奖励[j].数量);
							}
						}
						cm.getPlayer().dropMessage(6, "在线[" + 在线.时间 + "]分钟，奖励领取完毕！");
					} else if (sele1 == 否) {
						在线 = null;
						选择 = null;
					}
					start();
					return;
				case "每日任务":
					switch (sele1) {
						case 是:
							if (配置["任务状态"] == 0 || 配置["任务状态"] == null) {
								修改配置("任务状态", 1); 生成任务(); start(); return;
							} else {
								cm.gainItem(任务.额外奖励, 任务.数量);
								cm.getPlayer().setBossLog(任务.记录.特殊奖励,1) 
								cm.sendOk("#e#d恭喜您，完成了今天的所有任务咯！"); status = -1; return;
							}
						case 交提:
							if (物品数量(配置["任务材料"]) < 配置["材料数量"]) {
								cm.sendOk("#e#d任务还在#g进行中#d，请看好您的进度！"); status = -1; return;
							} else if (判断背包空间_素组(每日奖励[cm.getPlayer().getBossLog(任务.记录)][5]).bool == false) {
								cm.sendOk(判断背包空间_素组(每日奖励[cm.getPlayer().getBossLog(任务.记录)][5]).text); status = -1; return;
							} else {
								var itemArr = new Array();
								cm.gainItem(配置["任务材料"], -配置["材料数量"]);
								更改呈现奖励("点券", +每日奖励[cm.getPlayer().getBossLog(任务.记录)][1]);
								更改呈现奖励("抵用", +每日奖励[cm.getPlayer().getBossLog(任务.记录)][2]);
								更改呈现奖励("金币", +每日奖励[cm.getPlayer().getBossLog(任务.记录)][3]);
								更改呈现奖励("经验", +Math.floor(每日奖励[cm.getPlayer().getBossLog(任务.记录)][4] * levelExp()));
									cm.gainItem(每日奖励[cm.getPlayer().getBossLog(任务.记录)][5], 每日奖励[cm.getPlayer().getBossLog(任务.记录)][6]);
								var random = Math.floor(Math.random() * 100) + 1;
								for (var i = 0; i < 任务.神秘奖励.length; i++) {
									if (random <= 任务.神秘奖励[i].概率) {
										itemArr.push(任务.神秘奖励[i]);
									}
								}
								if (itemArr.length != 0) {
									var sj = Math.floor(Math.random() * itemArr.length);
									cm.gainItem(itemArr[sj].代码, itemArr[sj].数量);
									//cm.道具喇叭(itemArr[sj].代码, " 每日任务中意外获得~",1,1);
								}
								//修改配置("累计完成任务", 配置["累计完成任务"] + 1);
								cm.getPlayer().setBossLog(任务.记录,1);
								生成任务(); start(); return;
							}
						case 查询:
							cm.sendOk(掉落查询(配置["任务材料"])); status = -1; return;
						case 重置:
							if (判断费用("抵用") < 200) {
								cm.sendOk("#e#d您没有抵用卷可以重置任务呢！"); status = -1; return;
							} else {
								更改费用("抵用", -200);
								生成任务(); start(); return;
							}
						case 道具:
							var text = "#d";
							for (var i = 0; i < 每日任务材料.length; i++) {
								text += "类型:[#r" + 每日任务材料[i].类型 + "#d] 道具:#v" + 每日任务材料[i].代码 + ":##z" + 每日任务材料[i].代码 + "#\r\n";
							}
							cm.sendOk(text); status = -1; return;
						default:
							break;
					}
					break;
				case "每日副本":
					for (var i = 0; i < Arr1.内容列表.length; i++) {
						if (sele1 == i) {
							选择 = sele1;
							break;
						}
					}
					if (sele1 == 是) {
						更改呈现奖励("点券", +副本.点券);
						更改呈现奖励("抵用", +副本.抵用);
						更改呈现奖励("金币", +副本.金币);
						更改呈现奖励("经验", +副本.经验);
						cm.getPlayer().setBossLog("每日副本" + 副本.记录,1);//每日LOG
						cm.getPlayer().setBossLog("统计完成副本",+副本.要求);//每日LOG
						if (副本.奖励.length != 0) {
							for (var j = 0; j < 副本.奖励.length; j++) {
								cm.gainItem(副本.奖励[j].代码, 副本.奖励[j].数量);
							}
						}
						cm.getPlayer().dropMessage(6, "恭喜您，完成了每日副本 " + 副本.记录 + " " + 副本.要求 + "次。 奖励领取完毕！");
					} else if (sele1 == 否) {
						副本 = null;
						选择 = null;
					}
					start();
					return;
					break;
				default:
					break;
			}
		}
	}
}

/*
switch (sele1) {
	case 返回:
		break;
	default:
		break;
}
*/

function 掉落查询(itemid) {
	var text = "";
	var con = cm.getConnection();
	var ps = con.prepareStatement("select * from drop_data where itemid = " + itemid + "");
	var rs = ps.executeQuery();
	while (rs.next()) {
		text += "掉落：#v" + rs.getInt("itemid") + "# - 怪物：#b#o" + rs.getInt("dropperid") + "##k - 爆率：#r" + rs.getInt("chance") / 10000 + "%#k\r\n";
	}
	rs.close();
	ps.close();
	con.close();
	return text
}

function 判断费用(type) {
	var ret;
	if (type == "金币") {
		ret = cm.getMeso();
	} else if (type == "点券") {
		ret = cm.getPlayer().getCSPoints(1);
	} else if (type == "抵用") {
		ret = cm.getPlayer().getCSPoints(2);
	}
	return ret;
}

function 更改费用(type, num) {
	if (type == "金币") {
		cm.gainMeso(num);
	} else if (type == "点券") {
		cm.gainNX(num);
	} else if (type == "抵用") {
		cm.gainDY(num);
	}
}

function 读取核心内容(核心界面) {//
	for (var i = 0; i < 功能列表.length; i++) {
		if (核心界面 == 功能列表[i].核心界面) {

		}
	}
}

function 修改配置(栏位, 修改) {//
	var 转换格式 = 字符串转换为组(修改)[0];
	var bool = true; if (转换格式 >= 0 && 转换格式 <= 9) { bool = false; };
	var 角色ID = cm.getPlayer().getId();
	sqlMultiPurpose("UPDATE 泉哥_每日需要 SET " + 栏位 + " = " + (bool == true ? "'" + 修改 + "'" : "" + 修改 + "") + " WHERE 角色ID = " + 角色ID + "");
}

function 读取配置() {//
	var 角色ID = cm.getPlayer().getId();
	var ret = sqlSelect("SELECT * FROM 泉哥_每日需要 WHERE 角色ID = " + 角色ID + "");
	if (ret.length == 0) {
		sqlMultiPurpose("INSERT INTO 泉哥_每日需要 (角色ID, 核心界面, 任务类型) values (" + 角色ID + ",'','')");
		var ret = sqlSelect("SELECT * FROM 泉哥_每日需要 WHERE 角色ID = " + 角色ID + "");
	}
	return ret[0];
}

function 字符串转换为组(str) {
	var tempString = str.toString().split("");
	return tempString;
}

function 提取字符串数值(str) {
	var num = str.replace(/[^0-9]/ig, "");//提取字符串中的数值  返回 = 字符串数值(较为精准)
	var num = str.match(/\d+(.\d+)?/g);//提取字符串中的数值  返回 = 字符串数值(不太精准)
	return num;
}

function 判断背包空间_素组(list) {
	var text = "#d";
	var 检测背包 = true;
	var k1 = 0; var k2 = 0; var k3 = 0; var k4 = 0; var k5 = 0;
	for (var i = 0; i < list.length; i++) {
		var is = list[i];
		if (is.代码 >= 1000000 && is.代码 <= 1999999) { k1++; };
		if (is.代码 >= 2000000 && is.代码 <= 2999999) { k2++; };
		if (is.代码 >= 3000000 && is.代码 <= 3999999) { k3++; };
		if (is.代码 >= 2022509 && is.代码 <= 4999999) { k4++; };
		if (is.代码 >= 5000000 && is.代码 <= 5999999) { k5++; };
	}
	var 装备栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.EQUIP).getNumFreeSlot();
	var 消耗栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.USE).getNumFreeSlot();
	var 设置栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.SETUP).getNumFreeSlot();
	var 其他栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.ETC).getNumFreeSlot();
	var 现金栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.CASH).getNumFreeSlot();
	if (装备栏空位 < k1) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r装备#d栏有 #r" + k1 + "#d 个空间以上！\r\n"; };
	if (消耗栏空位 < k2) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r消耗#d栏有 #r" + k2 + "#d 个空间以上！\r\n"; };
	if (设置栏空位 < k3) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r设置#d栏有 #r" + k3 + "#d 个空间以上！\r\n"; };
	if (其他栏空位 < k4) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r其他#d栏有 #r" + k4 + "#d 个空间以上！\r\n"; };
	if (现金栏空位 < k5) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r现金#d栏有 #r" + k5 + "#d 个空间以上！\r\n"; };
	return ret = { bool: 检测背包, text: text };
}

/*var 判断背包 = 判断背包空间_单个(ii.物品);
if (判断背包.bool == false) {
	判断背包.text;
	cm.dispose();
	return;
}*/

function 物品数量(itemid) {
	return cm.getPlayer().getItemQuantity(itemid, false);
}

function 判断背包空间_单个(itemid) {
	var text = "#d";
	var 检测背包 = true;
	var k1 = 0; var k2 = 0; var k3 = 0; var k4 = 0; var k5 = 0;
	if (itemid >= 1000000 && itemid <= 1999999) { k1++; };
	if (itemid >= 2000000 && itemid <= 2999999) { k2++; };
	if (itemid >= 3000000 && itemid <= 3999999) { k3++; };
	if (itemid >= 2022509 && itemid <= 4999999) { k4++; };
	if (itemid >= 5000000 && itemid <= 5999999) { k5++; };
	var 装备栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.EQUIP).getNumFreeSlot();
	var 消耗栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.USE).getNumFreeSlot();
	var 设置栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.SETUP).getNumFreeSlot();
	var 其他栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.ETC).getNumFreeSlot();
	var 现金栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.CASH).getNumFreeSlot();
	if (装备栏空位 < k1) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r装备#d栏有 #r" + k1 + "#d 个空间以上！\r\n"; };
	if (消耗栏空位 < k2) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r消耗#d栏有 #r" + k2 + "#d 个空间以上！\r\n"; };
	if (设置栏空位 < k3) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r设置#d栏有 #r" + k3 + "#d 个空间以上！\r\n"; };
	if (其他栏空位 < k4) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r其他#d栏有 #r" + k4 + "#d 个空间以上！\r\n"; };
	if (现金栏空位 < k5) { 检测背包 = false; text += "\t#d" + 感叹 + ":请确保#r现金#d栏有 #r" + k5 + "#d 个空间以上！\r\n"; };
	return ret = { bool: 检测背包, text: text };
}

function sqlSelect(sql) {
	var con = cm.getConnection();
	var ret = new Array();
	var ps = con.prepareStatement(sql);
	var rs = ps.executeQuery();
	var metaData = ps.getMetaData();
	while (rs.next()) {
		var rsdata = new java.util.HashMap();
		for (var j = 1; j <= metaData.getColumnCount(); j++) {
			columnLabel = metaData.getColumnLabel(j);
			rsdata.put(columnLabel, rs.getObject(columnLabel));
		}
		if (!rsdata.isEmpty()) {
			ret.push(rsdata);
		}
	}
	rs.close();
	ps.close();
	con.close();
	return ret;
}

function sqlMultiPurpose(sql) {//
	var con = cm.getConnection();
	var ps = con.prepareStatement(sql);
	ret = ps.executeUpdate();
	ps.close();
	con.close();
	return ret;
}



function 分割线() {
	var text = " ";
	var list = [
		//"#fEffect/CharacterEff.img/1022223/7/0#",
		//"#fEffect/CharacterEff.img/1022223/8/0#",
		"#fEffect/CharacterEff.img/1022223/9/0#",
	];
	for (var i = 0; i < 24; i++) {
		var random = Math.floor(Math.random() * list.length);
		text += list[random];
	}
	text += " ";
	return text;
}

function 美化(length, content, bool) {
	var str = "";
	var cs = "";
	if (content.length > length) {
		str = content;
	} else {
		for (var j = 0; j < length - content.getBytes("GB2312").length; j++) {
			cs += " ";
		}
	}
	if (bool == true) {
		str = content + cs;
	} else {
		str = cs + content;
	}
	return str;
}

function 更改呈现奖励(类型, 数量) {
	switch (类型) {
		case "点券":
			if (数量 != 0 && 数量 != null) { cm.gainNX(数量) };
			break;
		case "抵用":
			if (数量 != 0 && 数量 != null) { cm.gainDY(数量) };
			break;
		case "金币":
			if (数量 != 0 && 数量 != null) { cm.gainMeso(数量) };
			break;
		case "经验":
			if (数量 != 0 && 数量 != null) { cm.gainExp(数量) };
			break;
		default:
			break;
	}
}

function 呈现奖励货币(类型, 数量) {
	var 章鱼 = "#fUI/UIWindow/Minigame/Omok/stone/3/white/0#";
	var 蘑菇 = "#fUI/UIWindow/Minigame/Omok/stone/0/black/0#";
	var 绿水 = "#fUI/UIWindow/Minigame/Omok/stone/1/white/0#";
	var 猪猪 = "#fUI/UIWindow/Minigame/Omok/stone/2/black/0#";
	var text = "";
	switch (类型) {
		case "点券":
			text += (数量 != 0 && 数量 != null ? "\t" + 章鱼 + "奖励: #r" + 数量 + "#d点券\r\n" : "");
			break;
		case "抵用":
			text += (数量 != 0 && 数量 != null ? "\t" + 蘑菇 + "奖励: #r" + 数量 + "#d抵用\r\n" : "");
			break;
		case "金币":
			text += (数量 != 0 && 数量 != null ? "\t" + 绿水 + "奖励: #r" + 数量 + "#d金币\r\n" : "");
			break;
		case "经验":
			text += (数量 != 0 && 数量 != null ? "\t" + 猪猪 + "奖励: #r" + 数量 + "#d经验\r\n" : "");
			break;
		default:
			break;
	}
	return text;
}

function levelExp() {
	var exp = 0;
	var lvexp = [//你把所有等级要求的经验都填上去，看得懂吗 升级 看最大值 嗯 1-255 都填上去
		{ lv: 1, exp: 15 },
		{ lv: 2, exp: 34 },
		{ lv: 3, exp: 57 },
		{ lv: 4, exp: 92 },
		{ lv: 5, exp: 135 },
		{ lv: 6, exp: 372 },
		{ lv: 7, exp: 560 },
		{ lv: 8, exp: 840 },
		{ lv: 9, exp: 1242 },
		{ lv: 10, exp: 1716 },
		{ lv: 11, exp: 2360 },
		{ lv: 12, exp: 3216 },
		{ lv: 13, exp: 4200 },
		{ lv: 14, exp: 5460 },
		{ lv: 15, exp: 7050 },
		{ lv: 16, exp: 8840 },
		{ lv: 17, exp: 11040 },
		{ lv: 18, exp: 13716 },
		{ lv: 19, exp: 16680 },
		{ lv: 20, exp: 20216 },
		{ lv: 21, exp: 24402 },
		{ lv: 22, exp: 28980 },
		{ lv: 23, exp: 34320 },
		{ lv: 24, exp: 40512 },
		{ lv: 25, exp: 47216 },
		{ lv: 26, exp: 54900 },
		{ lv: 27, exp: 63666 },
		{ lv: 28, exp: 73080 },
		{ lv: 29, exp: 83720 },
		{ lv: 30, exp: 95700 },
		{ lv: 31, exp: 108480 },
		{ lv: 32, exp: 122760 },
		{ lv: 33, exp: 138666 },
		{ lv: 34, exp: 155540 },
		{ lv: 35, exp: 174216 },
		{ lv: 36, exp: 194832 },
		{ lv: 37, exp: 216600 },
		{ lv: 38, exp: 240500 },
		{ lv: 39, exp: 266682 },
		{ lv: 40, exp: 294216 },
		{ lv: 41, exp: 324240 },
		{ lv: 42, exp: 356916 },
		{ lv: 43, exp: 391160 },
		{ lv: 44, exp: 428280 },
		{ lv: 45, exp: 468450 },
		{ lv: 46, exp: 510420 },
		{ lv: 47, exp: 555680 },
		{ lv: 48, exp: 604416 },
		{ lv: 49, exp: 655200 },
		{ lv: 50, exp: 709716 },
		{ lv: 51, exp: 748608 },
		{ lv: 52, exp: 789631 },
		{ lv: 53, exp: 832902 },
		{ lv: 54, exp: 878545 },
		{ lv: 55, exp: 926689 },
		{ lv: 56, exp: 977471 },
		{ lv: 57, exp: 1031036 },
		{ lv: 58, exp: 1087536 },
		{ lv: 59, exp: 1147132 },
		{ lv: 60, exp: 1209994 },
		{ lv: 61, exp: 1276301 },
		{ lv: 62, exp: 1346242 },
		{ lv: 63, exp: 1420016 },
		{ lv: 64, exp: 1497832 },
		{ lv: 65, exp: 1579931 },
		{ lv: 66, exp: 1666492 },
		{ lv: 67, exp: 1757815 },
		{ lv: 68, exp: 1854143 },
		{ lv: 69, exp: 1955750 },
		{ lv: 70, exp: 2062925 },
		{ lv: 71, exp: 2175973 },
		{ lv: 72, exp: 2295216 },
		{ lv: 73, exp: 2420993 },
		{ lv: 74, exp: 2553663 },
		{ lv: 75, exp: 2693603 },
		{ lv: 76, exp: 2841212 },
		{ lv: 77, exp: 2996910 },
		{ lv: 78, exp: 3161140 },
		{ lv: 79, exp: 3334370 },
		{ lv: 80, exp: 3517093 },
		{ lv: 81, exp: 3709829 },
		{ lv: 82, exp: 3913127 },
		{ lv: 83, exp: 4127566 },
		{ lv: 84, exp: 4353756 },
		{ lv: 85, exp: 4592341 },
		{ lv: 86, exp: 4844001 },
		{ lv: 87, exp: 5109452 },
		{ lv: 88, exp: 5389449 },
		{ lv: 89, exp: 5684790 },
		{ lv: 90, exp: 5996316 },
		{ lv: 91, exp: 6324914 },
		{ lv: 92, exp: 6671519 },
		{ lv: 93, exp: 7037118 },
		{ lv: 94, exp: 7422752 },
		{ lv: 95, exp: 7829518 },
		{ lv: 96, exp: 8258575 },
		{ lv: 97, exp: 8711144 },
		{ lv: 98, exp: 9188514 },
		{ lv: 99, exp: 9692044 },
		{ lv: 100, exp: 10223168 },
		{ lv: 101, exp: 10783397 },
		{ lv: 102, exp: 11374327 },
		{ lv: 103, exp: 11997640 },
		{ lv: 104, exp: 12655110 },
		{ lv: 105, exp: 13348610 },
		{ lv: 106, exp: 14080113 },
		{ lv: 107, exp: 14851703 },
		{ lv: 108, exp: 15665576 },
		{ lv: 109, exp: 16524049 },
		{ lv: 110, exp: 17429566 },
		{ lv: 111, exp: 18384706 },
		{ lv: 112, exp: 19392187 },
		{ lv: 113, exp: 20454878 },
		{ lv: 114, exp: 21575805 },
		{ lv: 115, exp: 22758159 },
		{ lv: 116, exp: 24005306 },
		{ lv: 117, exp: 25320796 },
		{ lv: 118, exp: 26708375 },
		{ lv: 119, exp: 28171993 },
		{ lv: 120, exp: 29715818 },
		{ lv: 121, exp: 31344244 },
		{ lv: 122, exp: 33061908 },
		{ lv: 123, exp: 34873700 },
		{ lv: 124, exp: 36784778 },
		{ lv: 125, exp: 38800583 },
		{ lv: 126, exp: 40926854 },
		{ lv: 127, exp: 43169645 },
		{ lv: 128, exp: 45535341 },
		{ lv: 129, exp: 48030677 },
		{ lv: 130, exp: 50662758 },
		{ lv: 131, exp: 53439077 },
		{ lv: 132, exp: 56367538 },
		{ lv: 133, exp: 59456479 },
		{ lv: 134, exp: 63174694 },
		{ lv: 135, exp: 66151459 },
		{ lv: 136, exp: 69776558 },
		{ lv: 137, exp: 73600313 },
		{ lv: 138, exp: 77633610 },
		{ lv: 139, exp: 81887931 },
		{ lv: 140, exp: 86375389 },
		{ lv: 141, exp: 91108760 },
		{ lv: 142, exp: 96101520 },
		{ lv: 143, exp: 101367883 },
		{ lv: 144, exp: 106922842 },
		{ lv: 145, exp: 112782213 },
		{ lv: 146, exp: 118962678 },
		{ lv: 147, exp: 125481832 },
		{ lv: 148, exp: 132358236 },
		{ lv: 149, exp: 139611467 },
		{ lv: 150, exp: 147262175 },
		{ lv: 151, exp: 155332142 },
		{ lv: 152, exp: 163844343 },
		{ lv: 153, exp: 172823012 },
		{ lv: 154, exp: 182293713 },
		{ lv: 155, exp: 192283408 },
		{ lv: 156, exp: 202820538 },
		{ lv: 157, exp: 213935103 },
		{ lv: 158, exp: 225658746 },
		{ lv: 159, exp: 238024845 },
		{ lv: 160, exp: 251068606 },
		{ lv: 161, exp: 264827165 },
		{ lv: 162, exp: 279339693 },
		{ lv: 163, exp: 294647508 },
		{ lv: 164, exp: 310794191 },
		{ lv: 165, exp: 327825712 },
		{ lv: 166, exp: 345790561 },
		{ lv: 167, exp: 364739883 },
		{ lv: 168, exp: 384727628 },
		{ lv: 169, exp: 405810702 },
		{ lv: 170, exp: 428049128 },
		{ lv: 171, exp: 451506220 },
		{ lv: 172, exp: 476248760 },
		{ lv: 173, exp: 502347192 },
		{ lv: 174, exp: 529875818 },
		{ lv: 175, exp: 558913012 },
		{ lv: 176, exp: 589541445 },
		{ lv: 177, exp: 621848316 },
		{ lv: 178, exp: 655925603 },
		{ lv: 179, exp: 691870326 },
		{ lv: 180, exp: 729784819 },
		{ lv: 181, exp: 769777027 },
		{ lv: 182, exp: 811960808 },
		{ lv: 183, exp: 856456260 },
		{ lv: 184, exp: 903390063 },
		{ lv: 185, exp: 952895838 },
		{ lv: 186, exp: 1005114529 },
		{ lv: 187, exp: 1060194805 },
		{ lv: 188, exp: 1118293480 },
		{ lv: 189, exp: 1179575962 },
		{ lv: 190, exp: 1244216724 },
		{ lv: 191, exp: 1312399800 },
		{ lv: 192, exp: 1384319309 },
		{ lv: 193, exp: 1460180007 },
		{ lv: 194, exp: 1540197871 },
		{ lv: 195, exp: 1624600714 },
		{ lv: 196, exp: 1713628833 },
		{ lv: 197, exp: 1807535693 },
		{ lv: 198, exp: 1906588648 },
		{ lv: 199, exp: 2011069705 },
		{ lv: 200, exp: 2121276324 },
		{ lv: 201, exp: 2147483647 },
		{ lv: 202, exp: 2147483647 },
		{ lv: 203, exp: 2147483647 },
		{ lv: 204, exp: 2147483647 },
		{ lv: 205, exp: 2147483647 },
		{ lv: 206, exp: 2147483647 },
		{ lv: 207, exp: 2147483647 },
		{ lv: 208, exp: 2147483647 },
		{ lv: 209, exp: 2147483647 },
		{ lv: 210, exp: 2147483647 },
		{ lv: 211, exp: 2147483647 },
		{ lv: 212, exp: 2147483647 },
		{ lv: 213, exp: 2147483647 },
		{ lv: 214, exp: 2147483647 },
		{ lv: 215, exp: 2147483647 },
		{ lv: 216, exp: 2147483647 },
		{ lv: 217, exp: 2147483647 },
		{ lv: 218, exp: 2147483647 },
		{ lv: 219, exp: 2147483647 },
		{ lv: 220, exp: 2147483647 },
		{ lv: 221, exp: 2147483647 },
		{ lv: 222, exp: 2147483647 },
		{ lv: 223, exp: 2147483647 },
		{ lv: 224, exp: 2147483647 },
		{ lv: 225, exp: 2147483647 },
		{ lv: 226, exp: 2147483647 },
		{ lv: 227, exp: 2147483647 },
		{ lv: 228, exp: 2147483647 },
		{ lv: 229, exp: 2147483647 },
		{ lv: 230, exp: 2147483647 },
		{ lv: 231, exp: 2147483647 },
		{ lv: 232, exp: 2147483647 },
		{ lv: 233, exp: 2147483647 },
		{ lv: 234, exp: 2147483647 },
		{ lv: 235, exp: 2147483647 },
		{ lv: 236, exp: 2147483647 },
		{ lv: 237, exp: 2147483647 },
		{ lv: 238, exp: 2147483647 },
		{ lv: 239, exp: 2147483647 },
		{ lv: 240, exp: 2147483647 },
		{ lv: 241, exp: 2147483647 },
		{ lv: 242, exp: 2147483647 },
		{ lv: 243, exp: 2147483647 },
		{ lv: 244, exp: 2147483647 },
		{ lv: 245, exp: 2147483647 },
		{ lv: 246, exp: 2147483647 },
		{ lv: 247, exp: 2147483647 },
		{ lv: 248, exp: 2147483647 },
		{ lv: 249, exp: 2147483647 },
		{ lv: 250, exp: 2147483647 },
		{ lv: 251, exp: 2147483647 },
		{ lv: 252, exp: 2147483647 },
		{ lv: 253, exp: 2147483647 },
		{ lv: 254, exp: 2147483647 },
		{ lv: 255, exp: 2147483647 },
	];
	var Lv = cm.getPlayer().getLevel();
	for (var i = 0; i < lvexp.length; i++) {
		if (Lv <= lvexp[i].lv) {
			exp = lvexp[i].exp;
			break;
		}
	}
	return exp;
}