var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var item;


var jmsz = [
    Array(1053790, 1, "未定义", "永久"), //null
    Array(1053457, 0, "未定义", "永久"), //null
    Array(1053458, 0, "未定义", "永久"), //null
    //Array(1053815, 0, "未定义", "永久"), //null
    Array(1053851, 0, "未定义", "永久"), //null
    Array(1053852, 0, "未定义", "永久"), //null

    Array(1052997, 0, "未定义", "永久"), //北极保暖套服 
    Array(1053006, 0, "未定义", "永久"), //暖绒兔长裙
    Array(1052948, 0, "未定义", "永久"), //奥尔卡的睡袍
    Array(1052940, 0, "未定义", "永久"), //春日阳光套衫
    Array(1052925, 0, "未定义", "永久"), //红粉飘飘连衣裙
    Array(1052924, 0, "未定义", "永久"), //贵族花纹套服
    Array(1052923, 0, "未定义", "永久"), //黑猫连帽衫
    Array(1052921, 0, "未定义", "永久"), //蓝色金鱼全身服
    Array(1052922, 0, "未定义", "永久"), //红色金鱼全身服
    Array(1052919, 0, "未定义", "永久"), //西红柿外套
    Array(1052910, 0, "未定义", "永久"), //水晶喵喵全身服
    Array(1052911, 0, "未定义", "永久"), //水晶喵喵连衣裙
    Array(1052912, 0, "未定义", "永久"), //夹棉时尚王
    Array(1052916, 0, "未定义", "永久"), //弓凛的花衣裳
    Array(1052917, 0, "未定义", "永久"), //红月的夜行衣
    Array(1052909, 0, "未定义", "永久"), //蜜蜂外套
    Array(1052903, 0, "未定义", "永久"), //白色管家礼服
    Array(1052901, 0, "未定义", "永久"), //时髦的领结套服
    Array(1052899, 0, "未定义", "永久"), //红色啵啵鼠连帽套服（黑色）
    Array(1052900, 0, "未定义", "永久"), //红色啵啵鼠连帽套服（红色）
    Array(1052892, 0, "未定义", "永久"), //呆萌兔背带裤
    Array(1052896, 0, "未定义", "永久"), //可爱小绵羊服
    Array(1052865, 0, "未定义", "永久"), //小恐龙套服
    Array(1052595, 0, "未定义", "永久"), //小恐龙套服
    Array(1052852, 0, "未定义", "永久"), //暴走斯乌连身服
    Array(1052853, 0, "未定义", "永久"), //奥尔卡的病号服
    Array(1052850, 0, "未定义", "永久"), //毛绒鼠鼠服
    Array(1052841, 0, "未定义", "永久"), //甜柿服
    Array(1052842, 0, "未定义", "永久"), //萌犬套装(裙)
    Array(1052843, 0, "未定义", "永久"), //萌犬套装(裤)
    Array(1052844, 0, "未定义", "永久"), //微笑玉米背带裤
    Array(1052845, 0, "未定义", "永久"), //宽松运动服  1050340
    Array(1052846, 0, "未定义", "永久"), //桃太郎的背带裤  
    Array(1052781, 0, "未定义", "永久"), //红色小马憨憨背带裤
    Array(1052782, 0, "未定义", "永久"), //蓝色小马憨憨背带裤
    Array(1052772, 0, "未定义", "永久"), //2014制服
    Array(1052762, 0, "未定义", "永久"), //香蕉背带套装
    Array(1052754, 0, "未定义", "永久"), //嘟嘟熊连体衣
    Array(1052726, 0, "未定义", "永久"), //僵尸新娘全身装
    Array(1052727, 0, "未定义", "永久"), //快乐连体衫
    Array(1052728, 0, "未定义", "永久"), //快乐连衣裙
    Array(1052731, 0, "未定义", "永久"), //黑色可爱游泳服
    Array(1052724, 0, "未定义", "永久"), //小马乖乖套服
    Array(1052697, 0, "未定义", "永久"), //雪之女神连身裙
    Array(1052675, 0, "未定义", "永久"), //万圣节幻影帽子套服
    Array(1052671, 0, "未定义", "永久"), //特大号白衬衫
    Array(1052661, 0, "未定义", "永久"), //小鸡玩偶服
    Array(1052666, 0, "未定义", "永久"), //巧克力绵羊玩偶服
    Array(1052667, 0, "未定义", "永久"), //小绵羊朵朵玩偶服
    Array(1052656, 0, "未定义", "永久"), //白天鹅芭蕾服
    Array(1052657, 0, "未定义", "永久"), //黑天鹅芭蕾服
    Array(1052626, 0, "未定义", "永久"), //海洋风条纹装
    Array(1052603, 0, "未定义", "永久"), //武陵武道馆道服
    Array(1052601, 0, "未定义", "永久"), //废都高校校服
    Array(1052587, 0, "未定义", "永久"), //小海豹玩偶服
    Array(1052586, 0, "未定义", "永久"), //伶俐猫咪服装
    Array(1052549, 0, "未定义", "永久"), //[MS特制]红勇士马甲
    Array(1052536, 0, "未定义", "永久"), //水手装
    Array(1052537, 0, "未定义", "永久"), //超级星光蜜蜂服
    Array(1052539, 0, "未定义", "永久"), //蓝道袍
    Array(1052503, 0, "未定义", "永久"), //凉爽夏日全身装
    Array(1052474, 0, "未定义", "永久"), //阴阳师的礼服
    Array(1052449, 0, "未定义", "永久"), //时尚香肠套服
    Array(1052410, 0, "未定义", "永久"), //粉嫩花仙裙
    Array(1052412, 0, "未定义", "永久"), //淘气王子
    Array(1052419, 0, "未定义", "永久"), //粉娃娃裙
    Array(1052356, 0, "未定义", "永久"), //军队TOP星星
    Array(1052370, 0, "未定义", "永久"), //格莱特服
    Array(1052346, 0, "未定义", "永久"), //雪花情侣男棉衣
    Array(1052346, 0, "未定义", "永久"), //雪花情侣女棉衣
    Array(1052340, 0, "未定义", "永久"), //理科麻辣老师
    Array(1052298, 0, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052291, 0, "未定义", "永久"), //户外运动装
    Array(1052290, 0, "未定义", "永久"), //唤灵斗师套装
    Array(1052286, 0, "未定义", "永久"), //飞行猫猫服
    Array(1052275, 0, "未定义", "永久"), //皇家彩虹夹克
    Array(1052248, 0, "未定义", "永久"), //暗影双刀套服
    Array(1052245, 0, "未定义", "永久"), //小嫩叶套服
    Array(1052253, 0, "未定义", "永久"), //青草背带裤套装
    Array(1052229, 0, "未定义", "永久"), //中国娃娃旗袍
    Array(1052225, 0, "未定义", "永久"), //暗夜娃娃服
    Array(1052216, 0, "未定义", "永久"), //嫦娥裙
    Array(1052209, 0, "未定义", "永久"), //皇家海军制服
    Array(1052200, 0, "未定义", "永久"), //罗丽粉色娃娃套服
    Array(1052201, 0, "未定义", "永久"), //闪亮水手外套
    Array(1052135, 0, "未定义", "永久"), //半人马装
    Array(1052085, 0, "未定义", "永久"), //肚兜（红色）
    Array(1052086, 0, "未定义", "永久"), //肚兜（蓝色）
    Array(1052078, 0, "未定义", "永久"), //泡泡袍
    Array(1052067, 0, "未定义", "永久"), //木乃伊服
    Array(1051456, 0, "未定义", "永久"), //爱情蓝鸟连衣裙
    Array(1051457, 0, "未定义", "永久"), //海军风校服
    Array(1051459, 0, "未定义", "永久"), //农夫甜心派
    Array(1051464, 0, "未定义", "永久"), //天蓝微笑裙
    Array(1051454, 0, "未定义", "永久"), //小粉粉全身服
    Array(1051453, 0, "未定义", "永久"), //小熊连衣裙
    Array(1051452, 0, "未定义", "永久"), //橘色小短裙
    Array(1051448, 0, "未定义", "永久"), //莲花学院指定校服
    Array(1051441, 0, "未定义", "永久"), //精灵兔小妹
    Array(1051440, 0, "未定义", "永久"), //人鱼传说
    Array(1050371, 0, "未定义", "永久"), //人鱼传说
    Array(1051434, 0, "未定义", "永久"), //花叶甜甜
    Array(1051435, 0, "未定义", "永久"), //星光长袍女孩
    Array(1051426, 0, "未定义", "永久"), //幻象贝拉
    Array(1051430, 0, "未定义", "永久"), //闪耀之星纪念套服
    Array(1051425, 0, "未定义", "永久"), //蝴蝶结黄色连衣裙
    Array(1051424, 0, "未定义", "永久"), //圣诞女孩子服
    Array(1051407, 0, "未定义", "永久"), //冒险岛学院女泳衣
    Array(1051408, 0, "未定义", "永久"), //蝴蝶之恋套服
    Array(1051410, 0, "未定义", "永久"), //森林露营服
    Array(1051415, 0, "未定义", "永久"), //拉拉队服
    Array(1051389, 0, "未定义", "永久"), //纯白婚纱
    Array(1051366, 0, "未定义", "永久"), //黄色驯师服装
    Array(1051200, 0, "未定义", "永久"), //邦妮女孩套服
    Array(1051192, 0, "未定义", "永久"), //海洋裹裹短裙
    Array(1051180, 0, "未定义", "永久"), //水兵服
    Array(1050384, 0, "未定义", "永久"), //小蓝蓝全身服
    Array(1050387, 0, "未定义", "永久"), //海军风校服
    Array(1050389, 0, "未定义", "永久"), //农夫甜心派
    Array(1050393, 0, "未定义", "永久"), //天蓝微笑套服
    Array(1050364, 0, "未定义", "永久"), //草叶甜甜
    Array(1050353, 0, "未定义", "永久"), //法式糕点服
    Array(1050341, 0, "未定义", "永久"), //森林露营服
    Array(1050338, 0, "未定义", "永久"), //冒险岛学院男泳裤
    Array(1050319, 0, "未定义", "永久"), //秋游套装
    Array(1050293, 0, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 0, "未定义", "永久")//蓝色小背带服
];


var jmwq = [
    Array(1702105, 0, "未定义", "永久"), //通心钥匙
    Array(1702051, 0, "未定义", "永久"), //灯笼
    Array(1702104, 0, "未定义", "永久"), //巨无霸冰淇淋
    Array(1702374, 0, "未定义", "永久"), //剑豪之刃
    Array(1702212, 0, "未定义", "永久"), //异界之器
    Array(1702091, 0, "未定义", "永久"), //网球拍
    Array(1702115, 0, "未定义", "永久"), //玫瑰花
    Array(1702217, 0, "未定义", "永久"), //黄鸭子游泳圈
    Array(1702228, 0, "未定义", "永久"), //可可香蕉
    Array(1702230, 0, "未定义", "永久"), //冰蓝雪糕
    Array(1702237, 0, "未定义", "永久"), //千年白狐
    Array(1702256, 0, "未定义", "永久"), //风灵使者娃娃
    Array(1702257, 0, "未定义", "永久"), //魂骑士娃娃
    Array(1702258, 0, "未定义", "永久"), //炎术士娃娃
    Array(1702259, 0, "未定义", "永久"), //奇袭者娃娃
    Array(1702260, 0, "未定义", "永久"), //夜行者娃娃
    Array(1702261, 0, "未定义", "永久"), //樱花棒
    Array(1702194, 0, "未定义", "永久"), //圣火火炬
    Array(1702288, 0, "未定义", "永久"), //豹弩游侠弩
    Array(1702318, 0, "未定义", "永久"), //暮光雷光剑
    Array(1702319, 0, "未定义", "永久"), //苹果绿雷光剑
    Array(1702317, 0, "未定义", "永久"), //血红宝石雷光剑
    Array(1702320, 0, "未定义", "永久"), //蓝灰闪电雷光剑
    Array(1702321, 0, "未定义", "永久"), //黑暗中子星雷光剑
    Array(1702322, 0, "未定义", "永久"), //固态黑色雷光剑
    Array(1702323, 0, "未定义", "永久"), //翁布拉&鲁切雷光剑
    Array(1702186, 0, "未定义", "永久"), //迪波
    Array(1702209, 0, "未定义", "永久"), //驯鹿拐杖
    Array(1702204, 0, "未定义", "永久"), //日本铁扇
    Array(1702203, 0, "未定义", "永久"), //万圣节泰迪熊
    Array(1702150, 0, "未定义", "永久"), //冰凌刀
    Array(1702149, 0, "未定义", "永久"), //熔岩刀
    Array(1702157, 0, "未定义", "永久"), //火烤棉花糖
    Array(1702161, 0, "未定义", "永久"), //凶恶的狗狗
    Array(1702136, 0, "未定义", "永久"), //雪之花
    Array(1702120, 0, "未定义", "永久"), //比耶莫特的剑
    Array(1702118, 0, "未定义", "永久"), //亚努斯的剑
    Array(1702119, 0, "未定义", "永久"), //夏奇尔的剑
    Array(1702296, 0, "未定义", "永久"), //溜溜球
    Array(1702285, 0, "未定义", "永久"), //蓝色蝴蝶结手提包
    Array(1702302, 0, "未定义", "永久"), //杯具
    Array(1702208, 0, "未定义", "永久"), //搞怪鳄鱼
    Array(1702305, 0, "未定义", "永久"), //胡萝卜武器
    Array(1702310, 0, "未定义", "永久"), //星光魔法棒
    Array(1702350, 0, "未定义", "永久"), //巧克力蛋糕魔法棒
    Array(1702306, 0, "未定义", "永久"), //花风芭蕉扇
    Array(1702379, 0, "未定义", "永久"), //阿拉伯魔术洋灯
    Array(1702378, 0, "未定义", "永久"), //国庆闪亮之光
    Array(1702263, 0, "未定义", "永久"), //小灰灰猫
    Array(1702308, 0, "未定义", "永久"), //魔术师帽子
    Array(1702298, 0, "未定义", "永久"), //暗影刀子
    Array(1702291, 0, "未定义", "永久"), //玲珑扇
    Array(1702293, 0, "未定义", "永久"), //秋天旅行者背包
    Array(1702299, 0, "未定义", "永久"), //可爱巧克力棒
    Array(1702300, 0, "未定义", "永久"), //电蚊拍
    Array(1702359, 0, "未定义", "永久"), //蓝色天使注射器
    Array(1702328, 0, "未定义", "永久"), //粉红天使注射器
    Array(1702329, 0, "未定义", "永久"), //喜欢草莓
    Array(1702233, 0, "未定义", "永久"), //彩虹毛笔
    Array(1702187, 0, "未定义", "永久"), //蓝色极光
    Array(1702188, 0, "未定义", "永久"), //粉色极光
    Array(1702193, 0, "未定义", "永久"), //湿抹布
    Array(1702248, 0, "未定义", "永久"), //圣诞武器
    Array(1702252, 0, "未定义", "永久"), //鹰的飞舞
    Array(1702276, 0, "未定义", "永久"), //天际之弓
    Array(1702283, 0, "未定义", "永久"), //天界圣战手镯
    Array(1702279, 0, "未定义", "永久"), //天界圣战之剑
    Array(1702280, 0, "未定义", "永久"), //天界圣战巨剑
    Array(1702281, 0, "未定义", "永久"), //天界圣战法杖
    Array(1702282, 0, "未定义", "永久"), //天界圣战藏弓
    Array(1702362, 0, "未定义", "永久"), //我的好友品克缤
    Array(1702324, 0, "未定义", "永久"), //冲击波
    Array(1702323, 0, "未定义", "永久"), //鲁切雷光剑
    Array(1702313, 0, "未定义", "永久"), //橙色极光
    Array(1702314, 0, "未定义", "永久"), //天堂极光
    Array(1702315, 0, "未定义", "永久"), //斯泰拉极光
    Array(1702316, 0, "未定义", "永久"), //动态极光
    Array(1702295, 0, "未定义", "永久"), //扑克牌
    Array(1702348, 0, "未定义", "永久"), //雪片
    Array(1702274, 0, "未定义", "永久"), //神龙手套
    Array(1702301, 0, "未定义", "永久")//兔兔魔力棒
];


var jzmp = [

    Array(1115109, 0, "未定义", "永久"), //
    Array(1115020, 0, "未定义", "永久"), //

    Array(1115168, 0, "未定义", "永久"), //

    Array(1115158, 0, "未定义", "永久"), //

    Array(1115152, 0, "未定义", "永久"), //

    Array(1115148, 0, "未定义", "永久"), //
    Array(1115059, 0, "未定义", "永久"), //

    Array(1115110, 0, "未定义", "永久"), //
    Array(1115021, 0, "未定义", "永久"), //

    Array(1115108, 0, "未定义", "永久"), //
    Array(1115019, 0, "未定义", "永久"), //

    Array(1115113, 0, "未定义", "永久"), //
    Array(1115024, 0, "未定义", "永久"), //
	
    Array(1115023, 0, "未定义", "永久"), //
    Array(1115112, 0, "未定义", "永久"), //
	
    Array(1115025, 0, "未定义", "永久"), //
	
    Array(1115115, 0, "未定义", "永久"), //
    Array(1115026, 0, "未定义", "永久"), //
	
    Array(1115116, 0, "未定义", "永久"), //
    Array(1115027, 0, "未定义", "永久"), //
	
    Array(1115117, 0, "未定义", "永久"), //

	
    Array(1115118, 0, "未定义", "永久"), //
    Array(1115029, 0, "未定义", "永久"), //
	
    Array(1115119, 0, "未定义", "永久"), //
    Array(1115030, 0, "未定义", "永久"), //
	
    Array(1115120, 0, "未定义", "永久"), //
    Array(1115031, 0, "未定义", "永久"), //
	
    Array(1115121, 0, "未定义", "永久"), //

	
	
    Array(1112924, 0, "未定义", "永久"), Array(1112928, 0, "未定义", "永久"),Array(1112142, 0, "未定义", "永久"),
    Array(1115105, 0, "未定义", "永久"), Array(1112924, 0, "未定义", "永久"),Array(1112257, 0, "未定义", "永久"),
    Array(1115018, 0, "未定义", "永久"), Array(1112930, 0, "未定义", "永久"),Array(1112145, 0, "未定义", "永久"),
    Array(1115111, 0, "未定义", "永久"), Array(1112916, 0, "未定义", "永久"),Array(1112258, 0, "未定义", "永久"),
    Array(1115022, 0, "未定义", "永久"), Array(1112296, 0, "未定义", "永久"),Array(1112146, 0, "未定义", "永久"),
    Array(1112180, 0, "未定义", "永久"), Array(1112183, 0, "未定义", "永久"),Array(1112263, 0, "未定义", "永久"),
    Array(1112293, 0, "未定义", "永久"), Array(1112135, 0, "未定义", "永久"),Array(1112151, 0, "未定义", "永久"),
    Array(1112141, 0, "未定义", "永久"), Array(1112238, 0, "未定义", "永久"),Array(1112171, 0, "未定义", "永久"),
    Array(1112252, 0, "未定义", "永久"), Array(1112144, 0, "未定义", "永久"),Array(1112172, 0, "未定义", "永久"),
    Array(1112143, 0, "未定义", "永久"), Array(1112256, 0, "未定义", "永久"),Array(1112173, 0, "未定义", "永久"),
    Array(1112254, 0, "未定义", "永久"), Array(1112120, 0, "未定义", "永久"),Array(1112285, 0, "未定义", "永久"),
    Array(1112154, 0, "未定义", "永久"), Array(1112230, 0, "未定义", "永久"),Array(1112174, 0, "未定义", "永久"),
    Array(1112266, 0, "未定义", "永久"), Array(1112272, 0, "未定义", "永久"),Array(1112175, 0, "未定义", "永久"),
    Array(1112162, 0, "未定义", "永久"), Array(1112160, 0, "未定义", "永久"),Array(1112176, 0, "未定义", "永久"),
    Array(1112274, 0, "未定义", "永久"), Array(1112268, 0, "未定义", "永久"),Array(1112288, 0, "未定义", "永久"),
    Array(1112190, 0, "未定义", "永久"), Array(1112156, 0, "未定义", "永久"),Array(1112177, 0, "未定义", "永久"),
    Array(1115003, 0, "未定义", "永久"), Array(1112267, 0, "未定义", "永久"),Array(1112289, 0, "未定义", "永久"),
    Array(1112193, 0, "未定义", "永久"), Array(1112155, 0, "未定义", "永久"),Array(1112283, 0, "未定义", "永久"),
    Array(1115006, 0, "未定义", "永久"), Array(1112277, 0, "未定义", "永久"),Array(1112171, 0, "未定义", "永久"),
    Array(1112194, 0, "未定义", "永久"), Array(1112165, 0, "未定义", "永久"),Array(1112284, 0, "未定义", "永久"),
    Array(1115007, 0, "未定义", "永久"), Array(1112270, 0, "未定义", "永久"),Array(1112172, 0, "未定义", "永久"),
    Array(1112196, 0, "未定义", "永久"), Array(1112158, 0, "未定义", "永久"),Array(1112290, 0, "未定义", "永久"),
    Array(1115009, 0, "未定义", "永久"), Array(1112269, 0, "未定义", "永久"),Array(1112178, 0, "未定义", "永久"),
    Array(1112195, 0, "未定义", "永久"), Array(1112157, 0, "未定义", "永久"),Array(1112291, 0, "未定义", "永久"),
    Array(1115008, 0, "未定义", "永久"), Array(1112253, 0, "未定义", "永久"),Array(1112179, 0, "未定义", "永久"),
    Array(1112190, 0, "未定义", "永久"), //AC聊天戒指
    Array(1115003, 0, "未定义", "永久"), //AC聊天戒指
    Array(1112191, 0, "未定义", "永久"), //MF聊天戒指
    Array(1115004, 0, "未定义", "永久"), //MF聊天戒指
    Array(1112192, 0, "未定义", "永久"), //BL聊天戒指
    Array(1115005, 0, "未定义", "永久"), //BL聊天戒指
    Array(1112237, 0, "未定义", "永久"), //小竹林聊天戒指
    Array(1112134, 0, "未定义", "永久")//小竹林名片戒指
];

var tjId = [//1092064
    //Array(1802424,0, "未定义", "永久"),
    Array(1802425,0, "未定义", "永久"),
    Array(1802426,0, "未定义", "永久"),
    Array(5021002,0, "未定义", "永久"),
    Array(5021003,0, "未定义", "永久"),
    Array(5021004,0, "未定义", "永久"),
    Array(5021005,0, "未定义", "永久"),
    Array(5021006,0, "未定义", "永久"),
    Array(5021007,0, "未定义", "永久"),
    Array(5021008,0, "未定义", "永久"),
    Array(5021009,0, "未定义", "永久"),
    Array(5021010,0, "未定义", "永久"),
    Array(5021011,0, "未定义", "永久"),
    Array(5021012,0, "未定义", "永久"),
    Array(5021013,0, "未定义", "永久"),
    Array(5021014,0, "未定义", "永久"),
    Array(5021015,0, "未定义", "永久"),
    Array(5021017,0, "未定义", "永久"),
    Array(5021021,0, "未定义", "永久"),
    Array(5021022,0, "未定义", "永久"),
    Array(5021023,0, "未定义", "永久"),
    Array(5021024,0, "未定义", "永久"),
    Array(5021025,0, "未定义", "永久"),
    Array(5021026,0, "未定义", "永久"),




    Array(1092064,0, "未定义", "永久"),//
    Array(1004659,0, "未定义", "永久"),//
    Array(1012135,0, "未定义", "永久"),//
    Array(1102767,0, "未定义", "永久"),//
    Array(1000082,0, "未定义", "永久"),//
    Array(1000088,0, "未定义", "永久"),//
    Array(1000086,0, "未定义", "永久"),//
    Array(1001103,0, "未定义", "永久"),//
    Array(1001104,0, "未定义", "永久"),//
    Array(1001110,0, "未定义", "永久"),//
    Array(1003860,0, "未定义", "永久"),//
    Array(1004336,0, "未定义", "永久"),//
    Array(1004337,0, "未定义", "永久"),//
    Array(1004140,0, "未定义", "永久"),//
    Array(1004142,0, "未定义", "永久"),//
    Array(1004147,0, "未定义", "永久"),//
    Array(1004148,0, "未定义", "永久"),//
    Array(1004325,0, "未定义", "永久"),//
    Array(1004396,0, "未定义", "永久"),//
    Array(1012176,0, "未定义", "永久"),//
    Array(1702633,0, "未定义", "永久"),//
    Array(1003597,0, "未定义", "永久"),//
    Array(1702669,0, "未定义", "永久"),//
    Array(1702660,0, "未定义", "永久"),//
    Array(1702640,0, "未定义", "永久"),//
    Array(1702598,0, "未定义", "永久"),//
    Array(1092108,0, "未定义", "永久"),//
    //Array(1092112,0, "未定义", "永久"),//
    Array(1102747,0, "未定义", "永久"),//
    Array(1102759,0, "未定义", "永久"),//
    Array(1102778,0, "未定义", "永久"),//
    Array(1102789,0, "未定义", "永久"),//
    Array(1102800,0, "未定义", "永久"),//
    Array(1102801,0, "未定义", "永久"),//
    Array(1102855,0, "未定义", "永久"),//
    Array(1080008,0, "未定义", "永久"),//
    Array(1082685,0, "未定义", "永久"),//
    Array(1012555,0, "未定义", "永久"),//
    Array(1012556,0, "未定义", "永久"),//
    Array(1012427,0, "未定义", "永久"),//
    Array(1012428,0, "未定义", "永久"),//
    Array(1012429,0, "未定义", "永久"),//
    Array(1012430,0, "未定义", "永久"),//
    Array(1012431,0, "未定义", "永久"),//
    Array(1012432,0, "未定义", "永久"),//
    Array(1012433,0, "未定义", "永久"),//
    Array(1012434,0, "未定义", "永久"),//
    Array(1012435,0, "未定义", "永久"),//
    Array(1012436,0, "未定义", "永久"),//
    Array(1012473,0, "未定义", "永久"),//
    Array(1012485,0, "未定义", "永久"),//
    Array(1012501,0, "未定义", "永久"),//
    Array(1012502,0, "未定义", "永久"),//
    Array(1012503,0, "未定义", "永久"),//
    Array(1012506,0, "未定义", "永久"),//
    Array(1051483,0, "未定义", "永久"),//
    Array(1003279,0, "未定义", "永久"),//
    Array(1042314,0, "未定义", "永久"),//
    Array(1004757,0, "未定义", "永久"),//
    Array(1042357,0, "未定义", "永久")//

];

var xswp = [
     Array(5000077,0,"未定义","90天"),//波斯猫
	 Array(5000032,0,"未定义","90天"),//蓝龙
	 Array(5000033,0,"未定义","90天"),//黑龙
	 Array(5000035,0,"未定义","90天"),//红龙
	 Array(5000264,0,"未定义","90天"),//跳跳袋鼠
	 Array(5000274,0,"未定义","90天"),//豆豆蛇
	 Array(5000285,0,"未定义","90天"),//鱼尾狮
	 Array(5000290,0,"未定义","90天"),//天使提尔
	 Array(5000291,0,"未定义","90天"),//天使提尔
	 Array(5000292,0,"未定义","90天"),//天使提尔
	 Array(5000094,0,"未定义","90天"),//稀有粉雪人
	 Array(5000096,0,"未定义","90天"),//稀有白色小象
	 Array(5000288,0,"未定义","90天"),//半半
	 Array(5000289,0,"未定义","90天"),//皮埃尔
	 Array(5000013,0,"未定义","90天"),//大象
	 Array(5000017,0,"未定义","90天"),//机器人
	 Array(5000022,0,"未定义","90天"),//火鸡
	 Array(5000072,0,"未定义","90天"),//臭鼬
	 Array(5000081,0,"未定义","90天"),//飞行小鲸鱼
	 Array(5000205,0,"未定义","90天"),//猩猩崩克
	 Array(5000217,0,"未定义","90天"),//黑暗灵魂
	 Array(5000227,0,"未定义","90天"),//小鲨鱼
	 Array(5000324,0,"未定义","90天"),//火柴人宠物
	 Array(5000214,0,"未定义","90天"),//雷黄小恶魔
	 Array(5000251,0,"未定义","90天"),//蓝小熊
	 Array(5000268,0,"未定义","90天"),//甜心蝴蝶
	 
	 
	
	
	Array(5000300,0,"未定义","90天"),//甜心蝴蝶
	Array(5000301,0,"未定义","90天"),//甜心蝴蝶
	Array(5000302,0,"未定义","90天"),//甜心蝴蝶
	Array(5000303,0,"未定义","90天"),//甜心蝴蝶
	Array(5000304,0,"未定义","90天"),//甜心蝴蝶
	Array(5000305,0,"未定义","90天"),//甜心蝴蝶
	Array(5000306,0,"未定义","90天"),//甜心蝴蝶
	Array(5000307,0,"未定义","90天"),//甜心蝴蝶
	Array(5000308,0,"未定义","90天"),//甜心蝴蝶
	Array(5000309,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000310,0,"未定义","90天"),//甜心蝴蝶
	Array(5000311,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000314,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000315,0,"未定义","90天"),//甜心蝴蝶
	Array(5000316,0,"未定义","90天"),//甜心蝴蝶
	Array(5000317,0,"未定义","90天"),//甜心蝴蝶
	Array(5000320,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000321,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000322,0,"未定义","90天"),//甜心蝴蝶
	Array(5000324,0,"未定义","90天"),//甜心蝴蝶
	Array(5000328,0,"未定义","90天"),//甜心蝴蝶
	Array(5000330,0,"未定义","90天"),//甜心蝴蝶
	Array(5000331,0,"未定义","90天"),//甜心蝴蝶
	Array(5000332,0,"未定义","90天"),//甜心蝴蝶
	Array(5000341,0,"未定义","90天"),//甜心蝴蝶
	Array(5000342,0,"未定义","90天"),//甜心蝴蝶
	Array(5000343,0,"未定义","90天"),//甜心蝴蝶
	Array(5000344,0,"未定义","90天"),//甜心蝴蝶
	Array(5000345,0,"未定义","90天"),//甜心蝴蝶
	Array(5000352,0,"未定义","90天"),//甜心蝴蝶
	Array(5000353,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000354,0,"未定义","90天"),//甜心蝴蝶
	Array(5000358,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000365,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000366,0,"未定义","90天"),//甜心蝴蝶
	Array(5000367,0,"未定义","90天"),//甜心蝴蝶
	Array(5000368,0,"未定义","90天"),//甜心蝴蝶
	Array(5000369,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000370,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000371,0,"未定义","90天"),//甜心蝴蝶
	Array(5000375,0,"未定义","90天"),//甜心蝴蝶
	Array(5000376,0,"未定义","90天"),//甜心蝴蝶
	Array(5000377,0,"未定义","90天"),//甜心蝴蝶
	Array(5000381,0,"未定义","90天"),//甜心蝴蝶
	Array(5000382,0,"未定义","90天"),//甜心蝴蝶
	Array(5000383,0,"未定义","90天"),//甜心蝴蝶
	Array(5000385,0,"未定义","90天"),//甜心蝴蝶
	Array(5000386,0,"未定义","90天"),//甜心蝴蝶
	Array(5000387,0,"未定义","90天"),//甜心蝴蝶
	Array(5000388,0,"未定义","90天"),//甜心蝴蝶
	Array(5000389,0,"未定义","90天"),//甜心蝴蝶
	Array(5000390,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000391,0,"未定义","90天"),//甜心蝴蝶
	Array(5000393,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000402,0,"未定义","90天"),//甜心蝴蝶
	Array(5000403,0,"未定义","90天"),//甜心蝴蝶
	Array(5000404,0,"未定义","90天"),//甜心蝴蝶
	Array(5000405,0,"未定义","90天"),//甜心蝴蝶
	Array(5000406,0,"未定义","90天"),//甜心蝴蝶
	Array(5000407,0,"未定义","90天"),//甜心蝴蝶
	Array(5000414,0,"未定义","90天"),//甜心蝴蝶
	Array(5000415,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000416,0,"未定义","90天"),//甜心蝴蝶
	Array(5000417,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000424,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000425,0,"未定义","90天"),//甜心蝴蝶
	Array(5000426,0,"未定义","90天"),//甜心蝴蝶
	Array(5000427,0,"未定义","90天"),//甜心蝴蝶
	Array(5000428,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000429,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000430,0,"未定义","90天"),//甜心蝴蝶
	Array(5000431,0,"未定义","90天"),//甜心蝴蝶
	Array(5000432,0,"未定义","90天"),//甜心蝴蝶
	Array(5000443,0,"未定义","90天"),//甜心蝴蝶
	Array(5000444,0,"未定义","90天"),//甜心蝴蝶
	Array(5000445,0,"未定义","90天"),//甜心蝴蝶
	Array(5000446,0,"未定义","90天"),//甜心蝴蝶
	Array(5000447,0,"未定义","90天"),//甜心蝴蝶
	Array(5000448,0,"未定义","90天"),//甜心蝴蝶
	Array(5000430,0,"未定义","90天"),//甜心蝴蝶
	Array(5000431,0,"未定义","90天"),//甜心蝴蝶
	Array(5000432,0,"未定义","90天"),//甜心蝴蝶
	Array(5000433,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000434,0,"未定义","90天"),//甜心蝴蝶
	Array(5000435,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000437,0,"未定义","90天"),//甜心蝴蝶 
	Array(5000460,0,"未定义","90天"),//甜心蝴蝶
	Array(5000461,0,"未定义","90天"),//甜心蝴蝶
	Array(5000462,0,"未定义","90天"),//甜心蝴蝶
	Array(5000466,0,"未定义","90天"),//甜心蝴蝶
	Array(5000468,0,"未定义","90天"),//甜心蝴蝶
	Array(5000459,0,"未定义","90天"),//甜心蝴蝶
	Array(5000541,0,"未定义","90天"),//甜心蝴蝶
	Array(5000529,0,"未定义","90天"),//甜心蝴蝶
	Array(5000528,0,"未定义","90天"),//甜心蝴蝶
	Array(5000483,0,"未定义","90天"),//甜心蝴蝶
	Array(5000469,0,"未定义","90天"),//甜心蝴蝶
	Array(5001006,0,"未定义","90天"),//甜心蝴蝶
	Array(5001007,0,"未定义","90天"),//甜心蝴蝶
	Array(5001008,0,"未定义","90天"),//甜心蝴蝶
	Array(5001009,0,"未定义","90天"),//甜心蝴蝶
	Array(5001010,0,"未定义","90天"),//甜心蝴蝶
	Array(5001011,0,"未定义","90天"),//甜心蝴蝶
	Array(5001012,0,"未定义","90天"),//甜心蝴蝶
	Array(5001013,0,"未定义","90天"),//甜心蝴蝶
	Array(5001014,0,"未定义","90天"),//甜心蝴蝶
	Array(5001015,0,"未定义","90天"),//甜心蝴蝶
	Array(5001016,0,"未定义","90天"),//甜心蝴蝶
	Array(5001017,0,"未定义","90天") //甜心蝴蝶
];


var jmpf = [
    Array(1102665,0, "未定义", "永久"), //狐狸围脖
    Array(1102217,0, "未定义", "永久"), //九尾披风
    Array(1102625,0, "未定义", "永久"), //红色蜗牛壳
    Array(1102187,0, "未定义", "永久"), //金色狐狸尾巴
    Array(1102648,0, "未定义", "永久"), //K君的猫尾巴
    Array(1102387,0, "未定义", "永久"), //海龙尾巴
    Array(1102388,0, "未定义", "永久"), //炎龙尾巴
    Array(1102292,0, "未定义", "永久"), //尾巴
    Array(1102296,0, "未定义", "永久"), //夜叉尾巴（黑色）
    Array(1102656,0, "未定义", "永久"), //动物尾巴6
    Array(1102622,0, "未定义", "永久"), //时间旅行者的怀表
    Array(1102574,0, "未定义", "永久"), //小鸡叽叽叽
    Array(1102380,0, "未定义", "永久"), //我的朋友青蛙酱
    Array(1102549,0, "未定义", "永久"), //管家的猫咪
    Array(1102705,0, "未定义", "永久"), //企鹅书包
    Array(1102683,0, "未定义", "永久"), //兔兔熊背包
    Array(1102684,0, "未定义", "永久"), //未来医生听诊器
    Array(1102682,0, "未定义", "永久"), //未来天使注射器
    Array(1102353,0, "未定义", "永久"), //自由的翅膀
    Array(1102554,0, "未定义", "永久"), //女妖之翼
    Array(1102391,0, "未定义", "永久"), //小蜜蜂翅膀
    Array(1102325,0, "未定义", "永久"), //紫天使羽翼
    Array(1102326,0, "未定义", "永久"), //蓝天使羽翼
    Array(1102389,0, "未定义", "永久"), //金色天使
    Array(1102390,0, "未定义", "永久"), //银色天使
    Array(1102273,0, "未定义", "永久"), //路西法之翼
    Array(1102293,0, "未定义", "永久"), //羁绊之翼
    Array(1102152,0, "未定义", "永久"), //黑骷髅海盗旗
    Array(1102300,0, "未定义", "永久"), //派对舞会灯
    Array(1102288,0, "未定义", "永久"), //背背雪人
    Array(1102274,0, "未定义", "永久"), //刺柏刀
    Array(1102310,0, "未定义", "永久"), //精灵披风
    Array(1102461,0, "未定义", "永久"), //粉嫩披风
    Array(1102222,0, "未定义", "永久"), //死神披风
    Array(1102583,0, "未定义", "永久"), //宝贝龙波比
    Array(1102232,0, "未定义", "永久"), //小王子的星星
    Array(1102218,0, "未定义", "永久"), //仙女飘飘
    Array(1102356,0, "未定义", "永久"), //天使祖母绿
    Array(1102270,0, "未定义", "永久"), //风和日丽
    Array(1102261,0, "未定义", "永久"), //音符围脖
    Array(1102251,0, "未定义", "永久"), //世界杯手巾
    Array(1102373,0, "未定义", "永久"), //露西娅披风
    Array(1102301,0, "未定义", "永久"), //旅行者披风
    Array(1102255,0, "未定义", "永久"), //唤灵斗师披风
    Array(1102254,0, "未定义", "永久"), //豹弩游侠披风
    Array(1102242,0, "未定义", "永久"), //胡克的船长披风
    Array(1102249,0, "未定义", "永久"), //奥兹魔法披风
    Array(1102239,0, "未定义", "永久"), //暗影双刀披风
    Array(1102355,0, "未定义", "永久"), //怪盗幻影披风
    Array(1102673,0, "未定义", "永久"), //僵尸新娘披风
    Array(1102324,0, "未定义", "永久"), //传说双层气球
    Array(1102212,0, "未定义", "永久"), //丢失的小孩
    Array(1102233,0, "未定义", "永久"), //雪娃娃披风
    Array(1102230,0, "未定义", "永久"), //企企雪橇披风
    Array(1102245,0, "未定义", "永久"), //太阳披风
    Array(1102258,0, "未定义", "永久"), //玩具熊气球
    Array(1102215,0, "未定义", "永久"), //气球串
    Array(1102271,0, "未定义", "永久"), //可爱巧克力棒气球
    Array(1102488,0, "未定义", "永久"), //蛋糕杯气球
    Array(1102285,0, "未定义", "永久"), //晴天娃娃(粉色)
    Array(1102286,0, "未定义", "永久"), //晴天娃娃(天蓝色)
    Array(1102287,0, "未定义", "永久"),//晴天娃娃(淡黄色)
	Array(1102755,0, "未定义", "永久"),//星光点点气球
	Array(1102756,0, "未定义", "永久"),//微笑玉米斗篷
	Array(1102726,0, "未定义", "永久"),//胡萝卜气球
];


var jmmz = [
    //Array(1005462,0, "未定义", "永久"), //null
    //Array(1005463,0, "未定义", "永久"), //null
    //Array(1005464,0, "未定义", "永久"), //null
    //Array(1005465,0, "未定义", "永久"), //null
    //Array(1005466,0, "未定义", "永久"), //null
    //Array(1005467,0, "未定义", "永久"), //null
    //Array(1005468,0, "未定义", "永久"), //null
    //Array(1005462,0, "未定义", "永久"), //null
    //Array(1005462,0, "未定义", "永久"), //null
    Array(1002960,0, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1004639,0, "未定义", "永久"), //北极罩帽
    Array(1004665,0, "未定义", "永久"), //暖绒兔兔帽
    Array(1004638,0, "未定义", "永久"), //茅山道士帽
    Array(1004592,0, "未定义", "永久"), //紫色时间
    Array(1004592,0, "未定义", "永久"), //粉色时间
    Array(1004590,0, "未定义", "永久"), //蓝莓宝石头饰
    Array(1004589,0, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570,0, "未定义", "永久"), //黑色海魂帽
    Array(1004571,0, "未定义", "永久"), //海贼团贝雷帽
    Array(1004541,0, "未定义", "永久"), //茶会大蝴蝶结
    Array(1004540,0, "未定义", "永久"), //奥尔卡的睡帽
    Array(1004506,0, "未定义", "永久"), //白色兔耳发带
    Array(1004504,0, "未定义", "永久"), //贵族花纹帽子
    Array(1004499,0, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004500,0, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004491,0, "未定义", "永久"), //西红柿帽子
    Array(1004481,0, "未定义", "永久"), //反抗者护目镜
    Array(1004480,0, "未定义", "永久"), //小淘气的飞行帽
    Array(1004470,0, "未定义", "永久"), //毛绒雷锋帽
    Array(1004469,0, "未定义", "永久"), //爱情宣言
    Array(1004463,0, "未定义", "永久"), //方块兔帽子
    Array(1004448,0, "未定义", "永久"), //黑色啵啵鼠帽
    Array(1004414,0, "未定义", "永久"), //热腾腾包子帽
    Array(1004409,0, "未定义", "永久"), //松鼠的休闲帽
    Array(1004403,0, "未定义", "永久"), //嘻哈兔子
    Array(1004405,0, "未定义", "永久"), //睡虎休闲帽
    Array(1004397,0, "未定义", "永久"), //清扫头巾
    Array(1004336,0, "未定义", "永久"), //暴走斯乌假发
    Array(1004330,0, "未定义", "永久"), //奢华羊绒小礼帽
    Array(1004328,0, "未定义", "永久"), //粉色棒球帽
    Array(1004329,0, "未定义", "永久"), //蓝色棒球帽发夹
    Array(1004324,0, "未定义", "永久"), //防毒面罩
    Array(1004294,0, "未定义", "永久"), //甜柿帽
    Array(1004295,0, "未定义", "永久"), //音乐飞天小鸡帽
    Array(1004296,0, "未定义", "永久"), //萌动飞天小鸡帽
    Array(1004298,0, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004299,0, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004275,0, "未定义", "永久"), //幸运帽
    Array(1004269,0, "未定义", "永久"), //苹果蒂风情帽
    Array(1004239,0, "未定义", "永久"), //桃太郎帽子
    Array(1004212,0, "未定义", "永久"), //晶莹精致丝带
    Array(1004211,0, "未定义", "永久"), //哈尼绒绒耳
    Array(1004204,0, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004205,0, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004202,0, "未定义", "永久"), //隐武士战盔
    Array(1004200,0, "未定义", "永久"), //夏日兔草帽
    Array(1004198,0, "未定义", "永久"), //太极发箍
    Array(1004196,0, "未定义", "永久"), //风车头箍
    Array(1004194,0, "未定义", "永久"), //蝴蝶结贝雷帽
    Array(1004169,0, "未定义", "永久"), //美味荷包蛋帽
    Array(1004171,0, "未定义", "永久"), //旋转木马帽
    Array(1004163,0, "未定义", "永久"), //爱丽丝表丝带
    Array(1004158,0, "未定义", "永久"), //鼠鼠派对发箍
    Array(1004137,0, "未定义", "永久"), //兔兔熊帽
    Array(1004025,0, "未定义", "永久"), //绿猫猫帽子
    Array(1004026,0, "未定义", "永久"), //黑猫无边帽
    Array(1004027,0, "未定义", "永久"), //白猫无边帽
    Array(1004028,0, "未定义", "永久"), //黄猫无边帽
    Array(1004029,0, "未定义", "永久"), //北极熊无边帽
    Array(1004033,0, "未定义", "永久"), //红猫猫帽子
    Array(1004003,0, "未定义", "永久"), //粉红猫耳套头帽
    Array(1004004,0, "未定义", "永久"), //粉红猫耳套头帽
    Array(1003967,0, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003968,0, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003951,0, "未定义", "永久"), //欧黛特头箍
    Array(1003952,0, "未定义", "永久"), //欧黛特头箍
    Array(1003937,0, "未定义", "永久"), //浪漫斗笠
    Array(1003919,0, "未定义", "永久"), //花花绒线帽
    Array(1003920,0, "未定义", "永久"), //夏威夷草帽
    Array(1003921,0, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003917,0, "未定义", "永久"), //粉红太阳镜帽
    Array(1003900,0, "未定义", "永久"), //蓝色桃心透明帽子
    Array(1003892,0, "未定义", "永久"), //树叶钻石
    Array(1003859,0, "未定义", "永久"), //满天星普赛克
    Array(1003847,0, "未定义", "永久"), //鬼剑士假发
    Array(1003831,0, "未定义", "永久"), //卷卷绵羊发卡
    Array(1003829,0, "未定义", "永久"), //兔耳管家礼帽
    Array(1003776,0, "未定义", "永久"), //海豹白白帽
    Array(1003777,0, "未定义", "永久"), //伶俐猫咪斗篷
    Array(1003778,0, "未定义", "永久"), //可爱猫咪斗篷
    Array(1003779,0, "未定义", "永久"), //爱丽丝兔兔帽
    Array(1003763,0, "未定义", "永久"), //黑色之翼首领帽
    Array(1003710,0, "未定义", "永久"), //[MS折扣]怪医黑杰克帽
    Array(1003596,0, "未定义", "永久"), //金属粉色棒球帽
    Array(1003594,0, "未定义", "永久"), //凉爽夏日潜水镜
    Array(1003586,0, "未定义", "永久"), //薄荷星海军帽
    Array(1003587,0, "未定义", "永久"), //薄荷星海军帽
    Array(1003508,0, "未定义", "永久"), //时尚香肠帽
    Array(1003509,0, "未定义", "永久"), //时尚香肠帽
    Array(1003417,0, "未定义", "永久"), //恐龙帽子
    Array(1003220,0, "未定义", "永久"), //尼龙花头绳
    Array(1003203,0, "未定义", "永久"), //小红帽
    Array(1003149,0, "未定义", "永久"), //洛比尔兔子斗篷
    Array(1003146,0, "未定义", "永久"), //蕾丝蝴蝶结发箍
    Array(1003147,0, "未定义", "永久"), //天蓝女仆头饰
    Array(1003131,0, "未定义", "永久"), //黑色精致丝带
    Array(1003132,0, "未定义", "永久"), //黑色精致丝带
    Array(1003133,0, "未定义", "永久"), //黑色精致丝带
    Array(1003122,0, "未定义", "永久"), //黄色兔兔巾
    Array(1003123,0, "未定义", "永久"), //黄色兔兔巾
    Array(1003109,0, "未定义", "永久"), //皇家彩虹斗篷
    Array(1003006,0, "未定义", "永久"), //猫猫野营帽
    Array(1002976,0, "未定义", "永久"), //女仆头饰
    Array(1002885,0, "未定义", "永久"), //心型蝴蝶结
    Array(1002721,0, "未定义", "永久"), //狸毛护耳
    Array(1002704,0, "未定义", "永久"), //黄独眼怪婴
    Array(1002691,0, "未定义", "永久"), //半人马假发(棕色)
    Array(1002695,0, "未定义", "永久"), //幽灵帽
    Array(1004636,0, "未定义", "永久"), //香蕉郊游帽
    Array(1004628,0, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004629,0, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004630,0, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004631,0, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004632,0, "未定义", "永久"), //卖萌小叶子发卡
    Array(1004602,0, "未定义", "永久"), //农夫的瑰宝
    Array(1004601,0, "未定义", "永久"), //小企鹅帽子
    Array(1004589,0, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570,0, "未定义", "永久"), //黑色海魂帽
    Array(1004571,0, "未定义", "永久"), //海贼团贝雷帽
    Array(1004568,0, "未定义", "永久"), //呆萌鼠鼠帽
    Array(1004543,0, "未定义", "永久"), //复古头巾
    Array(1004544,0, "未定义", "永久"), //棒球帽
    Array(1004545,0, "未定义", "永久"), //棒球帽
    Array(1004546,0, "未定义", "永久"), //棒球帽
    Array(1004547,0, "未定义", "永久"), //棒球帽
    Array(1004548,0, "未定义", "永久"), //棒球帽
    Array(1004530,0, "未定义", "永久"), //蓝色熊猫玩偶帽子
    Array(1004510,0, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004511,0, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004512,0, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004513,0, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004514,0, "未定义", "永久"), //糖糖绿水灵帽子
    Array(1004503,0, "未定义", "永久"), //黑猫
    Array(1004504,0, "未定义", "永久"), //黑猫
    Array(1004505,0, "未定义", "永久"), //黑猫
    Array(1004506,0, "未定义", "永久"), //黑猫
    Array(1003595,0, "未定义", "永久")//卷发兔子
];



var jmsp = [
    Array(1012501,0, "未定义", "永久"), //烈焰之瞳(蓝)
    Array(1022184,0, "未定义", "永久"), //烈焰之瞳(蓝)
    Array(1022183,0, "未定义", "永久"), //烈焰之瞳(红) 
    Array(1012450,0, "未定义", "永久"), //巧克力彩豆曲奇
    Array(1012412,0, "未定义", "永久"), //血泪 
    Array(1012099,0, "未定义", "永久"), //蓝色腮红 
    Array(1012253,0, "未定义", "永久"), //心跳唇彩
    Array(1012160,0, "未定义", "永久"), //烈焰红唇
    Array(1012208,0, "未定义", "永久"), //害羞了 
    Array(1012131,0, "未定义", "永久"), //好白的牙
    Array(1012165,0, "未定义", "永久"), //小丑鼻子
    Array(1012176,0, "未定义", "永久"), //娃娃脸
    Array(1012179,0, "未定义", "永久"), //鹿鼻子
    Array(1022059,0, "未定义", "永久"), //经典黑色墨镜
    Array(1022057,0, "未定义", "永久"), //POP眼镜
    Array(1022064,0, "未定义", "永久"), //时尚大太阳镜
    Array(1022063,0, "未定义", "永久"), //无框小圆眼镜
    Array(1022104,0, "未定义", "永久"), //3D炫彩眼镜
    Array(1022102,0, "未定义", "永久"), //LED炫光眼镜
    Array(1022108,0, "未定义", "永久"), //柠檬黄潮流眼镜
    Array(1022109,0, "未定义", "永久"), //玫瑰红潮流眼镜
    Array(1003265,0, "未定义", "永久"), //爱心天蓝墨镜
    Array(1022110,0, "未定义", "永久"), //非主流墨镜
    Array(1022122,0, "未定义", "永久"), //DJ眼镜
    Array(1032029,0, "未定义", "永久"), //925银耳环
    Array(1032181,0, "未定义", "永久"), //杜鹃花耳环
    Array(1032034,0, "未定义", "永久"), //可乐耳环
    Array(1032094,0, "未定义", "永久"), //胡萝卜耳环
    Array(1032088,0, "未定义", "永久"), //体力猎犬耳环
    Array(1032145,0, "未定义", "永久")//螃蟹耳环
];


var txwq = [
    [1702577,0, "未定义", "永久"],
    [1702579,0, "未定义", "永久"],
    [1702581,0, "未定义", "永久"],
    [1702583,0, "未定义", "永久"],
    [1702584,0, "未定义", "永久"],
    [1702585,0, "未定义", "永久"],
    [1702586,0, "未定义", "永久"],
    [1702587,0, "未定义", "永久"],
    [1702588,0, "未定义", "永久"],
    [1702589,0, "未定义", "永久"],
    [1702590,0, "未定义", "永久"],
    [1702591,0, "未定义", "永久"],
    [1702593,0, "未定义", "永久"],
    [1702594,0, "未定义", "永久"],
    [1702595,0, "未定义", "永久"],
    [1702597,0, "未定义", "永久"],
    [1702598,0, "未定义", "永久"],
    [1702599,0, "未定义", "永久"],
    [1702607,0, "未定义", "永久"],
    [1702608,0, "未定义", "永久"],
    [1702611,0, "未定义", "永久"],
    [1702612,0, "未定义", "永久"],
    [1702613,0, "未定义", "永久"],
    [1702614,0, "未定义", "永久"],
    [1702616,0, "未定义", "永久"],
    [1702617,0, "未定义", "永久"],
    [1702619,0, "未定义", "永久"],
    [1702620,0, "未定义", "永久"],
    [1702621,0, "未定义", "永久"],
    [1702623,0, "未定义", "永久"],
    [1702624,0, "未定义", "永久"],
    [1702625,0, "未定义", "永久"],
    [1702626,0, "未定义", "永久"],
    [1702627,0, "未定义", "永久"],
    [1702628,0, "未定义", "永久"],
    [1702525,0, "未定义", "永久"],
    [1702526,0, "未定义", "永久"],
    [1702527,0, "未定义", "永久"],
    [1702528,0, "未定义", "永久"],
    [1702529,0, "未定义", "永久"],
    [1702530,0, "未定义", "永久"],
    [1702533,0, "未定义", "永久"],
    [1702534,0, "未定义", "永久"],
    [1702535,0, "未定义", "永久"],
    [1702538,0, "未定义", "永久"],
    [1702540,0, "未定义", "永久"],
    [1702541,0, "未定义", "永久"],
    [1702544,0, "未定义", "永久"],
    [1702547,0, "未定义", "永久"],
    [1702548,0, "未定义", "永久"],
    [1702549,0, "未定义", "永久"],
    [1702550,0, "未定义", "永久"],
    [1702551,0, "未定义", "永久"],
    [1702553,0, "未定义", "永久"],
    [1702554,0, "未定义", "永久"],
    [1702555,0, "未定义", "永久"],
    [1702556,0, "未定义", "永久"],
    [1702557,0, "未定义", "永久"],
    [1702559,0, "未定义", "永久"],
    [1702560,0, "未定义", "永久"],
    [1702561,0, "未定义", "永久"],
    [1702562,0, "未定义", "永久"],
    [1702564,0, "未定义", "永久"],
    [1702565,0, "未定义", "永久"],
    [1702566,0, "未定义", "永久"],
    [1702567,0, "未定义", "永久"],
    [1702570,0, "未定义", "永久"],
    [1702571,0, "未定义", "永久"],
    [1702574,0, "未定义", "永久"],
    [1702575,0, "未定义", "永久"],
    [1702576,0, "未定义", "永久"],
    [1702469,0, "未定义", "永久"],
    [1702470,0, "未定义", "永久"],
    [1702471,0, "未定义", "永久"],
    [1702472,0, "未定义", "永久"],
    [1702473,0, "未定义", "永久"],
    [1702476,0, "未定义", "永久"],
    [1702477,0, "未定义", "永久"],
    [1702478,0, "未定义", "永久"],
    [1702480,0, "未定义", "永久"],
    [1702483,0, "未定义", "永久"],
    [1702485,0, "未定义", "永久"],
    [1702486,0, "未定义", "永久"],
    [1702487,0, "未定义", "永久"],
    [1702488,0, "未定义", "永久"],
    [1702489,0, "未定义", "永久"],
    [1702490,0, "未定义", "永久"],
    [1702491,0, "未定义", "永久"],
    [1702492,0, "未定义", "永久"],
    [1702497,0, "未定义", "永久"],
    [1702499,0, "未定义", "永久"],
    [1702501,0, "未定义", "永久"],
    [1702502,0, "未定义", "永久"],
    [1702503,0, "未定义", "永久"],
    [1702504,0, "未定义", "永久"],
    [1702505,0, "未定义", "永久"],
    [1702506,0, "未定义", "永久"],
    [1702507,0, "未定义", "永久"],
    [1702508,0, "未定义", "永久"],
    [1702509,0, "未定义", "永久"],
    [1702510,0, "未定义", "永久"],
    [1702512,0, "未定义", "永久"],
    [1702519,0, "未定义", "永久"],
    [1702520,0, "未定义", "永久"],
    [1702521,0, "未定义", "永久"],
    [1702523,0, "未定义", "永久"],
    [1702524,0, "未定义", "永久"],
    [1702427,0, "未定义", "永久"],
    [1702428,0, "未定义", "永久"],
    [1702429,0, "未定义", "永久"],
    [1702430,0, "未定义", "永久"],
    [1702431,0, "未定义", "永久"],
    [1702432,0, "未定义", "永久"],
    [1702433,0, "未定义", "永久"],
    [1702436,0, "未定义", "永久"],
    [1702437,0, "未定义", "永久"],
    [1702438,0, "未定义", "永久"],
    [1702439,0, "未定义", "永久"],
    [1702442,0, "未定义", "永久"],
    [1702443,0, "未定义", "永久"],
    [1702444,0, "未定义", "永久"],
    [1702445,0, "未定义", "永久"],
    [1702446,0, "未定义", "永久"],
    [1702447,0, "未定义", "永久"],
    [1702448,0, "未定义", "永久"],
    [1702449,0, "未定义", "永久"],
    [1702450,0, "未定义", "永久"],
    [1702451,0, "未定义", "永久"],
    [1702452,0, "未定义", "永久"],
    [1702453,0, "未定义", "永久"],
    [1702454,0, "未定义", "永久"],
    [1702455,0, "未定义", "永久"],
    [1702456,0, "未定义", "永久"],
    [1702457,0, "未定义", "永久"],
    [1702458,0, "未定义", "永久"],
    [1702459,0, "未定义", "永久"],
    [1702460,0, "未定义", "永久"],
    [1702461,0, "未定义", "永久"],
    [1702463,0, "未定义", "永久"],
    [1702464,0, "未定义", "永久"],
    [1702466,0, "未定义", "永久"],
    [1702467,0, "未定义", "永久"],
    [1702468,0, "未定义", "永久"],
    [1702386,0, "未定义", "永久"],
    [1702387,0, "未定义", "永久"],
    [1702388,0, "未定义", "永久"],
    [1702389,0, "未定义", "永久"],
    [1702390,0, "未定义", "永久"],
    [1702392,0, "未定义", "永久"],
    [1702393,0, "未定义", "永久"],
    [1702394,0, "未定义", "永久"],
    [1702395,0, "未定义", "永久"],
    [1702397,0, "未定义", "永久"],
    [1702398,0, "未定义", "永久"],
    [1702399,0, "未定义", "永久"],
    [1702400,0, "未定义", "永久"],
    [1702401,0, "未定义", "永久"],
    [1702402,0, "未定义", "永久"],
    [1702403,0, "未定义", "永久"],
    [1702405,0, "未定义", "永久"],
    [1702406,0, "未定义", "永久"],
    [1702408,0, "未定义", "永久"],
    [1702410,0, "未定义", "永久"],
    [1702411,0, "未定义", "永久"],
    [1702412,0, "未定义", "永久"],
    [1702413,0, "未定义", "永久"],
    [1702414,0, "未定义", "永久"],
    [1702415,0, "未定义", "永久"],
    [1702416,0, "未定义", "永久"],
    [1702417,0, "未定义", "永久"],
    [1702418,0, "未定义", "永久"],
    [1702419,0, "未定义", "永久"],
    [1702420,0, "未定义", "永久"],
    [1702421,0, "未定义", "永久"],
    [1702422,0, "未定义", "永久"],
    [1702423,0, "未定义", "永久"],
    [1702424,0, "未定义", "永久"],
    [1702426,0, "未定义", "永久"],
    [1702340,0, "未定义", "永久"],
    [1702341,0, "未定义", "永久"],
    [1702342,0, "未定义", "永久"],
    [1702344,0, "未定义", "永久"],
    [1702345,0, "未定义", "永久"],
    [1702346,0, "未定义", "永久"],
    [1702347,0, "未定义", "永久"],
    [1702348,0, "未定义", "永久"],
    [1702349,0, "未定义", "永久"],
    [1702350,0, "未定义", "永久"],
    [1702352,0, "未定义", "永久"],
    [1702357,0, "未定义", "永久"],
    [1702358,0, "未定义", "永久"],
    [1702359,0, "未定义", "永久"],
    [1702361,0, "未定义", "永久"],
    [1702362,0, "未定义", "永久"],
    [1702363,0, "未定义", "永久"],
    [1702364,0, "未定义", "永久"],
    [1702365,0, "未定义", "永久"],
    [1702366,0, "未定义", "永久"],
    [1702367,0, "未定义", "永久"],
    [1702368,0, "未定义", "永久"],
    [1702371,0, "未定义", "永久"],
    [1702372,0, "未定义", "永久"],
    [1702373,0, "未定义", "永久"],
    [1702374,0, "未定义", "永久"],
    [1702375,0, "未定义", "永久"],
    [1702376,0, "未定义", "永久"],
    [1702377,0, "未定义", "永久"],
    [1702378,0, "未定义", "永久"],
    [1702379,0, "未定义", "永久"],
    [1702381,0, "未定义", "永久"],
    [1702382,0, "未定义", "永久"],
    [1702385,0, "未定义", "永久"],
    [1702301,0, "未定义", "永久"],
    [1702302,0, "未定义", "永久"],
    [1702303,0, "未定义", "永久"],
    [1702304,0, "未定义", "永久"],
    [1702305,0, "未定义", "永久"],
    [1702306,0, "未定义", "永久"],
    [1702307,0, "未定义", "永久"],
    [1702308,0, "未定义", "永久"],
    [1702309,0, "未定义", "永久"],
    [1702310,0, "未定义", "永久"],
    [1702313,0, "未定义", "永久"],
    [1702314,0, "未定义", "永久"],
    [1702315,0, "未定义", "永久"],
    [1702316,0, "未定义", "永久"],
    [1702317,0, "未定义", "永久"],
    [1702318,0, "未定义", "永久"],
    [1702319,0, "未定义", "永久"],
    [1702320,0, "未定义", "永久"],
    [1702321,0, "未定义", "永久"],
    [1702322,0, "未定义", "永久"],
    [1702323,0, "未定义", "永久"],
    [1702324,0, "未定义", "永久"],
    [1702328,0, "未定义", "永久"],
    [1702329,0, "未定义", "永久"],
    [1702330,0, "未定义", "永久"],
    [1702334,0, "未定义", "永久"],
    [1702335,0, "未定义", "永久"],
    [1702336,0, "未定义", "永久"],
    [1702337,0, "未定义", "永久"],
    [1702277,0, "未定义", "永久"],
    [1702278,0, "未定义", "永久"],
    [1702279,0, "未定义", "永久"],
    [1702280,0, "未定义", "永久"],
    [1702281,0, "未定义", "永久"],
    [1702282,0, "未定义", "永久"],
    [1702283,0, "未定义", "永久"],
    [1702284,0, "未定义", "永久"],
    [1702285,0, "未定义", "永久"],
    [1702287,0, "未定义", "永久"],
    [1702288,0, "未定义", "永久"],
    [1702289,0, "未定义", "永久"],
    [1702291,0, "未定义", "永久"],
    [1702293,0, "未定义", "永久"],
    [1702295,0, "未定义", "永久"],
    [1702296,0, "未定义", "永久"],
    [1702297,0, "未定义", "永久"],
    [1702298,0, "未定义", "永久"],
    [1702299,0, "未定义", "永久"],
    [1702300,0, "未定义", "永久"],
    [1702301,0, "未定义", "永久"],
    [1702232,0, "未定义", "永久"],
    [1702233,0, "未定义", "永久"],
    [1702235,0, "未定义", "永久"],
    [1702237,0, "未定义", "永久"],
    [1702238,0, "未定义", "永久"],
    [1702239,0, "未定义", "永久"],
    [1702240,0, "未定义", "永久"],
    [1702246,0, "未定义", "永久"],
    [1702248,0, "未定义", "永久"],
    [1702249,0, "未定义", "永久"],
    [1702250,0, "未定义", "永久"],
    [1702251,0, "未定义", "永久"],
    [1702252,0, "未定义", "永久"],
    [1702253,0, "未定义", "永久"],
    [1702254,0, "未定义", "永久"],
    [1702261,0, "未定义", "永久"],
    [1702262,0, "未定义", "永久"],
    [1702263,0, "未定义", "永久"],
    [1702264,0, "未定义", "永久"],
    [1702265,0, "未定义", "永久"],
    [1702350,0, "未定义", "永久"], //巧克力蛋糕魔法棒
    [1702466,0, "未定义", "永久"], //薄荷巧克力蛋糕棒
    [1702468,0, "未定义", "永久"], //松脆巧克力干酪棒
    [1702346,0, "未定义", "永久"], //福袋
    [1702342,0, "未定义", "永久"], //奥尔卡的兔娃娃
    [1702352,0, "未定义", "永久"], //奶茶搅拌勺
    [1702357,0, "未定义", "永久"], //坠星魔术空间
    [1702359,0, "未定义", "永久"], //蓝色天使注射器
    [1702367,0, "未定义", "永久"], //玫瑰苏菲亚
    [1702368,0, "未定义", "永久"], //黑暗蝴蝶魔棒
    [1702371,0, "未定义", "永久"], //舞杖
    [1702372,0, "未定义", "永久"], //圣杯武器
    [1702373,0, "未定义", "永久"], //烟花祭团扇
    [1702375,0, "未定义", "永久"], //亚特兰蒂斯
    [1702377,0, "未定义", "永久"], //喜欢草莓
    [1702382,0, "未定义", "永久"], //满月柿子树枝
    [1702388,0, "未定义", "永久"], //熊宝宝是个能巧匠
    [1702389,0, "未定义", "永久"], //飞飞蓝鸟
    [1702390,0, "未定义", "永久"], //喵喵雨伞
    [1702392,0, "未定义", "永久"], //黑暗小恶魔武器
    [1702393,0, "未定义", "永久"], //蛇年武器
    [1702400,0, "未定义", "永久"], //斯乌的兔子玩偶
    [1702401,0, "未定义", "永久"], //兔子萝卜武器
    [1702402,0, "未定义", "永久"], //高尔夫球棒
    [1702403,0, "未定义", "永久"], //侦探的巨型放大镜
    [1702405,0, "未定义", "永久"], //星光之心魔棒
    [1702408,0, "未定义", "永久"], //纪念日专用武器
    [1702415,0, "未定义", "永久"], //睡梦绵羊枕头
    [1702422,0, "未定义", "永久"], //冒险明星麦克风
    [1702423,0, "未定义", "永久"], //鬼火
    [1702426,0, "未定义", "永久"], //暴风领主
    [1702432,0, "未定义", "永久"], //十八般武器
    [1702433,0, "未定义", "永久"], //莎莉曼德
    [1702437,0, "未定义", "永久"], //下花雨的春日
    [1702442,0, "未定义", "永久"], //棒球棒
    [1702444,0, "未定义", "永久"], //费尔玛塔
    [1702446,0, "未定义", "永久"], //和海懒一起
    [1702452,0, "未定义", "永久"], //自由的灵魂
    [1702453,0, "未定义", "永久"], //雷霆之怒
    [1702455,0, "未定义", "永久"], //真红油漆
    [1702456,0, "未定义", "永久"], //精灵皮克
    [1702457,0, "未定义", "永久"], //冬天里的雪糕
    [1702459,0, "未定义", "永久"], //棉花糖武器
    [1702460,0, "未定义", "永久"], //星星武器
    [1702461,0, "未定义", "永久"], //充满孝心的小鸡
    [1702463,0, "未定义", "永久"], //幻夜祭华
    [1702464,0, "未定义", "永久"], //闪耀的伙伴们
    [1702469,0, "未定义", "永久"], //阿拉克尼
    [1702473,0, "未定义", "永久"], //岩炎执行者
    [1702480,0, "未定义", "永久"], //月亮女神
    [1702485,0, "未定义", "永久"], //大包小包
    [1702486,0, "未定义", "永久"], //茶花纷飞
    [1702487,0, "未定义", "永久"], //花红
    [1702521,0, "未定义", "永久"], //青炎
    [1702488,0, "未定义", "永久"], //邦尼的胡萝卜
    [1702490,0, "未定义", "永久"], //肃清者暗笼
    [1702492,0, "未定义", "永久"], //春节灯笼
    [1702499,0, "未定义", "永久"], //林之灵武器
    [1702501,0, "未定义", "永久"], //玫瑰花舞
    [1702503,0, "未定义", "永久"], //巴尼兔的彩虹泡沫
    [1702504,0, "未定义", "永久"], //冰封之心
    [1702505,0, "未定义", "永久"], //粉嘟嘟熊的竹节
    [1702593,0, "未定义", "永久"], //清冷天空竹子
    [1702509,0, "未定义", "永久"], //彩棒糖
    [1702510,0, "未定义", "永久"], //兔兔熊手电筒
    [1702512,0, "未定义", "永久"], //主人公权杖
    [1702524,0, "未定义", "永久"], //红红番茄
    [1702526,0, "未定义", "永久"], //鸟统剑
    [1702527,0, "未定义", "永久"], //星光狼牙棒
    [1702528,0, "未定义", "永久"], //木琴旋律
    [1702530,0, "未定义", "永久"], //莎啦啦糖果
    [1702533,0, "未定义", "永久"], //奶兔立拍得
    [1702534,0, "未定义", "永久"], //嘟嘟奶嘴
    [1702535,0, "未定义", "永久"], //呼啦呼啦小企鹅
    [1702538,0, "未定义", "永久"], //露珠武器
    [1702544,0, "未定义", "永久"], //啦啦啦~甩葱
    [1702547,0, "未定义", "永久"], //柿什么柿
    [1702548,0, "未定义", "永久"], //黄金香蕉
    [1702549,0, "未定义", "永久"], //炫彩星星棒
    [1702550,0, "未定义", "永久"], //桃太郎武器
    [1702553,0, "未定义", "永久"], //危险药瓶
    [1702554,0, "未定义", "永久"], //可怕大手掌
    [1702556,0, "未定义", "永久"], //刀
    [1702557,0, "未定义", "永久"], //清扫掸子
    [1702559,0, "未定义", "永久"], //泰迪小伙伴（白）
    [1702560,0, "未定义", "永久"], //泰迪小伙伴（棕）
    [1702561,0, "未定义", "永久"], //叉子上的蛋糕
    [1702562,0, "未定义", "永久"], //圣诞老人
    [1702565,0, "未定义", "永久"], //死亡之刃
    [1702566,0, "未定义", "永久"], //羊羊魔术棒
    [1702567,0, "未定义", "永久"], //漂浮小虎
    [1702570,0, "未定义", "永久"], //绿野仙兔
    [1702571,0, "未定义", "永久"], //功夫小熊
    [1702574,0, "未定义", "永久"], //迅猛兽
    [1702575,0, "未定义", "永久"], //爱情巧克力篮子
    [1702576,0, "未定义", "永久"], //吭吭哐哐！
    [1702577,0, "未定义", "永久"], //金鱼泡泡兜
    [1702579,0, "未定义", "永久"], //水晶喵喵武器
    [1702581,0, "未定义", "永久"], //三色蛋糕串串
    [1702583,0, "未定义", "永久"], //喵咪薯片桶
    [1702584,0, "未定义", "永久"], //可爱小狗
    [1702586,0, "未定义", "永久"], //梦想蒲公英
    [1702589,0, "未定义", "永久"], //樱花物语
    [1702590,0, "未定义", "永久"], //巧克力棒
    [1702591,0, "未定义", "永久"], //飞翔罗曼史
    [1702594,0, "未定义", "永久"], //奥尔卡瞌睡
    [1702595,0, "未定义", "永久"], //薄荷喵下午茶
    [1702597,0, "未定义", "永久"], //彩虹贝壳武器
    [1702598,0, "未定义", "永久"], //枫叶武器
    [1702607,0, "未定义", "永久"], //拔丝萝卜
    [1702608,0, "未定义", "永久"], //海军条纹雨伞
    [1702611,0, "未定义", "永久"], //小鸭单肩包
    [1702617,0, "未定义", "永久"], //幻想莲花武器
    [1702620,0, "未定义", "永久"], //神秘骰子
    [1702623,0, "未定义", "永久"], //杰的陪伴
    [1702624,0, "未定义", "永久"], //时间主宰者
    [1702625,0, "未定义", "永久"], //爱情蓝鸟武器
    [1702626,0, "未定义", "永久"], //海洋封提包
    [1702627,0, "未定义", "永久"], //樱花之刃
    [1702628,0, "未定义", "永久"], //荣耀的黄金鸡蛋杆
    [1702629,0, "未定义", "永久"], //那时最新款手机
    [1702630,0, "未定义", "永久"], //吊篮花灯
    [1702631,0, "未定义", "永久"], //玫瑰誓约
    [1702633,0, "未定义", "永久"], //猴儿小伙伴
    [1702634,0, "未定义", "永久"], //小蘑菇和史莱姆的基情僵尸秀
    [1702636,0, "未定义", "永久"], //北极杀人豚
    [1702637,0, "未定义", "永久"], //音乐律动武器箱
    [1702640,0, "未定义", "永久"], //兔儿雪绒绒
    [1702654,0, "未定义", "永久"], //温泉喵
    [1702660,0, "未定义", "永久"], //调皮雪人武器
    [1702669,0, "未定义", "永久"], //公主日记武器
    [1702675,0, "未定义", "永久"], //绒绒雪妖精
    [1702682,0, "未定义", "永久"], //海洋串武器
    [1702684,0, "未定义", "永久"], //青鸾鸟
    [1702685,0, "未定义", "永久"], //火凤鸟
    [1702334,0, "未定义", "永久"], //水晶幻想曲
    [1702336,0, "未定义", "永久"], //足球钉鞋
    [1702330,0, "未定义", "永久"], //银河星群
    [1702347,0, "未定义", "永久"], //怪盗幻影权杖 
    [1702397,0, "未定义", "永久"]//溢彩银河
];

var gfs = [
    Array(1003393,0, "未定义", "永久"), //帝国伯爵冠
    Array(1102381,0, "未定义", "永久"), //皇家公爵翅膀
    Array(1032233,0, "未定义", "永久"), //粉色桃心耳环
    Array(1002839,0, "未定义", "永久"), //南瓜棒球帽
    Array(5010069,0, "未定义", "永久"), //死神之翼
    Array(1042271,0, "未定义", "永久"), //外星人拼色T恤
    Array(1042321,0, "未定义", "永久"), //心花怒放T恤
    Array(1042260,0, "未定义", "永久"), //点点星光羊毛上衣
    Array(1050284,0, "未定义", "永久"), //派对公子服(男)
    Array(1050302,0, "未定义", "永久"), //执事之品格(男)
    Array(1000052,0, "未定义", "永久"), //公主冠（男）
    Array(1052731,0, "未定义", "永久"), //黑色可爱游泳服
    Array(1052634,0, "未定义", "永久"), //简洁白衬衫
    Array(1052209,0, "未定义", "永久"), //皇家海军制服
    Array(1050152,0, "未定义", "永久"), //水兵服男
    Array(1052201,0, "未定义", "永久"), //闪亮水手外套
    Array(1004108,0, "未定义", "永久"), //幻夜蝶华礼帽
    Array(1003247,0, "未定义", "永久"), //杂技团老板帽
    Array(1003272,0, "未定义", "永久"), //格莱特帽
    Array(1003276,0, "未定义", "永久"), //蓝心透明帽子
    Array(1003271,0, "未定义", "永久"), //红心透明帽子
    Array(1003918,0, "未定义", "永久"), //翅膀帽
    Array(1004029,0, "未定义", "永久"), //小白熊便帽
    Array(1004026,0, "未定义", "永久"), //小黑猫便帽
    Array(1004028,0, "未定义", "永久"), //小花猫便帽
    Array(1004027,0, "未定义", "永久"), //白猫无边帽 
    Array(1003955,0, "未定义", "永久"), //浪漫玫瑰
    Array(1004094,0, "未定义", "永久"), //白巧克力兔子发箍
    Array(1004193,0, "未定义", "永久"), //护目镜帽子
    Array(1003892,0, "未定义", "永久"), //树叶钻石
    Array(1002846,0, "未定义", "永久"), //蓝天贝雷帽
    Array(1002995,0, "未定义", "永久"), //皇家海军帽
    Array(1003748,0, "未定义", "永久"), //皇家天使帽
    Array(1702168,0, "未定义", "永久"), //闪亮圣诞树
    Array(1702278,0, "未定义", "永久"), //枫之武器
    Array(1702211,0, "未定义", "永久"), //亮丽雪片
    Array(1702289,0, "未定义", "永久"), //皇家海军旗帜
    Array(1702287,0, "未定义", "永久"), //唤灵斗师长杖
    Array(1702277,0, "未定义", "永久"), //密码签字笔
    Array(1702309,0, "未定义", "永久"), //多味棒棒糖
    Array(1702155,0, "未定义", "永久"), //绚丽彩虹
    Array(1102605,0, "未定义", "永久"), //暗炎赎罪者
    Array(1102671,0, "未定义", "永久"), //肃清者的荆翼
    Array(1102564,0, "未定义", "永久"), //天衣无缝
    Array(1102267,0, "未定义", "永久")//我的朋友九尾狐尾巴

];



var ns = [
    Array(1051311,0, "未定义", "永久"), //黑暗力量连身衣(女)
    Array(1051199,0, "未定义", "永久"), //樱花服
    Array(1051173,0, "未定义", "永久"), //条纹淑女连衣裙
    Array(1051118,0, "未定义", "永久"), //粉红可爱游泳服
    Array(1051189,0, "未定义", "永久"), //怦然心动装
    Array(1051233,0, "未定义", "永久"), //车模装
    Array(1052410,0, "未定义", "永久"), //粉嫩花仙裙
    Array(1051350,0, "未定义", "永久"), //派对名媛裙
    Array(1051376,0, "未定义", "永久"), //万圣节机器人裙
    Array(1051375,0, "未定义", "永久"), //欧迪尔芭蕾裙
    Array(1051349,0, "未定义", "永久"), //女妖
    Array(1051387,0, "未定义", "永久"), //春游连衣裙
    Array(1051296,0, "未定义", "永久"), //玩世不恭裙装
    Array(1051295,0, "未定义", "永久"), //魔法裙装
    Array(1051294,0, "未定义", "永久"), //抒情裙装 
    Array(1051192,0, "未定义", "永久"), //海洋裹裹短裙  
    Array(1051160,0, "未定义", "永久"), //裹裹短裙
    Array(1052593,0, "未定义", "永久"), //粉红缎带冰淇淋服
    Array(1051303,0, "未定义", "永久"), //抹胸礼裙
    Array(1051261,0, "未定义", "永久"), //童话幻想
    Array(1052419,0, "未定义", "永久"), //粉娃娃群
    Array(1051180,0, "未定义", "永久"), //水兵服女
    Array(1051363,0, "未定义", "永久"), //开场天使
    Array(1051278,0, "未定义", "永久"), //樱桃雪套服
    Array(1051219,0, "未定义", "永久"), //彩虹mini连衣裙
    Array(1051211,0, "未定义", "永久"), //伊丽莎白礼服
    Array(1051221,0, "未定义", "永久"), //圣诞节套服-女
    Array(1051228,0, "未定义", "永久"), //粉红色雪花休闲装
    Array(1051229,0, "未定义", "永久"), //花少女韩服
    Array(1051231,0, "未定义", "永久"), //阿尔卑斯山少女装
    Array(1051232,0, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1052656,0, "未定义", "永久"), //白天鹅芭蕾服
    Array(1051235,0, "未定义", "永久"), //橙色小鸡裙子
    Array(1051252,0, "未定义", "永久"), //粉红天使制服
    Array(1051253,0, "未定义", "永久"), //红帽迷你裙
    Array(1051254,0, "未定义", "永久"), //萝莉学生装
    Array(1052295,0, "未定义", "永久"), //粉红色女仆装
    Array(1052296,0, "未定义", "永久"), //天蓝色女仆装
    Array(1052298,0, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052225,0, "未定义", "永久"), //暗夜娃娃服
    Array(1052306,0, "未定义", "永久"), //雪姬和服
    Array(1041142,0, "未定义", "永久"), //巨星蛋糕吊带
    Array(1041127,0, "未定义", "永久"), //爱心背心
    Array(1041189,0, "未定义", "永久"), //女牛仔衬衫
    Array(1001076,0, "未定义", "永久"), //樱桃雪水晶
    Array(1001064,0, "未定义", "永久"), //闪耀Girl帽子
    Array(1001083,0, "未定义", "永久"), //爆莉萌天使发卡
    Array(1001044,0, "未定义", "永久"), //绿色婚纱头纱
    Array(1001061,0, "未定义", "永久"), //伊丽莎白假发(女)
    Array(1001068,0, "未定义", "永久"), //军团长假发-女
    Array(1001069,0, "未定义", "永久"), //精灵王假发-女
    Array(1001094,0, "未定义", "永久"), //蓝色蕾丝头巾
    Array(1001089,0, "未定义", "永久"), //兔子胡萝卜绒线帽
    Array(1001085,0, "未定义", "永久"), //粉蝴蝶发卡
    Array(1061148,0, "未定义", "永久"), //巨星粉色短裙
    Array(1061001,0, "未定义", "永久"), //蓝超短裙
    Array(1061007,0, "未定义", "永久"), //红超短裙 
    Array(1061126,0, "未定义", "永久"), //白色超短裙
    Array(1061067,0, "未定义", "永久"), //热裤
    Array(1081007,0, "未定义", "永久")//伊丽莎白手套
];

var qltz = [
    Array(1061001,0, "未定义", "永久"), //邦妮女孩套服
    Array(1061007,0, "未定义", "永久"), //邦妮男孩套服
    Array(1061124,0, "未定义", "永久"), //MapleBoy套服
    Array(1061126,0, "未定义", "永久"), //MapleGirl套服
    Array(1061138,0, "未定义", "永久"), //快乐连体衫
    Array(1061148,0, "未定义", "永久"), //快乐连衣裙
    Array(1061204,0, "未定义", "永久"), //可爱棒球服（女）
    Array(1062054,0, "未定义", "永久"), //可爱棒球服（男）
    Array(1062073,0, "未定义", "永久"), //蓝色钱包君（男）
    Array(1062074,0, "未定义", "永久"), //粉色钱包君（女）
    Array(1062093,0, "未定义", "永久"), //小娃娃普卡（男）
    Array(1062094,0, "未定义", "永久"), //小娃娃皮卡（女）
    Array(1062110,0, "未定义", "永久"), //海滩帅锅装（男）
    Array(1062210,0, "未定义", "永久"), //海滩美眉装
    Array(1062227,0, "未定义", "永久"), //海滩帅锅装
    Array(1062085,0, "未定义", "永久"), //蓝色小背带服
    Array(1062084,0, "未定义", "永久"), //蓝色小背带裙
    Array(1042104,0, "未定义", "永久"), //蓝色小背带裙

    Array(1062153,0, "未定义", "永久"), //邦妮女孩套服
    Array(1062130,0, "未定义", "永久"), //邦妮男孩套服
    Array(1062129,0, "未定义", "永久"), //MapleBoy套服
    Array(1062053,0, "未定义", "永久"), //MapleGirl套服
    Array(1062066,0, "未定义", "永久"), //快乐连体衫
    Array(1062111,0, "未定义", "永久"), //快乐连衣裙
    Array(1062113,0, "未定义", "永久"), //可爱棒球服（女）
    Array(1062114,0, "未定义", "永久"), //可爱棒球服（男）
    Array(1062152,0, "未定义", "永久"), //蓝色钱包君（男）
    Array(1062154,0, "未定义", "永久"), //粉色钱包君（女）
    Array(1062156,0, "未定义", "永久"), //小娃娃普卡（男）
    Array(1062157,0, "未定义", "永久"), //小娃娃皮卡（女）

    Array(1051200,0, "未定义", "永久"), //邦妮女孩套服
    Array(1050161,0, "未定义", "永久"), //邦妮男孩套服
    Array(1050177,0, "未定义", "永久"), //MapleBoy套服
    Array(1051218,0, "未定义", "永久"), //MapleGirl套服
    Array(1052727,0, "未定义", "永久"), //快乐连体衫
    Array(1052728,0, "未定义", "永久"), //快乐连衣裙
    Array(1051357,0, "未定义", "永久"), //可爱棒球服（女）
    Array(1050291,0, "未定义", "永久"), //可爱棒球服（男）
    Array(1000072,0, "未定义", "永久"), //蓝色钱包君（男）
    Array(1001095,0, "未定义", "永久"), //粉色钱包君（女）
    Array(1050299,0, "未定义", "永久"), //小娃娃普卡（男）
    Array(1051366,0, "未定义", "永久"), //小娃娃皮卡（女）
    Array(1050293,0, "未定义", "永久"), //海滩帅锅装（男）
    Array(1051359,0, "未定义", "永久"), //海滩美眉装
    Array(1050293,0, "未定义", "永久"), //海滩帅锅装
    Array(1050210,0, "未定义", "永久"), //蓝色小背带服
    Array(1051256,0, "未定义", "永久"), //蓝色小背带裙
    Array(1050209,0, "未定义", "永久"), //黄色晚礼服-男款
    Array(1051255,0, "未定义", "永久"), //黄色晚礼服-女款
    Array(1042213,0, "未定义", "永久"), //粉色雪花卫衣
    Array(1042212,0, "未定义", "永久"), //蓝色点点外套
    Array(1042216,0, "未定义", "永久"), //红色枫叶网球服
    Array(1042217,0, "未定义", "永久"), //黑色枫叶网球服
    Array(1048001,0, "未定义", "永久"), //兔兔情侣衫  
    Array(1048002,0, "未定义", "永久"), //胡萝卜情侣衫 
    Array(1042313,0, "未定义", "永久"), //魔蘑菇T恤（柠檬黄）
    Array(1042312,0, "未定义", "永久"), //魔蘑菇T恤（冰雪蓝）
    Array(1042316,0, "未定义", "永久"), //粉色萌萌象
    Array(1042315,0, "未定义", "永久"), //蓝色萌萌象
    Array(1050190,0, "未定义", "永久"), //闪烁之星男生礼服
    Array(1051232,0, "未定义", "永久"), //闪烁之星女孩礼服
    Array(1050310,0, "未定义", "永久"), //天生购物狂（男）
    Array(1051382,0, "未定义", "永久"), //天生购物狂（女）
    Array(1050318,0, "未定义", "永久"), //纯白礼服（男）
    Array(1051389,0, "未定义", "永久"), //纯白婚纱(女)
    Array(1050296,0, "未定义", "永久"), //超级巨星服（男）
    Array(1051362,0, "未定义", "永久"), //超级巨星（女）
    Array(1050300,0, "未定义", "永久"), //蓝色雪糕帅锅装
    Array(1051367,0, "未定义", "永久"), //蓝色雪糕MM装
    Array(1050145,0, "未定义", "永久"), //粉露肩晚礼服（男）
    Array(1051123,0, "未定义", "永久"), //粉露肩晚礼服（女）
    Array(1051372,0, "未定义", "永久"), //巧克力女孩
    Array(1050304,0, "未定义", "永久"), //巧克力男孩
    Array(1051368,0, "未定义", "永久"), //粉格纹假日装（女）
    Array(1050301,0, "未定义", "永久"), //蓝色格纹假日服（男）
    Array(1000070,0, "未定义", "永久"), //贵族骑手帽(男)
    Array(1001093,0, "未定义", "永久"), //贵族骑手帽（女）
    Array(1050312,0, "未定义", "永久"), //贵族骑手装(男)
    Array(1051384,0, "未定义", "永久")//贵族骑手装（女）

];

var stxz = [
    Array(1082511,0, "未定义", "永久"), //小恐龙绿豆手套
    Array(1082519,0, "未定义", "永久"), //小恐龙云豆手套
    Array(1082312,0, "未定义", "永久"), //彩虹护腕
    Array(1082493,0, "未定义", "永久"), //海豹白白手套
    Array(1082581,0, "未定义", "永久"), //巧克力发带装饰
    Array(1082549,0, "未定义", "永久"), //咯咯嗒手套
    Array(1082503,0, "未定义", "永久"), //圣洁天使手镯
    Array(1082548,0, "未定义", "永久"), //星星手镯
    Array(1082502,0, "未定义", "永久"), //蓝缎带猫咪爪
    Array(1072336,0, "未定义", "永久"), //足球钉鞋
    Array(1072869,0, "未定义", "永久"), //时间旅行者的高跟鞋
    Array(1072924,0, "未定义", "永久"), //未来天使靴
    Array(1072931,0, "未定义", "永久"), //爱丽丝鞋子
    Array(1072911,0, "未定义", "永久"), //肃清者暗靴
    Array(1072897,0, "未定义", "永久"), //蓝色鹿皮鞋
    Array(1072901,0, "未定义", "永久"), //五彩珠鞋
    Array(1072876,0, "未定义", "永久"), //卡卡奥熊掌鞋
    Array(1072917,0, "未定义", "永久"), //小马乖乖鞋
    Array(1072662,0, "未定义", "永久"), //怀旧闪耀
    Array(1072820,0, "未定义", "永久"), //怀旧熊仔鞋
    Array(1072852,0, "未定义", "永久"), //超级巨星鞋子
    Array(1072803,0, "未定义", "永久"), //小恐龙云豆爪爪
    Array(1072662,0, "未定义", "永久"), //小恐龙绿豆爪爪
    Array(1072791,0, "未定义", "永久"), //蓝缎带猫咪鞋
    Array(1072388,0, "未定义", "永久"), //女仆礼鞋 
    Array(1072439,0, "未定义", "永久"), //采草莓礼鞋
    Array(1072923,0, "未定义", "永久"), //波点娃娃鞋
    Array(1072848,0, "未定义", "永久"), //血腥吊带袜
    Array(1071026,0, "未定义", "永久"), //巨星潮流靴
    Array(1072662,0, "未定义", "永久"), //露西亚运动鞋
    Array(1072407,0, "未定义", "永久"), //HELLO喵喵拖
    Array(1072438,0, "未定义", "永久"), //小嫩叶鞋
    Array(1072437,0, "未定义", "永久"), //PB拖拖
    Array(1072482,0, "未定义", "永久"), //熊猫拖
    Array(1072484,0, "未定义", "永久"), //黑猫拖
    Array(1072514,0, "未定义", "永久"), //天使翅膀帆布鞋
    Array(1072515,0, "未定义", "永久"), //狮子宝宝拖
    Array(1072516,0, "未定义", "永久"), //新手小鸡拖
    Array(1072517,0, "未定义", "永久"), //天使羽翼
    Array(1072531,0, "未定义", "永久"), //考拉拖鞋
    Array(1072663,0, "未定义", "永久"), //蓝色天使鞋
    Array(1072749,0, "未定义", "永久"), //泡泡巧克力鞋子
    Array(1072448,0, "未定义", "永久")//皇家彩虹鞋

];


var status = 0;
var xx = -1;
var jiage = -1;

function start() {
    点券 = cm.getPlayer().getCSPoints(1);
    status = -1;
    action(1, 0, 0);
}


function action(mode, type, selection) {
    if (mode == -1) {
        cm.sendOk("#b好的,下次再见.");
        cm.dispose();
    } else {

        if (mode == 0) {
            cm.sendOk("#b好的,下次再见.");
            cm.dispose();
            return;
        }

        if (mode == 1) {
            status++;
        } else {
            status--;
        }

        //---------------------------------------------------------------------------------
			var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
			var 皇冠白 ="#fUI/GuildMark/Mark/Etc/00009004/15#";
			var 粉心 = "#fEffect/CharacterEff/1042176/2/0#";
			var 红心 = "#fEffect/CharacterEff/1082229/0/0#";
			var 粉星 = "#fEffect/CharacterEff/1112926/0/1#";
			var 标注 = "#fUI/Login/WorldSelect/channel/chEvent/3#";
			var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
			var text = "";

        if (status == 0) {

            //if (selection == 0) {

			text  = "\r\n";
			 text += "                 "+皇冠白+" - #b#e时装商城#n - "+皇冠白+"\r\n";
			text += "    #b┌------------------------------------------┐\r\n";

            text += "	#L1#精美时装#l#L2#戒指名片#l#L14#手套鞋子#l#L3 #新增时装#l\r\n\r\n";

            text += "	#L5#宠物系列#l#L7#精美披风#l#L10#精品武器#l\r\n\r\n";

            text += "	#L8#精美帽子#l#L9#精美饰品#l#L13#情侣套装#l#L12#我是女神#l#k\r\n\r\n";
			
			text += "    #b└------------------------------------------┘#l\r\n";
			text += "                 "+皇冠白+" - #r#e动漫时装#n - "+皇冠白+"\r\n"; 
			text += "    ┌------------------------------------------┐\r\n";
			
            text += "\t\t\t\t\t#L100#动漫时装#l\r\n\r\n";
			
			text += "    └------------------------------------------┘#l\r\n";
            cm.sendSimple(text);
				//#L6#精美武器#l #r#L10#特效武器#k#l
            //}

        //////////////////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 1) {
            if (selection == 100) {cm.dispose();cm.openNpc(9900004,"动漫时装");return;}
            if (selection == 101) {cm.dispose();cm.openNpc(9900004,"最新武器");return;}
            if (selection == 102) {cm.dispose();cm.openNpc(9900004,"最新披风");return;}
            if (selection == 103) {cm.dispose();cm.openNpc(9900004,"最新鞋子");return;}
            if (selection == 104) {cm.dispose();cm.openNpc(9900004,"最新手套");return;}
            if (selection == 105) {cm.dispose();cm.openNpc(9900004,"最新帽子");return;}
            if (selection == 106) {cm.dispose();cm.openNpc(9900004,"最新上衣");return;}
            if (selection == 107) {cm.dispose();cm.openNpc(9900004,"最新裤裙");return;}

            if (selection == 1) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美时装#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jmsz.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jmsz[i][0] + ":##z" + jmsz[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jmsz[i][1] + " #d使用期限:#r " + jmsz[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 1
            } else if (selection == 2) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jzmp.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jzmp[i][0] + ":##z" + jzmp[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jzmp[i][1] + " #d使用期限:#r " + jzmp[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 2
            } else if (selection == 3) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>新增时装#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < tjId.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + tjId[i][0] + ":##z" + tjId[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + tjId[i][1] + " #d使用期限:#r " + tjId[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 3;

            } else if (selection == 4) {

                var text = "欢迎来到#r冒险岛#k,下面是本服的游戏商城区.\r\n\r\n";

                text += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                text += "   当前剩余点卷:#r" + 点券 + "\r\n#b";

                for (var i = 0; i < syxh.length; i++) {

                    text += "\r\n#L" + i + "##v" + syxh[i][0] + ":##z" + syxh[i][0] + "##l#d\r\n\r\n		";

                    text += "需要点卷:#r " + syxh[i][1] + " #d    购买数量:#r " + syxh[i][3] + "#k#b";


                }
                cm.sendSimple(text);
                xx = 4;

            } else if (selection == 5) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>宠物系列#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < xswp.length; i++) {

					text += " ┏━━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + xswp[i][0] + ":##z" + xswp[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + xswp[i][1] + " #d使用期限:#r " + xswp[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 5
            } else if (selection == 6) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jmwq.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jmwq[i][0] + ":##z" + jmwq[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jmwq[i][1] + " #d使用期限:#r " + jmwq[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 6
            } else if (selection == 7) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jmpf.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jmpf[i][0] + ":##z" + jmpf[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jmpf[i][1] + " #d使用期限:#r " + jmpf[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 7
            } else if (selection == 8) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jmmz.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jmmz[i][0] + ":##z" + jmmz[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jmmz[i][1] + " #d使用期限:#r " + jmmz[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 8
            } else if (selection == 9) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < jmsp.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + jmsp[i][0] + ":##z" + jmsp[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + jmsp[i][1] + " #d使用期限:#r " + jmsp[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 9
            } else if (selection == 10) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>特效武器#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < txwq.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + txwq[i][0] + ":##z" + txwq[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + txwq[i][1] + " #d使用期限:#r " + txwq[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 10
            } else if (selection == 11) {

                var text = "欢迎来到#r冒险岛#k,下面是本服的游戏商城区.\r\n\r\n";

                text += "   您当前位置:#b商城首页>>点卷商城>>我是高富帅#k\r\n\r\n";

                text += "   当前剩余点卷:#r" + 点券 + "#k\r\n#b";

                for (var i = 0; i < gfs.length; i++) {

                    text += "\r\n#L" + i + "##v" + gfs[i][0] + ":##z" + gfs[i][0] + "##l#d\r\n\r\n		";

                    text += "需要点卷:#r " + gfs[i][1] + " #d    使用期限:#r " + gfs[i][3] + "#k#b";

                }

                cm.sendSimple(text);

                xx = 11


            } else if (selection == 12) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>女神专区#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < ns.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + ns[i][0] + ":##z" + ns[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + ns[i][1] + " #d使用期限:#r " + ns[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 12
            } else if (selection == 13) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>情侣专区#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

                for (var i = 0; i < qltz.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + qltz[i][0] + ":##z" + qltz[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + qltz[i][1] + " #d使用期限:#r " + qltz[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 13
            } else if (selection == 14) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n";
                text += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n";

                for (var i = 0; i < stxz.length; i++) {

					text += " ┏━━━━━━━━━━━━━━┓#r\r\n"
                    text += "#L" + i + "##v" + stxz[i][0] + ":##z" + stxz[i][0] + "##l#d\r\n\r\n    ";
                    text += "需要点卷:#r " + stxz[i][1] + " #d使用期限:#r " + stxz[i][3] + "#k\r\n";
					text += " ┗━━━━━━━━━━━━━━┛\r\n"

                }
                cm.sendSimple(text);
                xx = 14
            }

        ////////////////////////////////////////////////////////////////////////////////////
        } else if (status == 2) {
			var 物品购买 = "#fUI/UIWindow/PersonalShop/BtBuy/mouseOver/0#";

            if (xx == 1) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jmsz[selection][0] + "# #z" + jmsz[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jmsz[selection][1] + " #k使用期限:#r " + jmsz[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L1#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 2) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美名片#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jzmp[selection][0] + "# #z" + jzmp[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jzmp[selection][1] + " #k使用期限:#r " + jzmp[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L2#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 3) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>新增时装#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + tjId[selection][0] + "# #z" + tjId[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + tjId[selection][1] + " #k使用期限:#r " + tjId[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L3#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 4) {

                var text = "欢迎来到#r◆◇◆本服#k,下面是本服的游戏商城区.\r\n\r\n";

                text += "   您当前位置:#b商城首页>>使用消耗#k\r\n\r\n";

                text += "   当前剩余点卷:#r" + 点券 + "\r\n\r\n#d";

                text += "   物品:#v" + syxh[selection][0] + "# #z" + syxh[selection][0] + "#\r\n\r\n";

                text += "   需要点卷:#r" + syxh[selection][1] + " #d    购买数量:#r " + syxh[selection][3] + "\r\n                              ";

                text += "   #L4#"+物品购买+"#l";

                cm.sendSimple(text);

                jiage = selection;


            }

            if (xx == 5) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>宠物系列#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + xswp[selection][0] + "# #z" + xswp[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + xswp[selection][1] + " #k使用期限:#r " + xswp[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L5#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 6) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美武器#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jmwq[selection][0] + "# #z" + jmwq[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jmwq[selection][1] + " #k使用期限:#r " + jmwq[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L6#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 7) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美披风#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jmpf[selection][0] + "# #z" + jmpf[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jmpf[selection][1] + " #k使用期限:#r " + jmpf[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L7#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 8) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美帽子#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jmmz[selection][0] + "# #z" + jmmz[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jmmz[selection][1] + " #k使用期限:#r " + jmmz[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L8#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 9) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>精美饰品#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + jmsp[selection][0] + "# #z" + jmsp[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + jmsp[selection][1] + " #k使用期限:#r " + jmsp[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L9#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 10) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>特效武器#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + txwq[selection][0] + "# #z" + txwq[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + txwq[selection][1] + " #k使用期限:#r " + txwq[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L10#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 11) {

                var text = "欢迎来到#r◆◇◆本服#k,下面是本服的游戏商城区.\r\n\r\n";

                text += "   您当前位置:#b商城首页>>点卷商城>>我要当高富帅#k\r\n\r\n";

                text += "   当前剩余点卷:#r" + 点券 + "#k\r\n\r\n#d";

                text += "   物品:#v" + gfs[selection][0] + "# #z" + gfs[selection][0] + "#\r\n\r\n";

                text += "   需要点卷:#r " + gfs[selection][1] + " #d    使用期限:#r " + gfs[selection][3] + "\r\n                              ";

                text += "   #L11#"+物品购买+"#l";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 12) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>女神专区#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + ns[selection][0] + "# #z" + ns[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + ns[selection][1] + " #k使用期限:#r " + ns[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L12#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 13) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>情侣专区#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + qltz[selection][0] + "# #z" + qltz[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + qltz[selection][1] + " #k使用期限:#r " + qltz[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L13#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }
            if (xx == 14) {
                var text = "\r\n";
                text += " ┏ 当前剩余点卷:#r" + 点券 + "#k\r\n";
				text += " ┏━━━━━━━━━━━━━━━━━━━━┓#r\r\n"
                text += "   您当前位置:#b商城首页>>点卷商城>>手套鞋子#k\r\n";
				text += " ┗━━━━━━━━━━━━━━━━━━━━┛\r\n"

				text += " ┏━━━━━━━━━━━━━━┓\r\n";
                text += "   物品:#v" + stxz[selection][0] + "# #z" + stxz[selection][0] + "#\r\n\r\n";
                text += "   需要点卷:#r " + stxz[selection][1] + " #k使用期限:#r " + stxz[selection][3] + "#k\r\n" 
				text += " ┗━━━━━━━━━━━━━━┛#L14#"+物品购买+"#l\r\n";
                cm.sendSimple(text);
                jiage = selection;
            }

        ///////////////////////////////////////////////////////////////////////////////////////////

        } else if (status == 3) {


            if (selection == 1) {
                if (点券 >= jmsz[jiage][1]) {
                    cm.gainItem(jmsz[jiage][0], 0);
					//item = cm.gainGachaponItem(jmsz[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					item = cm.gainGachaponItem(jmsz[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					//cm.道具喇叭(item,"恭喜 ["+cm.getPlayer().getName()+"]免费获得此时装！");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jmsz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 2) {
                if (点券 >= jzmp[jiage][1]) {
					item = cm.gainGachaponItem(jzmp[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jzmp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 3) {
                if (点券 >= tjId[jiage][1]) {
                    //cm.gainItem(tjId[jiage][0], 1);
					item = cm.gainGachaponItem(tjId[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -tjId[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }
            } else if (selection == 4) {
                if (点券 >= syxh[jiage][1]) {
					item = cm.gainGachaponItem(syxh[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 50 + "个。");
						cm.gainNX( -syxh[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }


            } else if (selection == 5) {//Array(5000077,9999,"未定义","90天"),//波斯猫
                if (点券 >= xswp[jiage][1]) {
                    cm.sendOk("#b购买成功,请查看背包.");
					cm.gainNX( -xswp[jiage][1]);
					cm.gainPet(xswp[jiage][0],xswp[jiage][2],1, 0, 100, 0, 1);
					//cm.gainPet(xswp[jiage][0],xswp[jiage][2],1, 0, 100, 0, 1);
                    
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请登陆网站冲值.");
                    cm.dispose();
                }

            } else if (selection == 6) {
                if (点券 >= jmwq[jiage][1]) {
					item = cm.gainGachaponItem(jmwq[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jmwq[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 7) {
                if (点券 >= jmpf[jiage][1]) {
					item = cm.gainGachaponItem(jmpf[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jmpf[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 8) {
                if (点券 >= jmmz[jiage][1]) {
					item = cm.gainGachaponItem(jmmz[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jmmz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 9) {
                if (点券 >= jmsp[jiage][1]) {
					item = cm.gainGachaponItem(jmsp[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -jmsp[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 10) {
                if (点券 >= txwq[jiage][1]) {
					item = cm.gainGachaponItem(txwq[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -txwq[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 11) {
                if (点券 >= gfs[jiage][1]) {
					item = cm.gainGachaponItem(gfs[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.getPlayer().modifyCSPoints(1, -gfs[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }


            } else if (selection == 12) {
                if (点券 >= ns[jiage][1]) {
					item = cm.gainGachaponItem(ns[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -ns[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 13) {
                if (点券 >= qltz[jiage][1]) {
					item = cm.gainGachaponItem(qltz[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -qltz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }

            } else if (selection == 14) {
                if (点券 >= stxz[jiage][1]) {
					item = cm.gainGachaponItem(stxz[jiage][0], 1 , "现金商城",1, "成功购买了一件时装");
					if (item != -1) {
						cm.sendOk("你获得了 #b#t" + item + "##k " + 1 + "个。");
						cm.gainNX( -stxz[jiage][1]);
					} else {
						cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
					}
					status = -1;
                    
                } else {
                    cm.sendOk("#b您没有足够的点卷进行购买,请充值.");
                    cm.dispose();
                }
            }
        }
    }
}