var LJ = "#fEffect/CharacterEff/1082565/2/0#";  //蓝兔子
var mi0 = "┏━━━━━━━━━━━┓";
var mi1 = "┃     - XiaoMiMS -     ┃";
var mi2 = "┃ 脚本仿制  　定制脚本 ┃";
var mi3 = "┃ 技术支持 　 游戏顾问 ┃";
var mi4 = "┃ ＷＺ添加　  地图制作 ┃";
var mi5 = "┣━━━━━━━━━━━┫";
var mi6 = "┃　唯一QQ:1408745    ┃";
var mi7 = "┗━━━━━━━━━━━┛";
var 抽奖中心 = "#fEffect/CharacterEff1.img/QQ1408745/0/5#";
var xiaomi = {        	
	开关: 0, 玩家: "南山" , 变量: "暗操中奖记录_01" , 物品: 1112666 ,
	喇叭开关:1 ,
	
};

status = -1;
var itemList = new Array(
/*[1702330,50,1,1],
[1702334,50,1,1],
[1702347,50,1,1],
[1702348,50,1,1],
[1702352,50,1,1],
[1702367,50,1,1],
[1702368,50,1,1],
[1702370,50,1,1],
[1702375,50,1,1],
[1702379,50,1,1],
[1702390,50,1,1],
[1702397,50,1,1],
[1702399,50,1,1],
[1702400,50,1,1],
[1702404,50,1,1],
[1702405,50,1,1],
[1702406,50,1,1],
[1702420,50,1,1],
[1702423,50,1,1],
[1702426,50,1,1],
[1702428,50,1,1],
[1702429,50,1,1],
[1702433,50,1,1],
[1702438,50,1,1],
[1702439,50,1,1],
[1702440,50,1,1],
[1702444,50,1,1],
[1702453,50,1,1],
[1702454,50,1,1],
[1702455,50,1,1],
[1702456,50,1,1],
[1702457,50,1,1],
[1702458,50,1,1],
[1702459,50,1,1],
[1702462,50,1,1],
[1702463,50,1,1],
[1702469,50,1,1],
[1702473,50,1,1],
[1702476,50,1,1],
[1702480,50,1,1],
[1702484,50,1,1],
[1702485,50,1,1],
[1702487,50,1,1],
[1702490,50,1,1],
[1702491,50,1,1],
[1702492,50,1,1],
[1702497,50,1,1],
[1702499,50,1,1],
[1702501,50,1,1],
[1702504,50,1,1],
[1702505,50,1,1],
[1702509,50,1,1],
[1702512,50,1,1],
[1702520,50,1,1],
[1702523,50,1,1],
[1702528,50,1,1],
[1702530,50,1,1],
[1702532,50,1,1],
[1702533,50,1,1],
[1702534,50,1,1],
[1702535,50,1,1],
[1702537,50,1,1],
[1702538,50,1,1],
[1702542,50,1,1],
[1702543,50,1,1],
[1702547,50,1,1],
[1702549,50,1,1],
[1702551,50,1,1],
[1702557,50,1,1],
[1702560,50,1,1],
[1702562,50,1,1],
[1702565,50,1,1],
[1702566,50,1,1],
[1702567,50,1,1],
[1702568,50,1,1],
[1702569,50,1,1],
[1702570,50,1,1],
[1702571,50,1,1],
[1702573,50,1,1],
[1702574,50,1,1],
[1702575,50,1,1],
[1702576,50,1,1],
[1702577,50,1,1],
[1702579,50,1,1],
[1702581,50,1,1],
[1702582,50,1,1],
[1702583,50,1,1],
[1702584,50,1,1],
[1702587,50,1,1],
[1702591,50,1,1],
[1702593,50,1,1],
[1702595,50,1,1],
[1702597,50,1,1],
[1702598,50,1,1],
[1702607,50,1,1],
[1702608,50,1,1],
[1702609,50,1,1],
[1702611,50,1,1],
[1702617,50,1,1],
[1702618,50,1,1],
[1702624,50,1,1],
[1702625,50,1,1],
[1702626,50,1,1],
[1702627,50,1,1],
[1702628,50,1,1],
[1702629,50,1,1],
[1702630,50,1,1],
[1702631,50,1,1],
[1702633,50,1,1],
[1702635,50,1,1],
[1702636,50,1,1],
[1702637,50,1,1],
[1702640,50,1,1],
[1702659,50,1,1],
[1702660,50,1,1],
[1702664,50,1,1],
[1702669,50,1,1],
[1702670,50,1,1],
[1702671,50,1,1],
[1702674,50,1,1],
[1702675,50,1,1],
[1702676,50,1,1],
[1702680,50,1,1],
[1702681,50,1,1],
[1702683,50,1,1],
[1702684,50,1,1],
[1702685,50,1,1],
[1702687,50,1,1],
[1702688,50,1,1],
[1702689,50,1,1],
[1702690,50,1,1],
[1702694,50,1,1],
[1702702,50,1,1],
[1702703,50,1,1],
[1702705,50,1,1],
[1702706,50,1,1],
[1702707,50,1,1],
[1702713,50,1,1],
[1702714,50,1,1],
[1702715,50,1,1],
[1702717,50,1,1],
[1702718,50,1,1],
[1702720,50,1,1],
[1702722,50,1,1],
[1702724,50,1,1],
[1702726,50,1,1],
[1702727,50,1,1],
[1702728,50,1,1],
[1702729,50,1,1],
[1702733,50,1,1],
[1702735,50,1,1],
[1702737,50,1,1],
[1702739,50,1,1],
[1702740,50,1,1],
[1702741,50,1,1],
[1702742,50,1,1],
[1702744,50,1,1],
[1702745,50,1,1],
[1702746,50,1,1],
[1702747,50,1,1],
[1702748,50,1,1],
[1702749,50,1,1],
[1702750,50,1,1],
[1702752,50,1,1],
[1702754,50,1,1],
[1702755,50,1,1],
[1702756,50,1,1],
[1702758,50,1,1],
[1702759,50,1,1],
[1702761,50,1,1],
[1702765,50,1,1],
[1702766,50,1,1],
[1702770,50,1,1],
[1702772,50,1,1],
[1702773,50,1,1],
[1702774,50,1,1],
[1702775,50,1,1],
[1702776,50,1,1],
[1702777,50,1,1],
[1702778,50,1,1],
[1702779,50,1,1],
[1702780,50,1,1],
[1702781,50,1,1],
[1702782,50,1,1],
[1702783,50,1,1],
[1702784,50,1,1],
[1702785,50,1,1],
[1702787,50,1,1],
[1702788,50,1,1],
[1702789,50,1,1],
[1702790,50,1,1],
[1702792,50,1,1],
[1702793,50,1,1],
[1702794,50,1,1],
[1702795,50,1,1],
[1702796,50,1,1],
[1702797,50,1,1],
[1702798,50,1,1],
[1702802,50,1,1],
[1702803,50,1,1],
[1702804,50,1,1],
[1702805,50,1,1],
[1702806,50,1,1],
[1702807,50,1,1],
[1702808,50,1,1],
[1702809,50,1,1],
[1702810,50,1,1],
[1702812,50,1,1],
[1702813,50,1,1],
[1702814,50,1,1],
[1702815,50,1,1],
[1702816,50,1,1],
[1702817,50,1,1],
[1702818,50,1,1],
[1702819,50,1,1],
[1702820,50,1,1],
[1702821,50,1,1],
[1702822,50,1,1],
[1702823,50,1,1],
[1702825,50,1,1],
[1702827,50,1,1],
[1702830,50,1,1],
[1702832,50,1,1],
[1702833,50,1,1],
[1702838,50,1,1],
[1702839,50,1,1],
[1702841,50,1,1],
[1702844,50,1,1],
[1702845,50,1,1],
[1702849,50,1,1],
[1702850,50,1,1],
[1702851,50,1,1],
[1702852,50,1,1],
[1702853,50,1,1],
[1702858,50,1,1],
[1702859,50,1,1],
[1702860,50,1,1],
[1702861,50,1,1],
[1702862,50,1,1],
[1702863,50,1,1],
[1702864,50,1,1],
[1702865,50,1,1],
[1702866,50,1,1],
[1702867,50,1,1],
[1702870,50,1,1],
[1702871,50,1,1],
[1702872,50,1,1],
[1702874,50,1,1],
[1702875,50,1,1],
[1702877,50,1,1],
[1702878,50,1,1],
[1702879,50,1,1],
[1702880,50,1,1],
[1702881,50,1,1],
[1702882,50,1,1],
[1702884,50,1,1],
[1702887,50,1,1],
[1702888,50,1,1],
[1702891,50,1,1],
[1702900,50,1,1],
[1702901,50,1,1],
[1702902,50,1,1],
[1702906,50,1,1],
[1702907,50,1,1],
[1702908,50,1,1],
[1702909,50,1,1],
[1702910,50,1,1],
[1702911,50,1,1],
[1702912,50,1,1],
[1702913,50,1,1],
[1702914,50,1,1],
[1702929,50,1,1],
[1702931,50,1,1],
[1702932,50,1,1],
[1702933,50,1,1],
[1702937,50,1,1],
[1702939,50,1,1],
[1702940,50,1,1],
[1702941,50,1,1],
[1702942,50,1,1],
[1702943,50,1,1],
[1702945,50,1,1],
[1702946,50,1,1],
[1702952,50,1,1],
[1702959,50,1,1],
[1702960,50,1,1],
[1702964,50,1,1],
[1702967,50,1,1],*/
[1702968,50,1,1],
[1702970,50,1,1],
[1702972,50,1,1],
[1702980,50,1,1],
[1702981,50,1,1],
[1702983,50,1,1],
[1702984,50,1,1],
[1702985,50,1,1],
[1702986,50,1,1],
[1702988,50,1,1],
[1702990,50,1,1],
[1702991,50,1,1],
[1702993,50,1,1],
[1702995,50,1,1],
[1702996,50,1,1],
[1702998,50,1,1],
[1703010,50,1,1],
[1703011,50,1,1],
[1703014,50,1,1],
[1703017,50,1,1],
[1703019,50,1,1],
[1703021,50,1,1],
[1703023,50,1,1],
[1703024,50,1,1],
[1703026,50,1,1],
[1703027,50,1,1],
[1703028,50,1,1],
[1703029,50,1,1],
[1703031,50,1,1],
[1703032,50,1,1],
[1703033,50,1,1],
[1703034,50,1,1],
[1703036,50,1,1],
[1703037,50,1,1],
[1703041,50,1,1],
[1703044,50,1,1],
[1703046,50,1,1],
[1703047,50,1,1],
[1703048,50,1,1],
[1703050,50,1,1],
[1703051,50,1,1],
[1703055,50,1,1],
[1703059,50,1,1],
[1703066,50,1,1],
[1703067,50,1,1],
[1703068,50,1,1],
[1703074,50,1,1],
[1703078,50,1,1],
[1703079,50,1,1],
[1703083,50,1,1],
[1703085,50,1,1],
[1703086,50,1,1],
[1703088,50,1,1],
[1703092,50,1,1],
[1703093,50,1,1],
[1703095,50,1,1],
[1703096,50,1,1],
[1703098,50,1,1],
[1703100,50,1,1],
[1703103,50,1,1],
[1703104,50,1,1],
[1703108,50,1,1],
[1703110,50,1,1],
[1703111,50,1,1],
[1703112,50,1,1],
[1703114,50,1,1],
[1703116,50,1,1],
[1703117,50,1,1],
[1703119,50,1,1],
[1703120,50,1,1],
[1703122,50,1,1],
[1703123,50,1,1],
[1703127,50,1,1],
[1703132,50,1,1],
[1703133,50,1,1],
[1703134,50,1,1],
[1703135,50,1,1],
[1703138,50,1,1],
[1703139,50,1,1],
[1703145,50,1,1],
[1703146,50,1,1],
[1703148,50,1,1],
[1703149,50,1,1],
[1703150,50,1,1],
[1703157,50,1,1],
[1703164,50,1,1],
[1703165,50,1,1],
[1703171,50,1,1],
[1703193,50,1,1],
[1703194,50,1,1],
[1703195,50,1,1],
[1703207,50,1,1],
[1703213,50,1,1],
[1703217,50,1,1],
[1703220,50,1,1],
[1703221,50,1,1],
[1703222,50,1,1],
[1703223,50,1,1],
[1703225,50,1,1],
[1703231,50,1,1],
[1703232,50,1,1],
[1703234,50,1,1],
[1703246,50,1,1],
[1703247,50,1,1],
[1703251,50,1,1],
[1703256,50,1,1],
[1703261,50,1,1],
[1703262,50,1,1],
[1703263,50,1,1],
[1703264,50,1,1],
[1703272,50,1,1],
[1703273,50,1,1],
[1703274,50,1,1],
[1703275,50,1,1],
[1703277,50,1,1],
[1703278,50,1,1],
[1703279,50,1,1],
[1703283,50,1,1],
[1703286,50,1,1],
[1703291,50,1,1],
[1703292,50,1,1],
[1703293,50,1,1],
[1703294,50,1,1],
[1703296,50,1,1],
[1703300,50,1,1],
[1703301,50,1,1],
[1703302,50,1,1],
[1703303,50,1,1],
[1703304,50,1,1],
[1703307,50,1,1],
[1703309,50,1,1],
[1703311,50,1,1],
[1703313,50,1,1],
[1703314,50,1,1],
[1703315,50,1,1],
[1703317,50,1,1],
[1703319,50,1,1],
[1703320,50,1,1],
[1703323,50,1,1],
[1703324,50,1,1],
[1703325,50,1,1],
[1703326,50,1,1],
[1703327,50,1,1],
[1703328,50,1,1],
[1703329,50,1,1],
[1703330,50,1,1],
[1703332,50,1,1],
[1703353,50,1,1],
[1703356,50,1,1],
[1703365,50,1,1]
);



var 喇叭开关 = 1;//0为关1为开

var 点卷抽奖 = 10000;
//var 概率暴击 = cm.getBossRankCount3("概率暴击");
function start() {
	/*
	if (!cm.getPlayer().isGM()){
            cm.sendOk("飞天猪抽奖调整中.....");
            cm.dispose();		
	}	*/
	
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		MapleItemInformationProvider = Packages.server.MapleItemInformationProvider;
		ii = MapleItemInformationProvider.getInstance();
           var text = "";
		   for (var i = 0; i < itemList.length;  i++){
                   text += "#i"+itemList[i][0]+":#";//
           }		
          // cm.sendYesNo("暂时关闭");
          // cm.dispose();    
        //  cm.getPlayer().dropTopMsg("暂时关闭抽奖 维护抽奖, 点解卡图标进行解卡暂");//cm.sendOk("背包所有栏需要留空位,当前检测位置 装备栏");
		 // if (cm.getPlayer().isGM() ) {
		    cm.sendYesNo("#r#r冒险岛一条龙服务#k★#bQQ:1408745#k★\r\n\t\t\t"+抽奖中心+"\r\n#k┌--------------------------------------------------┐\r\n   #r#L1#"+LJ+"点卷单次抽奖"+LJ+"#l          #L2#"+LJ+"点卷十连抽"+LJ+"#l   \r\n #k\r\n└--------------------------------------------------┘\r\n#d单次抽奖需要消耗#r1000点卷#d，奖池物品如下：\r\n\r\n"+text);



        //  }   
    } else if (status == 1) {  
        
		var cjcs = 1;
		if (selection == 1) {
			if (cm.getChar().getCSPoints(1)<=点卷抽奖) {
				cm.sendOk("需要的物品不足，无法进行抽奖");
				cm.dispose();
                return;
			}	
    if (cm.getInventory(1).isFull()) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有2格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 装备栏");
        cm.dispose();
        return;
			}	
    if (cm.getInventory(2).isFull()) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有2格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 消耗栏");
         cm.dispose();
        return;
			}	
    if (cm.getInventory(3).isFull()) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有2格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 设置栏");
         cm.dispose();
        return;
			}	
    if (cm.getInventory(4).isFull()) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有2格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 其他栏");
         cm.dispose();
        return;
			}	
    if (cm.getInventory(5).isFull()) {
       cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有2格以上的空间");// cm.sendOk("背包所有栏需要留空位,当前检测位置 特殊栏");
         cm.dispose();
        return;
			}	
   // } else if (cm.getPlayer().getName()==0) {//黑名单名字
    //    cm.sendOk("由于你被判断为交易行黑名单无法使用交易行");
    //     cm.dispose();
    //    return;
   // }
//}else{
		var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
		     
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
			
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			//item = cm.gainGachaponItem(itemId, quantity,  "刮刮乐");
			
			
            if (cm.canHold(itemId,1)) {
				cm.gainNX(-点卷抽奖);
cm.gainGachaponItem(itemId, quantity, "元宝抽奖");
				//cm.setmoneyb(-点卷抽奖) 
				//if (xiaomi.开关 == 1 && cm.getPlayer().getName() == xiaomi.玩家 && cm.getPlayer().getxmdailyloga(xiaomi.变量) == 0) {
				////	itemId = xiaomi.物品;
			//		cm.getPlayer().gainxmdailyloga(xiaomi.变量,+1);
			//	}
			//	cm.gainGachaponItem(itemId, quantity);
				//item = cm.gainGachaponItem(itemId, quantity,  "刮刮乐");item = cm.gainGachaponItem(itemId, quantity, "元宝抽奖", notice);//cm.gainGachaponItem(itemId, quantity, "元宝抽奖");
				//gainxmwnjlc("小米_抽奖积分",1);
				//cm.setBossRank2("小米_抽奖积分",1,+1);
				//gainxmwnjlc("小米_抽奖积分",1);
				cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
				
				
					
				
				
				
            } else {
                cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有1格以上的空间");
                cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有1格以上的空间");
 cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b请你确认在背包的\r\n装备，消耗，其他窗口中\r\n是否有1格以上的空间#r\r\n",300,1);
	cm.dispose();
            }
            //cm.safeDispose();
	status = -1;
        //} else {
            //cm.sendOk("今天的运气可真差，什么都没有拿到。");
           // cm.gainItem(抽奖需要物品, -点卷抽奖*cjcs);
//cm.setmoneyb(-点卷抽奖) 
            // cm.gainItem(4001322, 1);
            cm.safeDispose();
        }
		
		} else if (selection == 2) {
			if (cm.getChar().getCSPoints(1)<=100000) {
                cm.getPlayer().dropTopMsg("需要的物品不足，无法进行10连抽");
                cm.getPlayer().dropTopMsg("需要的物品不足，无法进行10连抽");
//cm.setmoneyb(9999) 
                cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
				cm.dispose();
                return;
			}
    if (cm.getInventory(1).isFull(9)) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 装备栏");
        cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
        cm.dispose();
        return;
			}	
    if (cm.getInventory(2).isFull(9)) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 消耗栏");
cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
         cm.dispose();
        return;
			}	
    if (cm.getInventory(3).isFull(9)) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 设置栏");
cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
         cm.dispose();
        return;
			}	
    if (cm.getInventory(4).isFull(9)) {
        cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");//cm.sendOk("背包所有栏需要留空位,当前检测位置 其他栏");
cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
         cm.dispose();
        return;
			}	
    if (cm.getInventory(5).isFull(9)) {
       cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");// cm.sendOk("背包所有栏需要留空位,当前检测位置 特殊栏");
cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b需要的物品不足，无法进行10连抽\r\n",300,1);
         cm.dispose();
        return;
			}	
			if (!canHoldSlots(10)) {
                cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");
                cm.getPlayer().dropTopMsg("请你确认在背包的装备，消耗，其他窗口中是否有10格以上的空间");
cm.showInstruction("#r★★温馨提示★★\r\n\r\n#b请你确认在背包的\r\n装备，消耗，其他窗口中\r\n是否有10格以上的空间#r\r\n",300,1);

				cm.dispose();
                return;
				
			}
			
			cjcs = 10;
			
		

		var slcwpjl = "";
		for (var C = 0; C < cjcs; C++) {
			
		var chance = Math.floor(Math.random() * 100);
        var finalitem = Array();
		     
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
			var toDrop;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
		/*	if (xiaomi.开关 == 1 && cm.getPlayer().getName() == xiaomi.玩家 && cm.getPlayer().getxmdailyloga(xiaomi.变量) == 0) {
					itemId = xiaomi.物品;
					cm.getPlayer().gainxmdailyloga(xiaomi.变量,+1)
				}*/

			
					
			
			if (item != -1) {
			slcwpjl += "#i"+itemId+":#"
            cm.gainNX(-10000)
        //    cm.gainItem(抽奖需要物品, -点卷抽奖);
         //   cm.setBossRankCount("小米_抽奖积分",1);
			//gainxmwnjlc("小米_抽奖积分",1);
//cm.dispose();
cm.gainGachaponItem(itemId, quantity, "元宝十连抽");		
			}
            
			
        } else {
            
            
        }
		
		}
       // cm.setBossRankCount2("小米_抽奖积分",+10);
	//	cm.setBossRank2("小米_抽奖积分",1,+10);
		cm.sendOk("十连抽获得的物品：\r\n"+slcwpjl);
     //   cm.playerMessage(1, "\r\n"+slcwpjl);
		//cm.dispose();
		status = -1;
		} else if (selection == 3) {
			cm.openNpc(9900004,"小米_抽奖积分");
        } else if (selection == 8) {
		//	cm.openNpc(9900004,"小米_抽奖积分");
			cm.openNpc(9900004,"精品道具商城");
		} else if (selection == 9) {
			cm.openNpc(9000115,1);		//}	
		} else if (selection == 80) {
 			//} else if (selection == 8876655) {
		cm.sendYesNo("是否使用 智能一键贩卖至商店,背包 24格后所有装备贩卖   卖价是快捷商店贩卖的价格哦，<#r#e不可逆#k#n> 点击 否 即可关闭 确定即自动卖 24格以后的装备 请慎重查看背包 如需装备可放入大仓内");
                                // cm.openNpc(9900004,"一键回收");
			//cm.openShop(30);
			//cm.dispose();
		//}
    }
} else if (status == 2) {

cm.dispose();
cm.openNpc(9900004,"一键回收");
	}
}

//判断全体背包数量
function canHoldSlots(cs) { 
	for (var i = 1; i < 5; i++) {
		if ( cm.getInventory(i).isFull(cs-1) ) {
			return false;
		}
	}
	return true;
}



function gainxmwnjlc(wnjllog,cs) {
	cm.getPlayer().gainxmwnjlc(wnjllog,cs);
}