var 粉心 = "#fEffect/CharacterEff/1112903/0/0#";//红桃心
var 功能名称 = "特定装备强化中心";
var 成功模式提示;
var 无条件赠送装备 = [1113129, 1113130];
var 列表 = [
	{
		指定装备: 1113129, 坐标: 2140000000,
		强化模式: [
			{
				模式: "金币强化", 坐标: 2140000001, type: 1,
				控制属性: [
					{ 阶段: "", 四维: 1, 双攻: 1, 血蓝: 50, 双防: 0, 几率: 100, 金币: 1000000, 道具: [] },
					{ 阶段: "Lv.1", 四维: 2, 双攻: 2, 血蓝: 50, 双防: 0, 几率: 95, 金币: 2000000, 道具: [] },
					{ 阶段: "Lv.2", 四维: 3, 双攻: 3, 血蓝: 50, 双防: 0, 几率: 90, 金币: 3000000, 道具: [] },
					{ 阶段: "Lv.3", 四维: 4, 双攻: 4, 血蓝: 50, 双防: 0, 几率: 85, 金币: 4000000, 道具: [] },
					{ 阶段: "Lv.4", 四维: 5, 双攻: 5, 血蓝: 50, 双防: 0, 几率: 80, 金币: 5000000, 道具: [] },
					
					{ 阶段: "Lv.5", 四维: 6, 双攻: 6, 血蓝: 50, 双防: 0, 几率: 75, 金币: 7000000, 道具: [] },
					{ 阶段: "Lv.6", 四维: 7, 双攻: 7, 血蓝: 50, 双防: 0, 几率: 70, 金币: 9000000, 道具: [] },
					{ 阶段: "Lv.7", 四维: 8, 双攻: 8, 血蓝: 50, 双防: 0, 几率: 65, 金币: 11000000, 道具: [] },
					{ 阶段: "Lv.8", 四维: 9, 双攻: 9, 血蓝: 50, 双防: 0, 几率: 60, 金币: 13000000, 道具: [] },
					{ 阶段: "Lv.9", 四维: 10, 双攻: 10, 血蓝: 50, 双防: 0, 几率: 55, 金币: 15000000, 道具: [] },
					
					{ 阶段: "Lv.10", 四维: 11, 双攻: 11, 血蓝: 50, 双防: 0, 几率: 50, 金币: 18000000, 道具: [] },
					{ 阶段: "Lv.11", 四维: 12, 双攻: 12, 血蓝: 50, 双防: 0, 几率: 45, 金币: 21000000, 道具: [] },
					{ 阶段: "Lv.12", 四维: 13, 双攻: 13, 血蓝: 50, 双防: 0, 几率: 40, 金币: 24000000, 道具: [] },
					{ 阶段: "Lv.13", 四维: 14, 双攻: 14, 血蓝: 50, 双防: 0, 几率: 35, 金币: 27000000, 道具: [] },
					{ 阶段: "Lv.14", 四维: 15, 双攻: 15, 血蓝: 50, 双防: 0, 几率: 30, 金币: 30000000, 道具: [] },
					
					{ 阶段: "Lv.15", 四维: 16, 双攻: 16, 血蓝: 50, 双防: 0, 几率: 25, 金币: 34000000, 道具: [] },
					{ 阶段: "Lv.16", 四维: 17, 双攻: 17, 血蓝: 50, 双防: 0, 几率: 20, 金币: 38000000, 道具: [] },
					{ 阶段: "Lv.17", 四维: 18, 双攻: 18, 血蓝: 50, 双防: 0, 几率: 15, 金币: 42000000, 道具: [] },
					{ 阶段: "Lv.18", 四维: 19, 双攻: 19, 血蓝: 50, 双防: 0, 几率: 10, 金币: 46000000, 道具: [] },
					{ 阶段: "Lv.19", 四维: 20, 双攻: 20, 血蓝: 50, 双防: 0, 几率: 5, 金币: 50000000, 道具: [] },
					
					{ 阶段: "Lv.20", 四维: 21, 双攻: 21, 血蓝: 50, 双防: 0, 几率: 4, 金币: 55000000, 道具: [] },
					
					//最后一个不会强化只计算前面总属性----------按照这个几率满钱能升满20阶，总属性加210
				]
			},
			{
				模式: "枫叶强化", 坐标: 2140000002, type: 2,
				控制属性: [
					{ 阶段: 0, 四维: 1, 双攻: 1, 血蓝: 0, 双防: 50, 几率: 100, 道具: [[4001126, 500]] },
					{ 阶段: 1, 四维: 2, 双攻: 2, 血蓝: 0, 双防: 50, 几率: 100, 道具: [[4001126, 1000]] },
					{ 阶段: 2, 四维: 3, 双攻: 3, 血蓝: 0, 双防: 50, 几率: 100, 道具: [[4001126, 2000]] },
					{ 阶段: 3, 四维: 4, 双攻: 4, 血蓝: 0, 双防: 50, 几率: 100, 道具: [[4001126, 3000]] },
					{ 阶段: 4, 四维: 5, 双攻: 5, 血蓝: 0, 双防: 50, 几率: 100, 道具: [[4001126, 4000]] },
					{ 阶段: 5, 四维: 6, 双攻: 6, 血蓝: 0, 双防: 50, 几率: 80, 道具: [[4001126, 5000]] },
					{ 阶段: 6, 四维: 7, 双攻: 7, 血蓝: 0, 双防: 50, 几率: 80, 道具: [[4001126, 6000]] },
					{ 阶段: 7, 四维: 8, 双攻: 8, 血蓝: 0, 双防: 50, 几率: 80, 道具: [[4001126, 7000]] },
					{ 阶段: 8, 四维: 9, 双攻: 9, 血蓝: 0, 双防: 50, 几率: 80, 道具: [[4001126, 8000]] },
					{ 阶段: 9, 四维: 10, 双攻: 10, 血蓝: 0, 双防: 50, 几率: 80, 道具: [[4001126, 9000]] },
					{ 阶段: 10, 四维: 11, 双攻: 11, 血蓝: 0, 双防: 50, 几率: 60, 道具: [[4001126, 10000]] },
					{ 阶段: 11, 四维: 12, 双攻: 12, 血蓝: 0, 双防: 50, 几率: 60, 道具: [[4001126, 11000]] },
					{ 阶段: 12, 四维: 13, 双攻: 13, 血蓝: 0, 双防: 50, 几率: 60, 道具: [[4001126, 12000]] },
					{ 阶段: 13, 四维: 14, 双攻: 14, 血蓝: 0, 双防: 50, 几率: 60, 道具: [[4001126, 13000]] },
					{ 阶段: 14, 四维: 15, 双攻: 15, 血蓝: 0, 双防: 50, 几率: 60, 道具: [[4001126, 14000]] },
					{ 阶段: 15, 四维: 16, 双攻: 16, 血蓝: 0, 双防: 50, 几率: 40, 道具: [[4001126, 15000]] },
					{ 阶段: 16, 四维: 17, 双攻: 17, 血蓝: 0, 双防: 50, 几率: 40, 道具: [[4001126, 16000]] },
					{ 阶段: 17, 四维: 18, 双攻: 18, 血蓝: 0, 双防: 50, 几率: 40, 道具: [[4001126, 17000]] },
					{ 阶段: 18, 四维: 19, 双攻: 19, 血蓝: 0, 双防: 50, 几率: 40, 道具: [[4001126, 18000]] },
					{ 阶段: 19, 四维: 20, 双攻: 20, 血蓝: 0, 双防: 50, 几率: 40, 道具: [[4001126, 19000]] },
					{ 阶段: 20, 四维: 21, 双攻: 21, 血蓝: 0, 双防: 50, 几率: 20, 道具: [[4001126, 20000]] },
					
					//最后一个不会强化只计算前面总属性----------按照这个几率30W枫叶能升满20阶，总属性加210
				]
			},
		]
	},
	{
		指定装备: 1113130, 坐标: 2140000100,
		强化模式: [
			{
				模式: "首领材料", 坐标: 2140000101, type: 1,
				控制属性: [
					{ 阶段: "", 四维: 1, 双攻: 1, 血蓝: 50, 双防: 0, 几率: 50, 金币: 10000000, 道具: [[1142033, 1]] },
					{ 阶段: "蜗牛王", 四维: 2, 双攻: 2, 血蓝: 50, 双防: 0, 几率: 50, 金币: 10000000, 道具: [[1142040, 1]] },
					{ 阶段: "蘑菇王", 四维: 3, 双攻: 3, 血蓝: 50, 双防: 0, 几率: 50, 金币: 10000000, 道具: [[1142058, 1]] },
					{ 阶段: "蓝蘑菇王", 四维: 4, 双攻: 4, 血蓝: 50, 双防: 0, 几率: 50, 金币: 10000000, 道具: [[1142034, 1]] }, 
					{ 阶段: "树妖王", 四维: 5, 双攻: 5, 血蓝: 50, 双防: 0, 几率: 50, 金币: 10000000, 道具: [[1142043, 1]] },
					{ 阶段: "大多尔", 四维: 6, 双攻: 6, 血蓝: 50, 双防: 0, 几率: 50, 金币: 20000000, 道具: [[1142035, 1]] },
					{ 阶段: "仙人掌", 四维: 7, 双攻: 7, 血蓝: 50, 双防: 0, 几率: 50, 金币: 20000000, 道具: [[3994839, 1]] }, 
					{ 阶段: "贝壳精", 四维: 7, 双攻: 8, 血蓝: 50, 双防: 0, 几率: 50, 金币: 20000000, 道具: [[1142038, 1]] },
					{ 阶段: "浮士德", 四维: 9, 双攻: 9, 血蓝: 50, 双防: 0, 几率: 50, 金币: 20000000, 道具: [[1142042, 1]] },
					{ 阶段: "提莫", 四维: 10, 双攻: 10, 血蓝: 50, 双防: 0, 几率:50, 金币: 20000000, 道具: [[1142039, 1]] },
					{ 阶段: "巨居蟹", 四维: 11, 双攻: 11, 血蓝: 50, 双防: 0, 几率: 50, 金币: 30000000, 道具: [[1142049, 1]] },
					{ 阶段: "流浪熊", 四维: 12, 双攻: 12, 血蓝: 50, 双防: 0, 几率: 50, 金币: 30000000, 道具: [[1142053, 1]] },
					{ 阶段: "艾力杰", 四维: 13, 双攻: 13, 血蓝: 50, 双防: 0, 几率: 50, 金币: 30000000, 道具: [[1142055, 1]] },
					{ 阶段: "吉米啦", 四维: 14, 双攻: 14, 血蓝: 50, 双防: 0, 几率: 50, 金币: 30000000, 道具: [[1142051, 1]] },
					{ 阶段: "妖怪禅师", 四维: 15, 双攻: 15, 血蓝: 50, 双防: 0, 几率: 50, 金币: 30000000, 道具: [[1142048, 1]] },
					{ 阶段: "九尾狐", 四维: 16, 双攻: 16, 血蓝: 50, 双防: 0, 几率: 50, 金币: 40000000, 道具: [[1142060, 1]] },
					{ 阶段: "喷火龙", 四维: 17, 双攻: 17, 血蓝: 50, 双防: 0, 几率: 50, 金币: 40000000, 道具: [[1142061, 1]] },
					{ 阶段: "格瑞芬", 四维: 18, 双攻: 18, 血蓝: 50, 双防: 0, 几率: 50, 金币: 40000000, 道具: [[1142052, 1]] },
					{ 阶段: "蝙蝠怪", 四维: 19, 双攻: 19, 血蓝: 50, 双防: 0, 几率: 50, 金币: 40000000, 道具: [[1142062, 1]] },
					{ 阶段: "大海兽", 四维: 20, 双攻: 20, 血蓝: 50, 双防: 0, 几率: 50, 金币: 40000000, 道具: [[1142037, 1]] },
					{ 阶段: "大王蜈蚣", 四维: 21, 双攻: 21, 血蓝: 50, 双防: 0, 几率: 50, 金币: 50000000, 道具: [[4001085, 1]] },
					
				/*	{ 阶段: "皮亚努斯", 四维: 2, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 4500000, 道具: [[1142674, 1]] },
					{ 阶段: "树精", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 5500000, 道具: [[4001085, 1]] },
					{ 阶段: "妖僧", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6000000, 道具: [[4031227, 1]] },
					{ 阶段: "闹钟", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6500000, 道具: [[4032931, 1]] },
					{ 阶段: "暴力熊", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6500000, 道具: [[4032931, 1]] },
					{ 阶段: "扎昆", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6500000, 道具: [[4032931, 1]] },
					{ 阶段: "黑龙", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6500000, 道具: [[4032931, 1]] },
					{ 阶段: "品克宾", 四维: 1, 双攻: 0, 血蓝: 50, 双防: 0, 几率: 30, 金币: 6500000, 道具: [[4032931, 1]] },*/
				]
			},
			{
				模式: "经验强化", 坐标: 2140000102, type: 2,
				控制属性: [
					{ 阶段: 0, 四维: 1, 双攻: 1, 血蓝: 0, 双防: 50, 几率: 100, 经验: 1000000, 金币: 1000000, 道具: [[4000038, 10], [4001165, 100], [4000313, 1000]] },
					{ 阶段: 1, 四维: 2, 双攻: 2, 血蓝: 0, 双防: 50, 几率: 100, 经验: 5000000, 金币: 1000000, 道具: [[4000038, 10], [4001165, 100], [4000313, 1000]] },
					{ 阶段: 2, 四维: 3, 双攻: 3, 血蓝: 0, 双防: 50, 几率: 100, 经验: 10000000, 金币: 1000000, 道具: [[4000038, 20], [4001165, 200], [4000313, 2000]] },
					{ 阶段: 3, 四维: 4, 双攻: 4, 血蓝: 0, 双防: 50, 几率: 100, 经验: 20000000, 金币: 1000000, 道具: [[4000038, 30], [4001165, 300], [4000313, 3000]] },
					{ 阶段: 4, 四维: 5, 双攻: 5, 血蓝: 0, 双防: 50, 几率: 100, 经验: 30000000, 金币: 1000000, 道具: [[4000038, 40], [4001165, 400], [4000313, 4000]] },
					{ 阶段: 5, 四维: 6, 双攻: 6, 血蓝: 0, 双防: 50, 几率: 80, 经验: 40000000, 金币: 1000000, 道具: [[4000038, 50], [4001165, 500], [4000313, 5000]] },
					{ 阶段: 6, 四维: 7, 双攻: 7, 血蓝: 0, 双防: 50, 几率: 80, 经验: 50000000, 金币: 1000000, 道具: [[4000038, 60], [4001165, 600], [4000313, 6000]] },
					{ 阶段: 7, 四维: 8, 双攻: 8, 血蓝: 0, 双防: 50, 几率: 80, 经验: 60000000, 金币: 1000000, 道具: [[4000038, 70], [4001165, 700], [4000313, 7000]] },
					{ 阶段: 8, 四维: 9, 双攻: 9, 血蓝: 0, 双防: 50, 几率: 80, 经验: 70000000, 金币: 1000000, 道具: [[4000038, 80], [4001165, 800], [4000313, 8000]] },
					{ 阶段: 9, 四维: 10, 双攻: 10, 血蓝: 0, 双防: 50, 几率: 80, 经验: 80000000, 金币: 1000000, 道具: [[4000038, 90], [4001165, 900], [4000313, 9000]] },
					{ 阶段: 10, 四维: 11, 双攻: 11, 血蓝: 0, 双防: 50, 几率: 60, 经验:90000000, 金币: 1000000, 道具: [[4000038, 100], [4001165, 10000], [4000313, 10000]] },
					{ 阶段: 11, 四维: 12, 双攻: 12, 血蓝: 0, 双防: 50, 几率: 60, 经验:100000000, 金币: 1000000, 道具: [[4000038, 110], [4001165, 1100], [4000313, 11000]] },
					{ 阶段: 12, 四维: 13, 双攻: 13, 血蓝: 0, 双防: 50, 几率: 60, 经验:200000000, 金币: 1000000, 道具: [[4000038, 120], [4001165, 1200], [4000313, 12000]] },
					{ 阶段: 13, 四维: 14, 双攻: 14, 血蓝: 0, 双防: 50, 几率: 60, 经验:300000000, 金币: 1000000, 道具: [[4000038, 130], [4001165, 1300], [4000313, 13000]] },
					{ 阶段: 14, 四维: 15, 双攻: 15, 血蓝: 0, 双防: 50, 几率: 60, 经验:400000000, 金币: 1000000, 道具: [[4000038, 140], [4001165, 1400], [4000313, 14000]] },
					{ 阶段: 15, 四维: 16, 双攻: 16, 血蓝: 0, 双防: 50, 几率: 40, 经验:500000000, 金币: 1000000, 道具: [[4000038, 150], [4001165, 1500], [4000313, 15000]] },
					{ 阶段: 16, 四维: 17, 双攻: 17, 血蓝: 0, 双防: 50, 几率: 40, 经验:600000000, 金币: 1000000, 道具: [[4000038, 160], [4001165, 1600], [4000313, 16000]] },
					{ 阶段: 17, 四维: 18, 双攻: 18, 血蓝: 0, 双防: 50, 几率: 40, 经验:700000000, 金币: 1000000, 道具: [[4000038, 170], [4001165, 1700], [4000313, 17000]] },
					{ 阶段: 18, 四维: 19, 双攻: 19, 血蓝: 0, 双防: 50, 几率: 40, 经验:800000000, 金币: 1000000, 道具: [[4000038, 180], [4001165, 1800], [4000313, 18000]] },
					{ 阶段: 19, 四维: 20, 双攻: 20, 血蓝: 0, 双防: 50, 几率: 40, 经验:900000000, 金币: 1000000, 道具: [[4000038, 190], [4001165, 1900], [4000313, 19000]] },
					{ 阶段: 20, 四维: 21, 双攻: 21, 血蓝: 0, 双防: 50, 几率: 20, 经验:1000000000, 金币: 1000000, 道具: [[4000038, 200], [4001165, 2000], [4000313, 20000]] },
				]
			},
		]
	},
	{
		指定装备: 1113131, 坐标: 2140000200,
		强化模式: [
			{
				模式: "BOSS币觉醒", 坐标: 2140000201, type: 1,
				控制属性: [
					{ 阶段: "", 四维: 1, 双攻: 1, 血蓝: 0, 双防: 50, 几率: 30, 金币: 500000, 道具: [[4310143, 5]] },
					{ 阶段: "普通", 四维: 2, 双攻: 2, 血蓝: 0, 双防: 50, 几率: 100, 金币: 1000000, 道具: [[4310143, 10]] },
					{ 阶段: "精致", 四维: 3, 双攻: 3, 血蓝: 0, 双防: 50, 几率: 100, 金币: 1500000, 道具: [[4310143, 15]] },
					{ 阶段: "稀有", 四维: 4, 双攻: 4, 血蓝: 0, 双防: 50, 几率: 100, 金币: 2000000, 道具: [[4310143, 20]] },
					{ 阶段: "神圣", 四维: 5, 双攻: 5, 血蓝: 0, 双防: 50, 几率: 100, 金币: 2500000, 道具: [[4310143, 25]] },
					{ 阶段: "传说", 四维: 6, 双攻: 6, 血蓝: 0, 双防: 50, 几率: 100, 金币: 3000000, 道具: [[4310143, 30]] },
					{ 阶段: "史诗", 四维: 7, 双攻: 7, 血蓝: 0, 双防: 50, 几率: 100, 金币: 3500000, 道具: [[4310143, 35]] },
					{ 阶段: "圣灵", 四维: 8, 双攻: 8, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4000000, 道具: [[4310143, 40]] },
					{ 阶段: "洪荒", 四维: 9, 双攻: 9, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4500000, 道具: [[4310143, 45]] },
					{ 阶段: "创世", 四维: 10, 双攻: 10, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5000000, 道具: [[4310143, 50]] },
					{ 阶段: "混沌", 四维: 11, 双攻: 11, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5500000, 道具: [[4310143, 55]] },

					{ 阶段: "虚无", 四维: 12, 双攻: 12, 血蓝: 0, 双防: 50, 几率: 100, 金币: 3500000, 道具: [[4310143, 60]] },
					{ 阶段: "永恒", 四维: 13, 双攻: 13, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4000000, 道具: [[4310143, 65]] },
					{ 阶段: "星辰", 四维: 14, 双攻: 14, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4500000, 道具: [[4310143, 70]] },
					{ 阶段: "宇宙", 四维: 15, 双攻: 15, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5000000, 道具: [[4310143, 75]] },
					{ 阶段: "神话", 四维: 16, 双攻: 16, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5500000, 道具: [[4310143, 80]] },
					{ 阶段: "传奇", 四维: 17, 双攻: 17, 血蓝: 0, 双防: 50, 几率: 100, 金币: 3500000, 道具: [[4310143, 85]] },
					{ 阶段: "至尊", 四维: 18, 双攻: 18, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4000000, 道具: [[4310143, 90]] },
					{ 阶段: "无上", 四维: 19, 双攻: 19, 血蓝: 0, 双防: 50, 几率: 100, 金币: 4500000, 道具: [[4310143, 95]] },
					{ 阶段: "天启", 四维: 20, 双攻: 20, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5000000, 道具: [[4310143, 100]] },
					{ 阶段: "主宰", 四维: 21, 双攻: 21, 血蓝: 0, 双防: 50, 几率: 100, 金币: 5500000, 道具: [[4310143, 110]] },
				]
			},
			{
				模式: "经验强化", 坐标: 2140000102, type: 2,
				控制属性: [
					{ 阶段: 0, 四维: 1, 双攻: 1, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 10], [4021009, 10], [4011007, 10]] },
					{ 阶段: 1, 四维: 2, 双攻: 2, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 20], [4021009, 20], [4011007, 20]] },
					{ 阶段: 2, 四维: 3, 双攻: 3, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 30], [4021009, 30], [4011007, 30]] },
					{ 阶段: 3, 四维: 4, 双攻: 4, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 40], [4021009, 40], [4011007, 40]] },
					{ 阶段: 4, 四维: 5, 双攻: 5, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 50], [4021009, 50], [4011007, 50]] },
					{ 阶段: 5, 四维: 6, 双攻: 6, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 60], [4021009, 60], [4011007, 60]] },
					{ 阶段: 6, 四维: 7, 双攻: 7, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 70], [4021009, 70], [4011007, 70]] },
					{ 阶段: 7, 四维: 8, 双攻: 8, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 80], [4021009, 80], [4011007, 80]] },
					{ 阶段: 8, 四维: 9, 双攻: 9, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 90], [4021009, 90], [4011007, 90]] },
					{ 阶段: 9, 四维: 10, 双攻: 10, 血蓝: 0, 双防: 50, 几率: 60, 经验: 1000000000, 金币: 10000000, 道具: [[3605006, 100], [4021009, 100], [4011007, 100]] },
					{ 阶段: 10, 四维: 11, 双攻: 11, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 110], [4021009, 110], [4011007, 110]] },
					{ 阶段: 11, 四维: 12, 双攻: 12, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 120], [4021009, 120], [4011007, 120]] },
					{ 阶段: 12, 四维: 13, 双攻: 13, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 130], [4021009, 130], [4011007, 130]] },
					{ 阶段: 13, 四维: 14, 双攻: 14, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 140], [4021009, 140], [4011007, 140]] },
					{ 阶段: 14, 四维: 15, 双攻: 15, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 150], [4021009, 150], [4011007, 150]] },
					{ 阶段: 15, 四维: 16, 双攻: 16, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 160], [4021009, 160], [4011007, 160]] },
					{ 阶段: 16, 四维: 17, 双攻: 17, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 170], [4021009, 170], [4011007, 170]] },
					{ 阶段: 17, 四维: 18, 双攻: 18, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 180], [4021009, 180], [4011007, 180]] },
					{ 阶段: 18, 四维: 19, 双攻: 19, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 190], [4021009, 190], [4011007, 190]] },
					{ 阶段: 19, 四维: 20, 双攻: 20, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 200], [4021009, 200], [4011007, 200]] },
					{ 阶段: 20, 四维: 21, 双攻: 21, 血蓝: 0, 双防: 50, 几率: 60, 经验:1000000000, 金币: 10000000, 道具: [[3605006, 210], [4021009, 210], [4011007, 210]] },
				]
			},
		]
	},
]

function 是否赠送(itemid) {
	var 布尔 = false;
	for (var i = 0; i < 无条件赠送装备.length; i++) {
		if (无条件赠送装备[i] == itemid) {
			布尔 = true;
			break;
		}
	}
	return 布尔;
}

function start() {
	status = -1;

	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1) {
			status++;
		} else {
			status--;
		}
		if (status == 0) {
			for (var ii = 0; ii < 列表.length; ii++) {
				if (cm.getPlayer().hasEquipped(列表[ii].指定装备) == false && cm.getPlayer().getItemQuantity(列表[ii].指定装备, false) == 0 && 是否赠送(列表[ii].指定装备) == true) {
					cm.gainItem(列表[ii].指定装备, 1);
				}
			}
			var text = "";
			text += "\t\t   "+开心冒险岛+"\r\n"+群粉心+"\r\n";
			text += "\t#d" + 粉心 + " 欢迎来到 [#r" + 功能名称 + "#d]\r\n";
			text += "\t#d" + 粉心 + " 请选择您要强化的装备：\r\n";
			for (var i = 0; i < 列表.length; i++) {
				var is_1 = 列表[i];
				if (坐标1 == is_1.坐标) {
					强化模式 = is_1.强化模式;
					text += " \t#L" + is_1.坐标 + "#[#b#v" + is_1.指定装备 + ":##d]" + 关 + "#l";
				} else {
					text += " \t#L" + is_1.坐标 + "#[#b#v" + is_1.指定装备 + ":##d]" + 开 + "#l";
				}
				if ((i + 1) % 4 == 0) {
					text += "\r\n";
				}
			}
			if (坐标1 == null) {
				text += "\r\n";
			}
			if (坐标1 != null) {
				text += "\r\n\r\n\r\n  \t\t\t\t " + 小黄星 + " 选择强化模式 " + 小黄星 + "\r\n\r\n";
				for (var j = 0; j < 强化模式.length; j++) {
					var is_2 = 强化模式[j];
					if (坐标2 == is_2.坐标) {
						条件选择 = is_2;
						成功模式提示 = is_2.模式;
						text += "\t   #L" + is_2.坐标 + "#[#b" + is_2.模式 + "#d]" + 关 + "#l";
					} else {
						text += "\t   #L" + is_2.坐标 + "#[#b" + is_2.模式 + "#d]" + 开 + "#l";
					}
					if ((j + 1) % 3 == 0) {
						text += "\r\n";
					}
				}
				text += "\r\n";
			}
			if (坐标2 != null) {
				text += "\r\n\r\n  \t\t\t\t  " + 小黄星 + " 强化内容提示 " + 小黄星 + "\r\n";
				var Eq = cm.getInventory(1).getItem(1);
				if (Eq == null) {
					text += " \t\t" + 感叹号0 + "请将：#v" + 强化装备 + ":#放置在装备栏第一个格！\r\n";
				} else if (Eq.getItemId() != 强化装备) {
					text += " \t\t" + 感叹号0 + "请将：#v" + 强化装备 + ":#放置在装备栏第一个格！\r\n";
				} else {
					var 检测要求 = true;
					var ii = 0;
					var 阶段文本 = "";
					switch (条件选择.type) {
						case 1:
							if (Eq.getOwner() == 条件选择.控制属性[条件选择.控制属性.length - 1].阶段) {
								检测要求 = false;
								text += " \t\t" + 感叹号0 + "#v" + 强化装备 + ":#该装备强化等级已到上限！\r\n";
							} else {
								for (var i = 0; i < 条件选择.控制属性.length; i++) {
									if (Eq.getOwner() == 条件选择.控制属性[i].阶段) {
										ii = i;
										阶段文本 = "\t " + 美化new + "第#r" + (i + 1) + "#d阶段：[#r" + 条件选择.控制属性[i + 1].阶段 + "#d]\r\n";
										break;
									}
								}
							}
							break;
						case 2:
							if (Eq.getLevel() >= 条件选择.控制属性.length - 1) {
								检测要求 = false;
								text += " \t\t" + 感叹号0 + "#v" + 强化装备 + ":#该装备强化等级已到上限！\r\n";
							} else {
								for (var i = 0; i < 条件选择.控制属性.length; i++) {
									if ((Eq.getLevel()) == 条件选择.控制属性[i].阶段) {
										ii = i;
										阶段文本 = "\t " + 美化new + "第#r" + (i + 1) + "#d阶段：+ [#r" + 条件选择.控制属性[i + 1].阶段 + "#d]\r\n";
										break;
									}
								}
							}
							break;
						default:
							break;
					}
					//cm.getPlayer().dropMessage(5, "装备赋予属性完毕。" + ii);
					if (检测要求 != false) {
						var is_5 = 条件选择.控制属性[ii];
						text += "\r\n  强化属性：\r\n";
						text += "" + 阶段文本;
						text += "\t 成功几率： #r" + is_5.几率 + "#d%\r\n";
						if (is_5.四维 != 0 && is_5.四维 != null) {
							text += "\t 四维属性：+ #r" + is_5.四维 + "#d\r\n";
						}
						if (is_5.双攻 != 0 && is_5.双攻 != null) {
							text += "\t 物/魔攻击：+ #r" + is_5.双攻 + "#d\r\n";
						}
						if (is_5.双防 != 0 && is_5.双防 != null) {
							text += "\t 物/魔防御：+ #r" + is_5.双防 + "#d\r\n";
						}
						if (is_5.血蓝 != 0 && is_5.血蓝 != null) {
							text += "\t Hp/Mp：+ #r" + is_5.血蓝 + "#d\r\n";
						}
						if (is_5.道具.length != 0) {
							for (var e = 0; e < is_5.道具.length; e++) {
								var is_e = is_5.道具[e];
								if (物品数量(is_e[0]) < is_e[1]) {
									检测要求 = false;
									text += "  " + 感叹号0 + "道具：#v" + is_e[0] + ":##b#z" + is_e[0] + "##r" + is_e[1] + "#d个 缺少:[#r" + (is_e[1] - 物品数量(is_e[0])) + "#d]\r\n";
								} else {
									text += "  道具：#v" + is_e[0] + ":##b#z" + is_e[0] + "##r" + is_e[1] + "#d个\r\n";
								}
							}
						}
						if (is_5.金币 != 0 && is_5.金币 != null) {
							if (cm.getMeso() < is_5.金币) {
								检测要求 = false;
								text += "  " + 感叹号0 + "需要金币：[#r" + is_5.金币 + "#d] 缺少:[#r" + (is_5.金币 - cm.getMeso()) + "#d]\r\n";
							} else {
								text += "  需要金币：[#r" + is_5.金币 + "#d]\r\n";
							}
						}
						if (is_5.经验 != 0 && is_5.经验 != null) {
							if (getExp() < is_5.经验) {
								检测要求 = false;
								text += "  " + 感叹号0 + "需要经验：[#r" + is_5.经验 + "#d] 缺少:[#r" + (is_5.经验 - getExp()) + "#d]\r\n";
							} else {
								text += "\r\n  需要经验：#r" + is_5.经验 + "#d\r\n";
							}
						}
					}
					text += "\r\n";
					if (检测要求 == true) {
						text += "\t\t\t\t\t\t\t 是否要强化呢？\r\n";
						text += "\t\t\t\t\t\t";
						text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l ";
						text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l\r\n";
					} else {
						text += "\t\t\t\t\t\t\t\t" + 感叹号0 + "[#r条件不满足#d]\r\n";
					}
				}
			}
			text += "\r\n";
			text +="#k    \r\n"+群粉心+"";
			//text += " #g┗━━━━━━━━━━━━━━━━━━━━━━━━┛#d\r\n";
			cm.sendYesNo(text);
		} else if (status == 1) {
			sele1 = selection;
			for (var i = 0; i < 列表.length; i++) {
				var is_1 = 列表[i];
				if (sele1 == is_1.坐标) {
					强化装备 = is_1.指定装备;
					坐标1 = sele1;
					坐标2 = null;
					start();
					return;
				}
				for (var j = 0; j < is_1.强化模式.length; j++) {
					var is_2 = is_1.强化模式[j];
					if (sele1 == is_2.坐标) {
						坐标2 = sele1;
						start();
						return;
					}
				}
			}
			switch (sele1) {
case 是:
    var Eq = cm.getInventory(1).getItem(1);
    var Owner = Eq.getOwner();
    var Lv = Eq.getLevel();
    var ii;
    switch (条件选择.type) {
        case 1:
            for (var i = 0; i < 条件选择.控制属性.length; i++) {
                if (Eq.getOwner() == 条件选择.控制属性[i].阶段) {
                    ii = i;
                    break;
                }
            }
            // 检查数组索引是否超出范围
            if (ii + 1 < 条件选择.控制属性.length) {
                Owner = 条件选择.控制属性[ii + 1].阶段;
            } else {
                cm.sendOk("该装备强化等级已到上限，无法继续强化！");
                status = -1;
                return;
            }
            break;
        case 2:
            for (var i = 0; i < 条件选择.控制属性.length; i++) {
                if ((Eq.getLevel()) == 条件选择.控制属性[i].阶段) {
                    ii = i;
                    break;
                }
            }
            // 检查数组索引是否超出范围
            if (ii + 1 < 条件选择.控制属性.length) {
                Lv = 条件选择.控制属性[ii + 1].阶段;
            } else {
                cm.sendOk("该装备强化等级已到上限，无法继续强化！");
                status = -1;
                return;
            }
            break;
        default:
            break;
    }

					var is_5 = 条件选择.控制属性[ii];
					if (is_5.四维 != 0 && is_5.四维 != null) {
						四维 = is_5.四维;
					}
					if (is_5.双攻 != 0 && is_5.双攻 != null) {
						双攻 = is_5.双攻;
					}
					if (is_5.双防 != 0 && is_5.双防 != null) {
						双防 = is_5.双防;
					}
					if (is_5.血蓝 != 0 && is_5.血蓝 != null) {
						血蓝 = is_5.血蓝;
					}
					if (is_5.道具.length != 0) {
						for (var e = 0; e < is_5.道具.length; e++) {
							var is_e = is_5.道具[e];
							cm.gainItem(is_e[0], -is_e[1]);
						}
					}
					if (is_5.金币 != 0 && is_5.金币 != null) {
						cm.gainMeso(-is_5.金币);
					}
					if (is_5.经验 != 0 && is_5.经验 != null) {
						gainExp(-is_5.经验);
						cm.getPlayer().dropMessage(5, "角色储存经验 (-" + is_5.经验 + ")");
						//text += "\r\n  需要经验：#r" + is_5.经验 + "#d\r\n";
					}
					var random = Math.floor(Math.random() * 100) + 1;
					if (is_5.几率 >= random) {
						Inventory_Up(Lv, Owner, 四维, 双攻, 双防, 血蓝);
						cm.道具喇叭("[" + cm.getPlayer().getName() + "]"," 选择[" + 成功模式提示 + "]强化  第" + (i + 1) + "阶段：[" + 条件选择.控制属性[i + 1].阶段 + "]  成功！",1,1);
						cm.sendOk("#e#d恭喜您！强化成功了。。。");
					} else {
						cm.sendOk("#e#d很遗憾！强化失败了。。。");
					}
					status = -1;
					return;
				case 否:
					start();
					break;
				default:
					break;
			}
		}
	}
}

function 实时道具喇叭(invType, pos, msg) {//rc端使用
	var MapleInventoryType = Packages.client.inventory.MapleInventoryType;
	var item = cm.getPlayer().getInventory(MapleInventoryType.getByType(invType)).getItem(pos);
	cm.道具喇叭(item, msg);
}

function 物品数量(itemid) {
	return cm.getPlayer().getItemQuantity(itemid, false);
}

function Inventory_Up(Lv, Owner, 四维, 双攻, 双防, 血蓝) {
	var item = cm.getInventory(1).getItem(1);
	item.setLevel(Lv);
	item.setOwner(Owner);
	item.setStr(item.getStr() + 四维);
	item.setDex(item.getDex() + 四维);
	item.setInt(item.getInt() + 四维);
	item.setLuk(item.getLuk() + 四维);
	item.setWatk(item.getWatk() + 双攻);
	item.setMatk(item.getMatk() + 双攻);
	item.setWdef(item.getWdef() + 双防);
	item.setMdef(item.getMdef() + 双防);
	item.setHp(item.getHp() + 血蓝);
	item.setMp(item.getMp() + 血蓝);
	//item.setFlag(8);
	cm.getPlayer().forceReAddItem_Flag(item.copy(), Packages.client.inventory.MapleInventoryType.EQUIP);
}

function gainExp(sum) {
	var id = cm.getPlayer().getId();
	return sqlMultiPurpose("UPDATE characters SET 储存经验 = 储存经验 + " + sum + " WHERE id = " + id + "");
}

function getExp() {
	var exp = 0;
	var id = cm.getPlayer().getId();
	var con = cm.getConnection();
	var ps = con.prepareStatement("SELECT * FROM characters WHERE id = " + id + "");
	var rs = ps.executeQuery();
	while (rs.next()) {
		exp = rs.getString("储存经验");
	}
	rs.close();
	ps.close();
	con.close();
	return exp;
}

function sqlMultiPurpose(sql) {//
	var con = cm.getConnection();
	var ps = con.prepareStatement(sql);
	ret = ps.executeUpdate();
	ps.close();
	con.close();
	return ret;
}

var 粉心 = "#fEffect/CharacterEff/1112903/0/0#";//红桃心
var 群粉心 =" "+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+粉心+"\r\n";
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";  //小黄星
var 开心冒险岛 = "#fEffect/CharacterEff1.img/QQ1408745/0/0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号0 = "#fUI/UIWindow/Quest/icon0#";
var 感叹号1 = "#fUI/UIWindow/Quest/icon1#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var xx = "#fItem/Etc/0427/04270001/Icon9/0#";  //小黄星

var 广播 = "#fUI/CN_Chat/ChattingRoom/BtVolUp/0/normal/0#";
var 强化装备;
var 坐标1;
var 坐标2;
var 是 = 2146000001;
var 否 = 2146000002;
var 四维 = 0;
var 双攻 = 0;
var 双防 = 0;
var 血蓝 = 0;