var maxs = new Array();
var itemArr = new Array();
var 存放时间 = 7;//单位：以天计
var 列表 = [
	{
		地点: 252030100, 返回地点: 910001000,
		赋予记录: "通关拉瓦那", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 400000, 代码: 2450000, 奖品: { 最低: 1, 最高: 1 } },//幸运狩猎BUFF
			{ 概率: 400000, 代码: 2022309, 奖品: { 最低: 1, 最高: 3 } },//1000点券兑换卡
			{ 概率: 300000, 代码: 4001226, 奖品: { 最低: 1, 最高: 2 } },//五颗小星星，中国心材料
			{ 概率: 300000, 代码: 4001227, 奖品: { 最低: 1, 最高: 2 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 1, 最高: 2 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 1, 最高: 2 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 1, 最高: 2 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 2 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 2 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 2 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 2 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 2 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 3 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 1, 最高: 500 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 18, 最高: 288 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 1, 最高: 10 } },//飞升秘术
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 1 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 1 } },//突破一万50%
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 1, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 1, 最高: 2 } },//BOSS币
			
		]
	},
	
	{
		地点: 910540200, 返回地点: 910001000,
		赋予记录: "通关艾里葛斯", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 400000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 400000, 代码: 2022309, 奖品: { 最低: 1, 最高: 3 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 1, 最高: 5 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 1, 最高: 5 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 1, 最高: 5 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 1, 最高: 5 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 1, 最高: 5 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 5 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 5 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 5 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 5 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 5 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 15 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 288 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 388 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 5, 最高: 10 } },//飞升秘术
			{ 概率: 700000, 代码: 4011007, 奖品: { 最低: 2, 最高: 4 } },//月石
			{ 概率: 700000, 代码: 4021009, 奖品: { 最低: 2, 最高: 4 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 1 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 1 } },//突破一万50%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 1 } },//高级正向混沌卷轴
			{ 概率: 50000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 1, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 1, 最高: 2 } },//BOSS币

		]
	},
	
	{
		地点: 240093310, 返回地点: 910001000,
		赋予记录: "通关蜘蛛女王", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 400000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 400000, 代码: 2022309, 奖品: { 最低: 1, 最高: 4 } },//1000点券兑换卡
			{ 概率: 300000, 代码: 4001226, 奖品: { 最低: 3, 最高: 6 } },//五颗小星星，中国心材料
			{ 概率: 300000, 代码: 4001227, 奖品: { 最低: 3, 最高: 6 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 6 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 6 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 6 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 388 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 488 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 8, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 5 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 5 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 18, 最高: 38 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 700000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 1 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 2 } },//突破一万50%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 4 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 300000, 代码: 2022509, 奖品: { 最低: 1, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币


		]
	},
	
	{
		地点: 555000201, 返回地点: 910001000,
		赋予记录: "通关狂暴威尔", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 5, 最高: 10 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 600000, 代码: 2614007, 奖品: { 最低: 1, 最高: 1 } },//突破十万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			
		]
	},
	
	{
		地点: 510102400, 返回地点: 910001000,
		赋予记录: "通关三头犬", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 5, 最高: 10 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 1000000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 800000, 代码: 2614007, 奖品: { 最低: 1, 最高: 1 } },//突破十万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币


		]
	},
	
	{
		地点: 910025201, 返回地点: 910001000,
		赋予记录: "通关蟾蜍怪", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 5, 最高: 10 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 100, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 100, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 1000000, 代码: 2614007, 奖品: { 最低: 1, 最高: 1 } },//突破十万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			

		]
	},
	
	{
		地点: 910141030, 返回地点: 910001000,
		赋予记录: "通关火狐", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 5, 最高: 10 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 1000000, 代码: 2614007, 奖品: { 最低: 1, 最高: 2 } },//突破十万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
	//		{ 概率: 500000, 代码: 3700292, 奖品: { 最低: 1, 最高: 2 } },//上古秘术

		]
	},
	
	{
		地点: 910142090, 返回地点: 910001000,
		赋予记录: "通关黑暗恶狼", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 5, 最高: 10 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 1000000, 代码: 2614007, 奖品: { 最低: 1, 最高: 3 } },//突破十万30%
			{ 概率: 1000000, 代码: 2614013, 奖品: { 最低: 1, 最高: 1 } },//突破十万50%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币

		]
	},
	//================================================以下还是老区暴率===================
	{
		地点: 745090100, 返回地点: 910001000,
		赋予记录: "通关始皇帝", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 2 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 10, 最高: 20 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 10 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 3, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 10, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 10, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 10, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 10, 最高: 10 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 3, 最高: 6 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 3, 最高: 6 } },//星石
			{ 概率: 300000, 代码: 4031952, 奖品: { 最低: 8, 最高: 28 } },//修炼金丹
			{ 概率: 600000, 代码: 3700290, 奖品: { 最低: 1, 最高: 1 } },//聚灵珠
			{ 概率: 300000, 代码: 3605009, 奖品: { 最低: 1, 最高: 1 } },//聚灵宝珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 500000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 1000000, 代码: 2614007, 奖品: { 最低: 1, 最高: 4 } },//突破十万30%
			{ 概率: 1000000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 100000, 代码: 2460006, 奖品: { 最低: 1, 最高: 1 } },//专属戒指卷轴
			{ 概率: 400000, 代码: 2022509, 奖品: { 最低: 2, 最高: 3 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币

		]
	},
	
	{
		地点: 803200000, 返回地点: 910001000,
		赋予记录: "通关敦凯尔", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 20, 最高: 30 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 1000000, 代码: 2614013, 奖品: { 最低: 1, 最高: 3 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 1, 最高: 3 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 1, 最高: 88 } },//怪物公园纪念币
			{ 概率: 800000, 代码: 2048724, 奖品: { 最低: 1, 最高: 5 } },//神级强化石
			{ 概率: 800000, 代码: 2048722, 奖品: { 最低: 1, 最高: 1 } },//混沌强化石
			{ 概率: 500000, 代码: 4001268, 奖品: { 最低: 1, 最高: 1 } },//金色氪结晶体
			{ 概率: 500000, 代码: 4001269, 奖品: { 最低: 1, 最高: 1 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4322899, 奖品: { 最低: 10, 最高: 20 } },//1 级宝石

		]
	},
	
	{
		地点: 209000002, 返回地点: 910001000,
		赋予记录: "通关戴米安", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 30, 最高: 40 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614013, 奖品: { 最低: 1, 最高: 3 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 10, 最高: 30 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 1, 最高: 4 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 18, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 10 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 1 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 2 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 2 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4322898, 奖品: { 最低: 8, 最高: 18 } },//2 级宝石
		]
	},
	
	{
		地点: 910142110, 返回地点: 910001000,
		赋予记录: "通关调和精灵", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 40, 最高: 50 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万100%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 50 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4322897, 奖品: { 最低: 6, 最高: 16 } },//3 级宝石
		]
	},
	
	{
		地点: 410007001, 返回地点: 910001000,
		赋予记录: "通关穷奇", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 50, 最高: 60 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 3 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 10, 最高: 88 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 1, 最高: 1 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 1, 最高: 1 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 4322885, 奖品: { 最低: 4, 最高: 14 } },//4 级宝石
		]
	},
	
	{
		地点: 802000825, 返回地点: 910001000,
		赋予记录: "通关铸杌", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 60, 最高: 70 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 1, 最高: 2 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 1, 最高: 2 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 4322884, 奖品: { 最低: 2, 最高: 12 } },//5 级宝石
		]
	},
	
	{
		地点: 410007541, 返回地点: 910001000,
		赋予记录: "通关混沌", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 70, 最高: 80 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 1, 最高: 3 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 1, 最高: 3 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 4322883, 奖品: { 最低: 1, 最高: 10 } },//6 级宝石
		]
	},
	
	{
		地点: 450013830, 返回地点: 910001000,
		赋予记录: "通关卡琳", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 200000, 代码: 2450000, 奖品: { 最低: 1, 最高: 5 } },//幸运狩猎BUFF
			{ 概率: 800000, 代码: 2022309, 奖品: { 最低: 80, 最高: 90 } },//1000点券兑换卡
			{ 概率: 800000, 代码: 4001226, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 800000, 代码: 4001227, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001228, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001229, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 4001230, 奖品: { 最低: 3, 最高: 15 } },//五颗小星星，中国心材料
			{ 概率: 200000, 代码: 3605015, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605016, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605017, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605018, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3605019, 奖品: { 最低: 1, 最高: 10 } },//五职业荣誉
			{ 概率: 200000, 代码: 3994659, 奖品: { 最低: 1, 最高: 25 } },//封印纹章
			{ 概率: 800000, 代码: 4001126, 奖品: { 最低: 888, 最高: 2888 } },//红枫叶
			{ 概率: 1000000, 代码: 4001165, 奖品: { 最低: 888, 最高: 2888 } },//阳光
			{ 概率: 1000000, 代码: 3605011, 奖品: { 最低: 48, 最高: 188 } },//飞升秘术
			{ 概率: 1000000, 代码: 4011007, 奖品: { 最低: 48, 最高: 166 } },//月石
			{ 概率: 1000000, 代码: 4021009, 奖品: { 最低: 48, 最高: 166 } },//星石
			{ 概率: 1000000, 代码: 4031952, 奖品: { 最低: 188, 最高: 3000 } },//修炼金丹
			{ 概率: 1000000, 代码: 3700290, 奖品: { 最低: 10, 最高: 28 } },//聚灵珠
			{ 概率: 1000000, 代码: 3605009, 奖品: { 最低: 10, 最高: 26 } },//聚灵宝珠
			{ 概率: 100000, 代码: 3700291, 奖品: { 最低: 2, 最高: 8 } },//天地灵珠
			{ 概率: 10000, 代码: 3700294, 奖品: { 最低: 1, 最高: 2 } },//星辰灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 400000, 代码: 4322869, 奖品: { 最低: 1, 最高: 4 } },//7 级宝石
		]
	},

	{
		地点: 450013840, 返回地点: 910001000,
		赋予记录: "通关黑魔法师", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 10000, 代码: 1302275, 奖品: { 最低: 1, 最高: 1 } },			
			{ 概率: 10000, 代码: 1402196, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1432167, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1442223, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1382208, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1452205, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1462193, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1472214, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1332225, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1482168, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1492179, 奖品: { 最低: 1, 最高: 1 } },

			{ 概率: 10000, 代码: 1302290, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1402211, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1432179, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1442235, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1382223, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1452217, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1462205, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1472227, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1332239, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1482180, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1492191, 奖品: { 最低: 1, 最高: 1 } },

			{ 概率: 10000, 代码: 1302355, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1402268, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1432227, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1442285, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1382273, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1452266, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1462252, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1472275, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1332289, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1482232, 奖品: { 最低: 1, 最高: 1 } },
			{ 概率: 10000, 代码: 1492245, 奖品: { 最低: 1, 最高: 1 } },
			
			{ 概率: 700000, 代码: 3605012, 奖品: { 最低: 1, 最高: 2 } },//混沌灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 900000, 代码: 2590006, 奖品: { 最低: 1, 最高: 3 } },//强化型灵魂附魔石
			{ 概率: 1000000, 代码: 2590008, 奖品: { 最低: 1, 最高: 3 } },//强化型灵魂附魔石
			{ 概率: 300000, 代码: 4322868, 奖品: { 最低: 1, 最高: 3 } },//8 级宝石
		]
	},
	
	{
		地点: 450004150, 返回地点: 910001000,
		赋予记录: "通关路西德", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 1000000, 代码: 2022309, 奖品: { 最低: 50, 最高: 150 } },//点券兑换卡
			{ 概率: 700000, 代码: 3605012, 奖品: { 最低: 1, 最高: 2 } },//混沌灵珠
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 5 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 5, 最高: 10 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 5, 最高: 10 } },//金色氪结晶体
			{ 概率: 900000, 代码: 2590006, 奖品: { 最低: 2, 最高: 4 } },//强化型灵魂附魔石
			{ 概率: 1000000, 代码: 2590008, 奖品: { 最低: 2, 最高: 4 } },//强化型灵魂附魔石
			{ 概率: 200000, 代码: 4322867, 奖品: { 最低: 1, 最高: 2 } },//9 级宝石
			{ 概率: 1000000, 代码: 4322952, 奖品: { 最低: 1, 最高: 3 } },//黄金鱼
		]
	},
	
	{
		地点: 450001340, 返回地点: 910001000,
		赋予记录: "通关黑水灵王", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 1000000, 代码: 4322899, 奖品: { 最低: 10, 最高: 20 } },//1 级宝石
			{ 概率: 1000000, 代码: 4322898, 奖品: { 最低: 8, 最高: 18 } },//2 级宝石
			{ 概率: 1000000, 代码: 4322897, 奖品: { 最低: 6, 最高: 16 } },//3 级宝石
			{ 概率: 1000000, 代码: 4322885, 奖品: { 最低: 4, 最高: 14 } },//4 级宝石
			{ 概率: 1000000, 代码: 4322884, 奖品: { 最低: 2, 最高: 12 } },//5 级宝石
			{ 概率: 1000000, 代码: 4322883, 奖品: { 最低: 1, 最高: 10 } },//6 级宝石
			
			{ 概率: 400000, 代码: 4322869, 奖品: { 最低: 1, 最高: 4 } },//7 级宝石
			{ 概率: 300000, 代码: 4322868, 奖品: { 最低: 1, 最高: 3 } },//8 级宝石
			{ 概率: 200000, 代码: 4322867, 奖品: { 最低: 1, 最高: 2 } },//9 级宝石
			
			{ 概率: 100000, 代码: 4322853, 奖品: { 最低: 1, 最高: 1 } },//10 级宝石
			
			{ 概率: 1000000, 代码: 4322952, 奖品: { 最低: 5, 最高: 5 } },//黄金鱼
		]
	},
	
	{
		地点: 874004002, 返回地点: 910001000,
		赋予记录: "通关暗影", 永久: 0, 每日: 0,
		公共奖项: [//奖项
			{ 概率: 700000, 代码: 3605012, 奖品: { 最低: 1, 最高: 2 } },//混沌灵珠
			{ 概率: 700000, 代码: 2614006, 奖品: { 最低: 1, 最高: 4 } },//突破一万30%
			{ 概率: 300000, 代码: 2614012, 奖品: { 最低: 1, 最高: 4 } },//突破一万50%
			{ 概率: 30000, 代码: 2614013, 奖品: { 最低: 1, 最高: 2 } },//突破十万50%
			{ 概率: 1000000, 代码: 2614008, 奖品: { 最低: 1, 最高: 2 } },//突破百万30%
			{ 概率: 1000000, 代码: 2614002, 奖品: { 最低: 1, 最高: 1 } },//突破百万30%
			{ 概率: 200000, 代码: 2022699, 奖品: { 最低: 1, 最高: 5 } },//高级正向混沌卷轴
			{ 概率: 200000, 代码: 2460006, 奖品: { 最低: 1, 最高: 3 } },//专属戒指卷轴
			{ 概率: 1000000, 代码: 2022509, 奖品: { 最低: 3, 最高: 5 } },//元宝
			{ 概率: 100000, 代码: 2022509, 奖品: { 最低: 2, 最高: 4 } },//元宝
			{ 概率: 1000000, 代码: 4310143, 奖品: { 最低: 3, 最高: 5 } },//BOSS币
			{ 概率: 1000000, 代码: 3700292, 奖品: { 最低: 3, 最高: 5 } },//上古秘术
			{ 概率: 1000000, 代码: 4310020, 奖品: { 最低: 38, 最高: 88 } },//怪物公园纪念币
			{ 概率: 1000000, 代码: 2048724, 奖品: { 最低: 1, 最高: 15 } },//神级强化石
			{ 概率: 1000000, 代码: 2048722, 奖品: { 最低: 1, 最高: 3 } },//混沌强化石
			{ 概率: 1000000, 代码: 4001268, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 4001269, 奖品: { 最低: 1, 最高: 3 } },//金色氪结晶体
			{ 概率: 1000000, 代码: 3994753, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 1000000, 代码: 3994754, 奖品: { 最低: 2, 最高: 3 } },//没灵魂的剑
			{ 概率: 900000, 代码: 2590006, 奖品: { 最低: 1, 最高: 3 } },//强化型灵魂附魔石
			{ 概率: 1000000, 代码: 2590008, 奖品: { 最低: 1, 最高: 3 } },//强化型灵魂附魔石
		]
	},
	//以上是破攻常规BOSS挑战奖励

]

var 筛选;
/*
cm.getPlayer().getGameLogCount("名字");//角色
cm.getPlayer().getGameLogCount("名字",true);//账号

cm.getPlayer().setGameLogCount("名字",次数);//永久LOG
cm.getPlayer().setGameDayLogCount("名字",次数);//每日LOG
*/
function 物品数量(itemid) {
	return cm.getPlayer().getItemQuantity(itemid, false);
}

function start() {
	扫描超时道具();
	for (var i = 0; i < 列表.length; i++) {
		if (cm.getMapId() == 列表[i].地点) {
			筛选 = 列表[i];
			break;
		}
	}
	if (筛选 == null) {
		cm.dispose();
		return;
	}
	var 爆率 = 1;
	if (物品数量(5360014) >= 1) {
		爆率 = 2;
	}
	if (筛选.每日 != 0) {
		cm.getPlayer().setBossLog(筛选.赋予记录, 筛选.每日);//每日LOG
	}
	if (筛选.永久 != 0) {
		cm.getPlayer().setAccYjLog(筛选.赋予记录, 筛选.每日);//永久LOG
	}
	for (var j = 0; j < 筛选.公共奖项.length; j++) {
		maxs.push(筛选.公共奖项[j].概率);
	}
	角色id = cm.getPlayer().getId();
	玩家名称 = cm.getPlayer().getName();
	倒计时 = 读取时间() + 60 * 60 * 24 * 存放时间;
	if (maxs.length != 0) {
		var text = "#d";
		var 检测 = false;
		var max = Math.max.apply(null, maxs);
		for (var k = 0; k < 筛选.公共奖项.length; k++) {
			var random = Math.floor(Math.random() * 1000000) + 1;
			//var random = Math.floor(Math.random() * max) + 1;
			if (筛选.公共奖项[k].概率 * 爆率 >= random) {
				var num = Math.floor(Math.random() * (筛选.公共奖项[k].奖品.最高 + 1 - 筛选.公共奖项[k].奖品.最低) + 筛选.公共奖项[k].奖品.最低);
				if (cm.canHold(筛选.公共奖项[k].代码, num)) {
					cm.gainItem(筛选.公共奖项[k].代码, num);
				} else {
					if (检测 == false) {
						text += "空间不足！获得物品已转至邮件！\r\n(注意！保存期:#r" + 存放时间 + "#d天，过期会被删除。)\r\n";
						检测 = true;
					}
					var itemNm = cm.getItemName(筛选.公共奖项[k].代码);
					转至邮件(筛选.公共奖项[k].代码, itemNm, num);
					text += "获得物品（#v" + 筛选.公共奖项[k].代码 + ":##b#z" + 筛选.公共奖项[k].代码 + "##r " + num + "#d个）\r\n";
				}
			}
		}
		cm.warp(筛选.返回地点, 0);
		if (检测 == true) {
			cm.sendOk(text);
			//cm.getPlayer().dropMessage(1, text);
		}
	}
	cm.dispose();
}

function 转至邮件(物品代码, 物品名称, 数量) {//
	sqlMultiPurpose("INSERT INTO 泉哥_邮件 (玩家名称, 角色id, 倒计时, 物品代码, 物品名称, 数量) VALUES ('" + 玩家名称 + "'," + 角色id + "," + 倒计时 + "," + 物品代码 + ",'" + 物品名称 + "'," + 数量 + ")");
}

function 扫描超时道具() {//读取秒钟
	var ret = sqlSelect("SELECT * FROM 泉哥_邮件 WHERE 倒计时 < " + 读取时间() + "");
	for (var i = 0; i < ret.length; i++) {
		sqlMultiPurpose("DELETE FROM 泉哥_邮件 WHERE 顺序 = " + ret[i]["顺序"] + "");
	}
}

function 读取时间() {//读取秒钟
	var ca = new Date();
	var 秒 = Math.ceil(ca / 1000);//
	return 秒;
}

function 物品名称(代码) {
	var name = Packages.server.MapleItemInformationProvider;
	return name.getInstance().getName(代码);
}
function 字符串转换为组(str) {
	var tempString = str.toString().split("");
	return tempString;
}

function 提取字符串数值(str) {
	var num = str.replace(/[^0-9]/ig, "");//提取字符串中的数值  返回 = 字符串数值(较为精准)
	var num = str.match(/\d+(.\d+)?/g);//提取字符串中的数值  返回 = 字符串数值(不太精准)
	return num;
}

function 判断背包空间_素组(list) {
	var text = "#e#d";
	var 检测背包 = true;
	var k1 = 0; var k2 = 0; var k3 = 0; var k4 = 0; var k5 = 0;
	for (var i = 0; i < list.length; i++) {
		var is = list[i];
		if (is.代码 >= 1000000 && is.代码 <= 1999999) { k1++; };
		if (is.代码 >= 2000000 && is.代码 <= 2999999) { k2++; };
		if (is.代码 >= 3000000 && is.代码 <= 3999999) { k3++; };
		if (is.代码 >= 4000000 && is.代码 <= 4999999) { k4++; };
		if (is.代码 >= 5000000 && is.代码 <= 5999999) { k5++; };
	}
	var 装备栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.EQUIP).getNumFreeSlot();
	var 消耗栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.USE).getNumFreeSlot();
	var 设置栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.SETUP).getNumFreeSlot();
	var 其他栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.ETC).getNumFreeSlot();
	var 现金栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.CASH).getNumFreeSlot();
	if (装备栏空位 < k1) { 检测背包 = false; text += " 请确保#r装备#d栏有 #r" + k1 + "#d 空间以上！\r\n"; };
	if (消耗栏空位 < k2) { 检测背包 = false; text += " 请确保#r消耗#d栏有 #r" + k2 + "#d 空间以上！\r\n"; };
	if (设置栏空位 < k3) { 检测背包 = false; text += " 请确保#r设置#d栏有 #r" + k3 + "#d 空间以上！\r\n"; };
	if (其他栏空位 < k4) { 检测背包 = false; text += " 请确保#r其他#d栏有 #r" + k4 + "#d 空间以上！\r\n"; };
	if (现金栏空位 < k5) { 检测背包 = false; text += " 请确保#r现金#d栏有 #r" + k5 + "#d 空间以上！\r\n"; };
	return ret = { bool: 检测背包, text: text };
}

function 判断背包空间_单个(itemid) {
	var text = "#e#d";
	var 检测背包 = true;
	var k1 = 0; var k2 = 0; var k3 = 0; var k4 = 0; var k5 = 0;
	if (itemid >= 1000000 && itemid <= 1999999) { k1++; };
	if (itemid >= 2000000 && itemid <= 2999999) { k2++; };
	if (itemid >= 3000000 && itemid <= 3999999) { k3++; };
	if (itemid >= 4000000 && itemid <= 4999999) { k4++; };
	if (itemid >= 5000000 && itemid <= 5999999) { k5++; };
	var 装备栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.EQUIP).getNumFreeSlot();
	var 消耗栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.USE).getNumFreeSlot();
	var 设置栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.SETUP).getNumFreeSlot();
	var 其他栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.ETC).getNumFreeSlot();
	var 现金栏空位 = cm.getChar().getInventory(Packages.client.inventory.MapleInventoryType.CASH).getNumFreeSlot();
	if (装备栏空位 < k1) { 检测背包 = false; text += " 请确保#r装备#d栏有 #r" + k1 + "#d 空间以上！\r\n"; };
	if (消耗栏空位 < k2) { 检测背包 = false; text += " 请确保#r消耗#d栏有 #r" + k2 + "#d 空间以上！\r\n"; };
	if (设置栏空位 < k3) { 检测背包 = false; text += " 请确保#r设置#d栏有 #r" + k3 + "#d 空间以上！\r\n"; };
	if (其他栏空位 < k4) { 检测背包 = false; text += " 请确保#r其他#d栏有 #r" + k4 + "#d 空间以上！\r\n"; };
	if (现金栏空位 < k5) { 检测背包 = false; text += " 请确保#r现金#d栏有 #r" + k5 + "#d 空间以上！\r\n"; };
	return ret = { bool: 检测背包, text: text };
}

function 分割线() {
	var text = " ";
	var list = [
		//{ UI: "#fEffect/CharacterEff.img/1022223/3/0#", length: 21 },
		//{ UI: "#fEffect/CharacterEff.img/1022223/4/0#", length: 21 },
		//{ UI: "#fEffect/CharacterEff.img/1022223/6/0#", length: 31 },
		{ UI: "1", length: 21 },
		{ UI: "1", length: 22 },
		{ UI: "1", length: 24 },
	];
	var random = Math.floor(Math.random() * list.length);
	for (var i = 0; i < list[random].length; i++) {
		//var random = Math.floor(Math.random() * list.length);
		text += list[random].UI;
	}
	text += "\r\n";
	return text;
}

function 更改呈现奖励(类型, 数量) {
	switch (类型) {
		case "点券":
			if (数量 != 0 && 数量 != null) { cm.gainNX(数量) };
			break;
		case "抵用":
			if (数量 != 0 && 数量 != null) { cm.gainDY(数量) };
			break;
		case "金币":
			if (数量 != 0 && 数量 != null) { cm.gainMeso(数量) };
			break;
		case "经验":
			if (数量 != 0 && 数量 != null) { cm.gainExp(数量) };
			break;
		default:
			break;
	}
}

function 呈现奖励货币(类型, 数量) {
	var 章鱼 = "1";
	var 蘑菇 = "1";
	var 绿水 = "1";
	var 猪猪 = "1";
	var text = "";
	switch (类型) {
		case "点券":
			text += (数量 != 0 && 数量 != null ? "" + 章鱼 + "奖励: #r" + 数量 + "#d点券" : "");
			break;
		case "抵用":
			text += (数量 != 0 && 数量 != null ? "" + 蘑菇 + "奖励: #r" + 数量 + "#d抵用" : "");
			break;
		case "金币":
			text += (数量 != 0 && 数量 != null ? "" + 绿水 + "奖励: #r" + 数量 + "#d金币" : "");
			break;
		case "经验":
			text += (数量 != 0 && 数量 != null ? "" + 猪猪 + "奖励: #r" + 数量 + "#d经验" : "");
			break;
		default:
			break;
	}
	return text;
}

function sqlSelect(sql) {
	var con = cm.getConnection();
	var ret = new Array();
	var ps = con.prepareStatement(sql);
	var rs = ps.executeQuery();
	var metaData = ps.getMetaData();
	while (rs.next()) {
		var rsdata = new java.util.HashMap();
		for (var j = 1; j <= metaData.getColumnCount(); j++) {
			columnLabel = metaData.getColumnLabel(j);
			rsdata.put(columnLabel, rs.getObject(columnLabel));
		}
		if (!rsdata.isEmpty()) {
			ret.push(rsdata);
		}
	}
	rs.close();
	ps.close();
	con.close();
	return ret;
}

function sqlMultiPurpose(sql) {//
	var con = cm.getConnection();
	var ps = con.prepareStatement(sql);
	ret = ps.executeUpdate();
	ps.close();
	con.close();
	return ret;
}