/* ==================
 脚本类型: 万能传送   
 脚本作者：汉堡  
 联系方式：北斗项目组
 =====================
 */
//------------------------------------------------------------------------
var 空格= "\t".repeat(4)
var wildernessBoss = Array(
	Array(104000400, 10000, "红蜗牛王                  #r（消耗1万金币）#b"),
	Array(100000005, 10000, "花蘑菇王                  #r（消耗1万金币）#b"),
	Array(800010100, 10000, "蓝蘑菇王                  #r（消耗1万金币）#b"),
	Array(105070002, 10000, "僵尸菇王                  #r（消耗1万金币）#b"),
	Array(105090900, 10000, "黑蝙蝠怪                  #r（消耗1万金币）#b"),
	Array(240020401, 10000, "神木火龙                  #r（消耗1万金币）#b"),
	Array(240020101, 10000, "神木天鹰                  #r（消耗1万金币）#b"),
	Array(270010500, 10000, "神殿多多                  #r（消耗1万金币）#b"),
	Array(270020500, 10000, "神殿冰马                  #r（消耗1万金币）#b"),
	Array(270030500, 10000, "神殿雷卡                  #r（消耗1万金币）#b"),
	Array(801010000, 10000, "街道保镖                  #r（消耗1万金币）#b"),
	Array(801020000, 10000, "街道大姐                  #r（消耗1万金币）#b"),
	Array(801030000, 10000, "街道老板                  #r（消耗1万金币）#b"),
);


var bossmaps = Array(
	Array(701010322, 380000, "蜈蚣BOSS                  #r（消耗38万金币）#b"),
	Array(230040420, 380000, "鱼王BOSS                  #r（消耗38万金币）#b"),
	Array(220080000, 380000, "闹钟BOSS                  #r（消耗38万金币）#b"),
		Array(211042300,380000,"扎昆BOSS                  #r（消耗38万金币）#b"),
        Array(702070400,380000,"妖僧BOSS                  #r（消耗38万金币）#b"),
	Array(541020700, 380000, "树精BOSS                  #r（消耗38万金币）#b"),
	Array(551030100, 380000, "暴力心疤                  #r（消耗38万金币）#b"),
	Array(105100100, 380000, "巨魔蝙蝠                  #r（消耗38万金币）#b"),
		Array(240040700,380000,"暗黑龙王                  #r（消耗38万金币）#b"),
	Array(270000100, 380000, "时间宠儿                #r（消耗38万金币）#b")
		);
//------------------------------------------------------------------------
// 练级传送的怪物地图（统一用\t分隔等级范围）
var monstermaps = Array(
	Array(50000,     500,  `危险的树林#r（500金币）#b\t适合 1 ~ 15`),
	Array(104040000, 500,  `射手训练场#r（500金币）#b\t适合 1 ~ 15`),
	Array(104010001, 580,  `猪的海岸#r（580金币）#b\t适合 8 ~ 15`),
	Array(101010100, 580,  `大木林#r（580金币）#b\t适合 8 ~ 15`),
	Array(102020200, 580,  `西部岩山3#r（580金币）#b\t适合 8 ~ 15`),
	Array(107000500, 580,  `黑森林西入口#r（580金币）#b\t适合 8 ~ 15`),
	Array(103000101, 680,  `地铁1区#r（680金币）#b\t适合 20 ~ 25`),
	Array(101030102, 780,  `遗迹发掘地2#r（780金币）#b\t适合 25 ~ 30`),
	Array(105070001, 780,  `露台大厅#r（780金币）#b\t适合 25 ~ 30`),
	Array(220010500, 780,  `蚂蚁广场#r（780金币）#b\t适合 25 ~ 30`),
	Array(105070400, 780,  `火独眼兽4#r（780金币）#b\t适合 25 ~ 30`),
	Array(106000140, 880,  `火焰之地5#r（880金币）#b\t适合 25 ~ 35`),
	Array(101030001, 880,  `野猪的领土2#r（880金币）#b\t适合 25 ~ 35`),
	Array(101030406, 880,  `东部岩山7#r（880金币）#b\t适合 25 ~ 35`),
	Array(200040000, 880,  `云彩公园3#r（880金币）#b\t适合 25 ~ 35`),
	Array(105040200, 880,  `黑森林狩猎场2#r（880金币）#b\t适合 25 ~ 35`),
	Array(101020009, 880,  `北部训练场8#r（880金币）#b\t适合 25 ~ 35`),
	Array(260010100, 880, `仙人掌沙漠1#r（16668金币）#b\t适合 25 ~ 35`),
	Array(103000105, 3888,  `第4地区#r（3888金币）#b\t适合 35 ~ 50`),
	Array(100040103, 5888, `猴子森林2#r（5888金币）#b\t适合 35 ~ 50`),
	Array(105080000, 5888, `龙族打猎场#r（5888金币）#b\t适合 35 ~ 50`),
	Array(105090300, 5888, `龙穴#r（5888金币）#b\t适合 35 ~ 50`),
	Array(230010200, 5888, `红珊瑚树林#r（5888金币）#b\t适合 35 ~ 50`),
	Array(230020200, 5888, `沙城#r（5888金币）#b\t适合 35 ~ 50`),
	Array(220040000, 9998, `时间之路1#r（9998金币）#b\t适合 45 ~ 60`),
	Array(101030107, 9998, `遗迹之墓3#r（9998金币）#b\t适合 45 ~ 60`),
	Array(110030001, 9998, `青螃蟹海滩2#r（9998金币）#b\t适合 45 ~ 60`),
	Array(222010100, 9998, `小池塘#r（9998金币）#b\t适合 45 ~ 60`),
	Array(105040306, 16668, `巨人之林#r（16668金币）#b\t适合 50 ~ 65`),
	Array(105090311, 16668, `冰冷的摇篮#r（16668金币）#b\t适合 50 ~ 65`),
	Array(200010200, 16668, `天空楼梯1#r（16668金币）#b\t适合 50 ~ 65`),
	Array(211040000, 16668, `雪人谷#r（16668金币）#b\t适合 50 ~ 65`),
	Array(211040400, 16668, `尖锐的绝壁2#r（16668金币）#b\t适合 50 ~ 65`),
	Array(211040700, 16668, `危险的绝壁#r（16668金币）#b\t适合 50 ~ 65`),
	Array(211041100, 16668, `死亡之林1#r（16668金币）#b\t适合 50 ~ 65`),
	Array(211041700, 16668, `废矿区3#r（16668金币）#b\t适合 50 ~ 65`),
	Array(261020400, 16668, `研究所C-2#r（16668金币）#b\t适合 50 ~ 65`),
	Array(261010103, 16668, `研究所203#r（16668金币）#b\t适合 50 ~ 65`),
	Array(250010100, 16668, `通天林小道#r（16668金币）#b\t适合 55 ~ 75`),
	Array(250010500, 16668, `蟠桃果林1#r（16668金币）#b\t适合 55 ~ 75`),
	Array(251010200, 16668, `百年药草地#r（16668金币）#b\t适合 55 ~ 75`),
	Array(250010304, 16668, `流浪熊的地盘#r（16668金币）#b\t适合 55 ~ 75`),
	Array(251010402, 21118, `海盗团老巢2#r（21118金币）#b\t适合 65 ~ 75`),
	Array(541010010, 21118, `幽灵船2#r（21118金币）#b\t适合 60 ~ 80`),
	Array(600020300, 21118, `狼蛛洞穴#r（21118金币）#b\t适合 80 ~ 90`),
	Array(240010101, 21118, `毛毛森林#r（21118金币）#b\t适合 80 ~ 90`),
	Array(240010500, 21118, `山羊峡谷#r（21118金币）#b\t适合 85 ~ 100`),
	Array(240020100, 21118, `火焰死亡战场#r（21118金币）#b\t适合 85 ~ 100`),
	Array(240020400, 21118, `寒冰半人马#r（21118金币）#b\t适合 85 ~ 100`),
	Array(240030100, 21118, `龙林1#r（21118金币）#b\t适合 85 ~ 100`),
	Array(240040400, 21118, `飞龙的峡谷#r（21118金币）#b\t适合 85 ~ 100`),
	Array(240040520, 21118, `遭破坏龙穴#r（21118金币）#b\t适合 85 ~ 100`),
	Array(211042200, 21118, `艰苦洞穴3#r（21118金币）#b\t适合 85 ~ 100`),
	Array(220060200, 21118, `扭曲时间3#r（21118金币）#b\t适合 85 ~ 100`),
	Array(220070200, 21118, `时间消失3#r（21118金币）#b\t适合 85 ~ 100`),
	Array(230040200, 25558, `危海峡谷1#r（25558金币）#b\t适合 90 ~ 100`),
	Array(230040000, 25558, `深海峡谷1#r（25558金币）#b\t适合 90 ~ 100`),
	Array(230040400, 25558, `受难船的墓地#r（25558金币）#b\t适合 90 ~ 100`),
	Array(551010000, 25558, `梦幻主题公园#r（25558金币）#b\t适合 80 ~ 100`),
	Array(551030100, 25558, `阴森世界入口#r（25558金币）#b\t适合 95 ~ 120`),
	Array(240030102, 25558, `消失的树林#r（25558金币）#b\t适合 100 ~ 120`),
	Array(240040511, 25558, `被遗忘的龙之巢#r（25558金币）#b\t适合 105 ~ 130`),
	Array(541020000, 28888, `乌鲁城入口#r（28888金币）#b\t适合 105 ~ 150`),
	Array(541020300, 28888, `乌鲁庄园3#r（28888金币）#b\t适合 105 ~ 150`),
	Array(541020500, 28888, `乌鲁城中心#r（28888金币）#b\t适合 105 ~ 150`),
	Array(270010300, 28888, `追忆之路3#r（28888金币）#b\t适合 105 ~ 150`),
	Array(270020300, 28888, `后悔之路3#r（28888金币）#b\t适合 105 ~ 150`),
	Array(270030300, 28888, `忘却之路3#r（28888金币）#b\t适合 105 ~ 150`),
);

//------------------------------------------------------------------------		

//------------------------------------------------------------------------

var townmaps = Array(
	//Array(910000000,520,"自由市场#r             （消耗520金币）#b"),
	//Array(701000210,0,"大擂台"),
	Array(1000000,100,"彩虹岛新手村#r         （消耗1百金币）#b"),
	Array(100000104, 500, "美容美发#r               （消耗5百金币）#b"),
	Array(104000000, 500, "明珠港#r               （消耗5百金币）#b"),
	Array(100000000, 800, "射手村#r               （消耗8百金币）#b"),
	Array(101000000, 800, "魔法密林#r             （消耗8百金币）#b"),
	Array(102000000, 800, "勇士部落#r             （消耗8百金币）#b"),
	Array(103000000, 800, "废弃都市#r             （消耗8百金币）#b"),
	Array(120000000, 800, "诺特勒斯#r             （消耗8百金币）#b"),
	Array(105040300, 1000, "林中之城#r             （消耗1千金币）#b"),
	Array(140000000, 1000, "里恩城镇#r                 （消耗1千金币）#b"),
	Array(200000000, 1000, "天空之城#r             （消耗1千金币）#b"),
	Array(211000000, 5000, "冰峰雪域#r             （消耗5千金币）#b"),
	Array(230000000, 1000, "水下世界#r             （消耗1千金币）#b"),
	Array(222000000, 1000, "童话之村#r               （消耗1千金币）#b"),
	Array(220000000, 5000, "玩具之城#r               （消耗5千金币）#b"),
	Array(701000000, 5000, "东方神州#r             （消耗5千金币）#b"),
	Array(250000000, 5000, "武陵之城#r                 （消耗5千金币）#b"),
	Array(702000000, 1000, "少林的寺#r               （消耗1千金币）#b"),
	//Array(500000000,1000,"泰国#r                 （消耗1千金币）#b"),
	Array(260000000, 500, "阿里安特#r             （消耗5百金币）#b"),
	Array(600000000, 500, "新叶之城#r               （消耗5百金币）#b"),
	Array(240000000, 5000, "神木之村#r               （消耗5千金币）#b"),
	Array(261000000, 1000, "马加提亚#r             （消耗1千金币）#b"),
	Array(221000000, 1000, "地球防御本部#r         （消耗1千金币）#b"),
	Array(251000000, 1000, "百草堂#r               （消耗1千金币）#b"),
	Array(701000200, 10000, "上海豫园#r             （消耗1万金币）#b"),
	Array(550000000, 10000, "吉隆都市#r           （消耗1万金币）#b"),
	Array(130000000, 1000, "圣地#r                 （消耗1千金币）#b"),
	Array(551000000, 1000, "甘榜之村#r               （消耗1千金币）#b"),
	Array(801000000, 1000, "昭和之村#r               （消耗1千金币）#b"),
	Array(540010000, 1000, "新加坡机场#r           （消耗1千金币）#b"),
	Array(541000000, 1000, "新加坡码头#r           （消耗1千金币）#b"),
	Array(300000000, 1000, "艾林森林#r             （消耗1千金币）#b"),
	Array(270000100, 10000, "时间神殿#r             （消耗1万金币）#b"),
	Array(702100000, 10000, "藏经阁#r               （消耗1万金币）#b"),
	Array(800000000, 10000, "古代神社#r             （消耗1万金币）#b"),
	Array(130000200, 10000, "圣地岔路#r             （消耗1万金币）#b"),
	Array(925020000, 1000, "武陵道场#r         （消耗1千金币）#b"),
	Array(300000000, 5000, "阿尔泰营地#r             （消耗5千金币）#b"),
	//Array(702090101,1000,"英语村#r               （消耗1千金币）#b"),
	//Array(700000000,10000,"红鸾宫#r               （消耗1万金币）#b")
	//Array(749020000,0,"国庆蛋糕地图")
);

//------------------------------------------------------------------------

var fubenmaps = Array(
        Array(109080000,0,"#b打椰子                   #r（获得北斗纪念币）#k "),
        //Array(109080010,0,"#冰地                      #r（获得北斗纪念币）#k "),
        Array(109040001,0,"#b高地跳跳                 #r（获得北斗纪念币）#k "),
		Array(109030001,0,"#b上楼                     #r（获得北斗纪念币）#k "),
		Array(109060000,0,"#b滚雪球                   #r（获得北斗纪念币）#k "),
		Array(109010000,0,"#b寻宝                     #r（获得北斗纪念币）#k "),
		Array(105040316,10,"#b森林跳跳                #r（获得北斗纪念币）#k "),	
		Array(103000900,10,"#b地铁跳跳                #r（获得北斗纪念币）#k "),    
		Array(280020000,10,"#b火山跳跳                #r（获得北斗纪念币）#k "), 
		Array(101000100,10,"#b忍苦跳跳                #r（获得北斗纪念币）#k ") 											
		);

//------------------------------------------------------------------------	
		
		
var status;

//Start
function start() 
{
	levelStart();
}

/**
 * @description 如果是sendSelectLevel，那么会根据玩家的选项自动路由到对应的level+selection方法
 */
function levelStart() {
	let text = `尊贵的 ${cm.getPlayer().getName()}，您想去哪里呢？\r\n`;
	text += `#L2#城镇地图#l\t#L1##r练级地图#k#l\t#L4#野外BOSS#l\t#L0#BOSS地图#l\r\n`;
	text += `#L3#活动跳跳坐牢地图#l\r\n`;
    cm.sendSelectLevel(text);
}

function level0() {
	let text = "#b";
    for (let i = 0; i < bossmaps.length; i++) {  
       text += "#L" + i + "#" + bossmaps[i][2] + "#l\r\n";
    }	
	cm.sendNextSelectLevel("Boss", text);
}

function level1() {
	let text = "#b";
    for (let i = 0; i < monstermaps.length; i++) {  
       text += "#L" + i + "#" + monstermaps[i][2] + "#l\r\n";
    }	
	cm.sendNextSelectLevel("LevelUp", text);
}

function level2() {
	let text = "#b";
    for (let i = 0; i < townmaps.length; i++) {  
       text += "#L" + i + "#" + townmaps[i][2] + "#l\r\n";
    }	
	cm.sendNextSelectLevel("Town", text);
}

function level3() {
	let text = "#r注意：活动地图还有bug，请谨慎前往！#k\r\n#b";
    for (let i = 0; i < fubenmaps.length; i++) {  
       text += "#L" + i + "#" + fubenmaps[i][2] + "#l\r\n";
    }	
	cm.sendNextSelectLevel("Fuben", text);
}

function level4() {
	let text = "#b";
	for (let i = 0; i < wildernessBoss.length; i++) {
		text += "#L" + i + "#" + wildernessBoss[i][2] + "#l\r\n";
	}
	cm.sendNextSelectLevel("WildernessBoss", text);
}

//----------------------------------------------------------------------------------
function levelWildernessBoss(selection) {
	cm.gainMeso(-wildernessBoss[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.getPlayer().dropMessage(6, "[传送中心]：[" + cm.getPlayer().getName() + "玩家] [线路-" + cm.getPlayer().getClient().getChannel() + "] 传送至 " + getMapLabel(wildernessBoss[selection][2]));
	cm.warp(wildernessBoss[selection][0]);
	cm.dispose();
}
function levelBoss(selection) {
	cm.gainMeso(-bossmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.getPlayer().dropMessage(6, "[传送中心]：[" + cm.getPlayer().getName() + "玩家] [线路-" + cm.getPlayer().getClient().getChannel() + "] 传送至 " + getMapLabel(bossmaps[selection][2]));
	cm.warp(bossmaps[selection][0]);
	cm.dispose();
}

function levelLevelUp(selection) {
	cm.gainMeso(-monstermaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.getPlayer().dropMessage(6, "[传送中心]：[" + cm.getPlayer().getName() + "玩家] [线路-" + cm.getPlayer().getClient().getChannel() + "] 传送至 " + getMapLabel(monstermaps[selection][2]));
	cm.warp(monstermaps[selection][0]);
	cm.dispose();
}

function levelTown(selection) {
	cm.gainMeso(-townmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.getPlayer().dropMessage(6, "[传送中心]：[" + cm.getPlayer().getName() + "玩家] [线路-" + cm.getPlayer().getClient().getChannel() + "] 传送至 " + getMapLabel(townmaps[selection][2]));
	cm.warp(townmaps[selection][0]);
	cm.dispose();
}

function levelFuben(selection) {
	cm.gainMeso(-fubenmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.getPlayer().dropMessage(6, "[传送中心]：[" + cm.getPlayer().getName() + "玩家] [线路-" + cm.getPlayer().getClient().getChannel() + "] 传送至 " + getMapLabel(fubenmaps[selection][2]));
	cm.warp(fubenmaps[selection][0]);
	cm.dispose();
}

// 从地图标签文本中提取纯地图名（去掉颜色码和费用说明）
function getMapLabel(raw) {
	return String(raw).replace(/#[a-zA-Z]/g, "").replace(/（.*?）/g, "").replace(/\t.*/g, "").trim();
}
//----------------------------------------------------------------------------------