/* ==================
 脚本类型: 万能传送   
 脚本作者：汉堡  
 联系方式：北斗项目组
 =====================
 */
//------------------------------------------------------------------------
var bossmaps = Array(
    Array(230040420, 0, "鱼王BOSS                  #r（消耗0金币）#b"),
    Array(220080000, 0, "闹钟BOSS                  #r（消耗0金币）#b"),
    Array(211042300, 0, "扎昆BOSS                  #r（消耗0金币）#b"),
    Array(702070400, 0, "妖僧BOSS                  #r（消耗0金币）#b"),
    Array(541020700, 0, "树精BOSS                  #r（消耗0金币）#b"),
    Array(105100100, 0, "巨魔蝙蝠                  #r（消耗0金币）#b"),
    Array(240040700, 0, "暗黑龙王                  #r（消耗0金币）#b"),
    Array(270000100, 0, "品克缤BOSS                #r（消耗0金币）#b")
);

//------------------------------材料收集------------------------------------------

var collectMaterial = Array(
    Array(106021300, 0, "摩天楼6#r（0金币）#b         折断的枪"),
    Array(200040000, 0, "云彩公园Ⅲ#r（0金币）#b       星星"),
    Array(211041500, 0, "废矿区Ⅰ#r（0金币）#b       牙齿"),
    Array(221030100, 0, "鲁斯韦尔草原#r（0金币）#b       外星人"),
    Array(222010400, 0, "鬼怪山脊#r（0金币）#b       扫帚"),
);
//------------------------------练级地图------------------------------------------

var monstermaps = Array(
    Array(104040000, 0, "射手训练场#r（0金币）#b       适合 1 ~ 15 级玩家"),
    Array(101010100, 0, "大木林#r（0金币）#b          适合 8 ~ 15 级玩家"),
    Array(103000101, 0, "地铁<第1地区>#r（0金币）#b    适合 20 ~ 25 级玩家"),
    Array(107000500, 0, "黑森林西入口#r（0金币）#b　  　适合 20 ~ 25 级玩家"),
    Array(220010500, 0, "露台大厅#r（0金币）#b         适合 25 ~ 30 级玩家"),
    Array(101030001, 0, "野猪的领土Ⅱ#r（0金币）#b　 　 适合 25 ~ 35 级玩家"),
    Array(103000105, 0, "地铁<第4地区>#r（0金币）#b　  适合 35 ~ 50 级玩家"),
    Array(100040103, 0, "猴子森林Ⅱ#r（0金币）#b 　　　 适合 35 ~ 50 级玩家"),
    Array(106000140, 0, "火焰之地Ⅴ#r（0金币）#b 　　　 适合 35 ~ 50 级玩家"),
    Array(220040000, 0, "时间之路1#r（0金币）#b　 　　　适合 45 ~ 60 级玩家"),
    Array(105040306, 0, "巨人之林#r（0金币）#b　　 　 　适合 50 ~ 65 级玩家"),
    Array(250010304, 0, "流浪熊的地盘#r（0金币）#b 　 　适合 55 ~ 75 级玩家"),
    Array(251010402, 0, "海盗团老巢2#r（0金币）#b　　 　适合 65 ~ 75 级玩家"),
    Array(541010010, 0, "幽灵船2#r（0金币）#b　　　 　　适合 60 ~ 80 级玩家"),
    Array(240010101, 0, "毛毛森林#r（0金币）#b　　　 　　适合 60 ~ 80 级玩家"),
    Array(600020300, 0, "狼蛛洞穴#r（0金币）#b　　　  　适合 80 ~ 90 级玩家"),
    Array(240010500, 0, "山羊峡谷#r（0金币）#b　　  　　适合 85 ~ 100 级玩家"),
    Array(240020401, 0, "喷火龙栖息地#r（0金币）#b　　  　　适合 85 ~ 100 级玩家"),
    Array(220070200, 0, "时间消失之路3#r（0金币）#b　　 适合 85 ~ 100 级玩家"),
    Array(230040100, 0, "深海峡谷2#r（0金币）#b　　 　　适合 90 ~ 100 级玩家"),
    Array(220060300, 0, "扭曲的时间4#r（0金币）#b　　 　适合 90 ~ 100 级玩家"),
    Array(551030100, 0, "阴森世界入口#r（0金币）#b　　　 适合 95 ~ 120 级玩家"),
    Array(240030102, 0, "消失的树林#r（0金币）#b　  　　适合 100 ~ 120 级玩家"),
    Array(230040300, 0, "危海峡谷2#r（0金币）#b　  　　适合 100 ~ 120 级玩家"),
    Array(240040500, 0, "龙之巢穴入口#r（0金币）#b  　适合 105 ~ 130 级玩家"),
    Array(240040511, 0, "被遗忘的龙之巢#r（0金币）#b  　适合 105 ~ 130 级玩家"),
    Array(541020000, 0, "乌鲁城入口#r（0金币）#b　　  　适合 105 ~ 150 级玩家")
);

//------------------------------------------------------------------------		

//------------------------------城镇地图------------------------------------------

var townmaps = Array(
    Array(910000000, 0, "自由市场#r             （消耗0金币）#b"),
    Array(701000210, 0, "大擂台"),
    Array(1000000, 0, "彩虹岛新手村#r         （消耗0金币）#b"),
    Array(104000000, 0, "明珠港#r               （消耗0金币）#b"),
    Array(100000000, 0, "射手村#r               （消耗0金币）#b"),
    Array(101000000, 0, "魔法密林#r             （消耗0金币）#b"),
    Array(102000000, 0, "勇士部落#r             （消耗0金币）#b"),
    Array(103000000, 0, "废弃都市#r             （消耗0金币）#b"),
    Array(120000000, 0, "诺特勒斯号码头#r       （消耗0金币）#b"),
    Array(105040300, 0, "林中之城#r             （消耗0金币）#b"),
    Array(140000000, 0, "里恩#r                 （消耗0金币）#b"),
    Array(200000000, 0, "天空之城#r             （消耗0金币）#b"),
    Array(211000000, 0, "冰峰雪域#r             （消耗0金币）#b"),
    Array(230000000, 0, "水下世界#r             （消耗0金币）#b"),
    Array(222000000, 0, "童话村#r               （消耗0金币）#b"),
    Array(220000000, 0, "玩具城#r               （消耗0金币）#b"),
    Array(701000000, 0, "东方神州#r             （消耗0金币）#b"),
    Array(250000000, 0, "武陵#r                 （消耗0金币）#b"),
    Array(702000000, 0, "少林寺#r               （消耗0金币）#b"),
    Array(500000000, 0, "泰国#r                 （消耗0金币）#b"),
    Array(260000000, 0, "阿里安特#r             （消耗0金币）#b"),
    Array(600000000, 0, "新叶城#r               （消耗0金币）#b"),
    Array(240000000, 0, "神木村#r               （消耗0金币）#b"),
    Array(261000000, 0, "马加提亚#r             （消耗0金币）#b"),
    Array(221000000, 0, "地球防御本部#r         （消耗0金币）#b"),
    Array(251000000, 0, "百草堂#r               （消耗0金币）#b"),
    Array(701000200, 0, "上海豫园#r             （消耗0金币）#b"),
    Array(550000000, 0, "吉隆大都市#r           （消耗0金币）#b"),
    Array(130000000, 0, "圣地#r                 （消耗0金币）#b"),
    Array(551000000, 0, "甘榜村#r               （消耗0金币）#b"),
    Array(801000000, 0, "昭和村#r               （消耗0金币）#b"),
    Array(540010000, 0, "新加坡机场#r           （消耗0金币）#b"),
    Array(541000000, 0, "新加坡码头#r           （消耗0金币）#b"),
    Array(300000000, 0, "艾林森林#r             （消耗0金币）#b"),
    Array(270000100, 0, "时间神殿#r             （消耗0金币）#b"),
    Array(702100000, 0, "藏经阁#r               （消耗0金币）#b"),
    Array(800000000, 0, "古代神社#r             （消耗0金币）#b"),
    Array(130000200, 0, "圣地岔路#r             （消耗0金币）#b"),
    Array(925020000, 0, "武陵道场入口#r         （消耗0金币）#b"),
    Array(930000000, 0, "毒雾森林#r             （消耗0金币）#b"),
    Array(930000010, 0, "森林入口#r             （消耗0金币）#b"),
    Array(702090101, 0, "英语村#r               （消耗0金币）#b"),
    Array(700000000, 0, "红鸾宫#r               （消耗0金币）#b"),
    Array(749020000, 0, "国庆蛋糕地图"),
);

//----------------------------------活动副本--------------------------------------

var fubenmaps = Array(
    Array(109080000, 0, "#b打椰子                   #r（获得XiaoYe纪念币）#k "),
    Array(109080010, 0, "#冰地                      #r（获得XiaoYe纪念币）#k "),
    Array(109040001, 0, "#b高地跳跳                 #r（获得XiaoYe纪念币）#k "),
    Array(109030001, 0, "#b上楼                     #r（获得XiaoYe纪念币）#k "),
    Array(109060000, 0, "#b滚雪球                   #r（获得XiaoYe纪念币）#k "),
    Array(109010000, 0, "#b寻宝                     #r（获得XiaoYe纪念币）#k "),
    Array(105040316, 0, "#b森林跳跳                #r（获得XiaoYe纪念币）#k "),
    Array(103000900, 0, "#b地铁跳跳                #r（获得XiaoYe纪念币）#k "),
    Array(280020000, 0, "#b火山跳跳                #r（获得XiaoYe纪念币）#k "),
    Array(101000100, 0, "#b忍苦跳跳                #r（获得XiaoYe纪念币）#k ")
);

//------------------------------------------------------------------------	


var status;

//Start
function start() {
    levelStart();
}

/**
 * @description 如果是sendSelectLevel，那么会根据玩家的选项自动路由到对应的level+selection方法
 */
function levelStart() {
    let text = "尊贵的GM大人，您想去哪里呢？\r\n";
    text += "#L0#BOSS地图#l\r\n";
    text += "#L1#练级地图#l\r\n";
    text += "#L2#城镇地图#l\r\n";
    text += "#L3#活动跳跳坐牢地图#l\r\n";
    cm.sendSelectLevel(text);
}

function level0() {
    let text = "#b";
    for (let i = 0; i < bossmaps.length; i++) {
        text += "#L" + i + "#" + bossmaps[i][2] + "#l\r\n";
    }
    cm.sendNextSelectLevel("Boss", text);
}

function level1() {
    let text = "#b";
    for (let i = 0; i < monstermaps.length; i++) {
        text += "#L" + i + "#" + monstermaps[i][2] + "#l\r\n";
    }
    cm.sendNextSelectLevel("LevelUp", text);
}

function level2() {
    let text = "#b";
    for (let i = 0; i < townmaps.length; i++) {
        text += "#L" + i + "#" + townmaps[i][2] + "#l\r\n";
    }
    cm.sendNextSelectLevel("Town", text);
}

function level3() {
    let text = "#r注意：活动地图还有bug，请谨慎前往！#k\r\n#b";
    for (let i = 0; i < fubenmaps.length; i++) {
        text += "#L" + i + "#" + fubenmaps[i][2] + "#l\r\n";
    }
    cm.sendNextSelectLevel("Fuben", text);
}

//----------------------------------------------------------------------------------
function levelBoss(selection) {
    cm.gainMeso(-bossmaps[selection][1]);
    cm.getPlayer().saveLocationOnWarp();
    cm.warp(bossmaps[selection][0]);
    cm.dispose();
}

function levelLevelUp(selection) {
    cm.gainMeso(-monstermaps[selection][1]);
    cm.getPlayer().saveLocationOnWarp();
    cm.warp(monstermaps[selection][0]);
    cm.dispose();
}

function levelTown(selection) {
    cm.gainMeso(-townmaps[selection][1]);
    cm.getPlayer().saveLocationOnWarp();
    cm.warp(townmaps[selection][0]);
    cm.dispose();
}

function levelFuben(selection) {
    cm.gainMeso(-fubenmaps[selection][1]);
    cm.getPlayer().saveLocationOnWarp();
    cm.warp(fubenmaps[selection][0]);
    cm.dispose();
}

//----------------------------------------------------------------------------------
