/* ==================
 脚本类型: 万能传送
 脚本作者：汉堡
 联系方式：北斗项目组
 =====================
 */
//------------------------------------------------------------------------
// 远征boss
var bossmaps = Array(
	Array(230040420, 100000, "鱼王BOSS                  #r（消耗10万金币）#b"),
	Array(220080000, 100000, "闹钟BOSS                  #r（消耗10万金币）#b"),
	Array(211042300, 300000, "扎昆BOSS                  #r（消耗30万金币）#b"),
	Array(702070400, 300000, "妖僧BOSS                  #r（消耗30万金币）#b"),
	Array(240050400, 1000000, "暗黑龙王BOSS              #r（消耗100万金币）#b"),
	Array(270050000, 1000000, "品克缤BOSS                #r（消耗100万金币）#b")
);
//------------------------------------------------------------------------
// 精英boss
var elitebossmaps = Array(
	// ===== 低级 (5万) =====
	Array(104000400, 50000, "蜗牛王BOSS(Mano)          #r（消耗5万金币）#b"),
	Array(101030404, 50000, "树妖王BOSS(Stumpy)        #r（消耗5万金币）#b"),
	Array(100000005, 50000, "蘑菇王BOSS(Mushmom)       #r（消耗5万金币）#b"),
	// ===== 中低级 (10万) =====
	Array(105100100, 100000, "巨型蝙蝠怪BOSS             #r（消耗10万金币）#b"),
	Array(230040410, 100000, "左鱼王BOSS                #r（消耗10万金币）#b"),
	Array(260010201, 100000, "大宇BOSS(Deo)             #r（消耗10万金币）#b"),
	Array(110040000, 100000, "海龙王BOSS(King Clang)    #r（消耗10万金币）#b"),
	Array(100040105, 100000, "浮士德BOSS(Faust)         #r（消耗10万金币）#b"),
	Array(105070002, 100000, "僵尸蘑菇王BOSS             #r（消耗10万金币）#b"),
	Array(105090900, 100000, "小巴尔罗格BOSS             #r（消耗10万金币）#b"),
	Array(220050100, 100000, "时间门神BOSS(Timer)       #r（消耗10万金币）#b"),
	Array(230020100, 100000, "瑟鲁夫BOSS(Seruf)         #r（消耗10万金币）#b"),
	Array(103000105, 100000, "暗影BOSS(Shade)           #r（消耗10万金币）#b"),
	// ===== 中级 (15万) =====
	Array(251010102, 150000, "蜈蚣王BOSS                #r（消耗15万金币）#b"),
	Array(107000300, 150000, "迪勒BOSS(Dyle)            #r（消耗15万金币）#b"),
	Array(211010000, 150000, "雪女BOSS(Snow Witch)      #r（消耗15万金币）#b"),
	Array(222010300, 150000, "书生幽灵BOSS               #r（消耗15万金币）#b"),
	Array(200010300, 150000, "艾利杰BOSS(Eliza)         #r（消耗15万金币）#b"),
	Array(211041100, 150000, "利奇BOSS(Riche)           #r（消耗15万金币）#b"),
	Array(261020200, 150000, "鲁鲁莫BOSS(Rurumo)        #r（消耗15万金币）#b"),
	Array(221040301, 150000, "芝诺BOSS(Zeno)            #r（消耗15万金币）#b"),
	Array(800020120, 150000, "竹武士BOSS                #r（消耗15万金币）#b"),
	// ===== 中高级 (20万) =====
	Array(682000001, 200000, "无头骑士BOSS               #r（消耗20万金币）#b"),
	Array(211040101, 200000, "雪男BOSS                  #r（消耗20万金币）#b"),
	Array(800020130, 200000, "九尾狐BOSS                #r（消耗20万金币）#b"),
	Array(250010304, 200000, "泰伦BOSS(Tae Roon)        #r（消耗20万金币）#b"),
	Array(250010504, 200000, "智慧猫王BOSS               #r（消耗20万金币）#b"),
	Array(261030000, 200000, "奇美拉BOSS(Chimera)       #r（消耗20万金币）#b"),
	Array(105090310, 200000, "零食吧BOSS(Snack Bar)     #r（消耗20万金币）#b"),
	// ===== 高级 (30万) =====
	Array(240020401, 300000, "喷火龙BOSS(Manon)         #r（消耗30万金币）#b"),
	Array(240020101, 300000, "格瑞芬多BOSS(Griffey)     #r（消耗30万金币）#b"),
	Array(251010404, 300000, "船老大BOSS                #r（消耗30万金币）#b"),
	Array(240040401, 300000, "利维坦BOSS(Leviathan)     #r（消耗30万金币）#b"),
	Array(270010500, 300000, "多多BOSS(Dodo)            #r（消耗30万金币）#b"),
	Array(270020500, 300000, "莉里诺斯BOSS(Lilynouch)   #r（消耗30万金币）#b"),
	Array(270030500, 300000, "雷卡BOSS(Lyka)            #r（消耗30万金币）#b"),

	);
//------------------------------------------------------------------------
// 练级地图
var monstermaps = Array(
		Array(104040000,1000,"射手训练场               适合 1 ~ 15 级"),
		Array(104010001,1000,"猪的海岸               适合 10 ~ 15 级"),
		Array(101010100,1000,"大木林1               适合 8 ~ 15 级"),
		Array(103000101,1000,"地铁<第1地区>               适合 20 ~ 25 级"),
		Array(220010500,1000,"露台大厅               适合 25 ~ 30 级"),
		Array(101030001,1000,"野猪的领土2               适合 25 ~ 35 级"),
		Array(106000100,1000,"火焰之地1               适合 25 ~ 35 级"),
		Array(105040200,1000,"黑森林打猎场2               适合 30 ~ 45 级"),
		Array(103000105,1000,"地铁\<第4地区\>               适合 35 ~ 50 级"),
		Array(100040103,1000,"猴子森林2               适合 35 ~ 50 级"),
		Array(106000130,1000,"火焰之地4               适合 40 ~ 50 级"),
		Array(220040000,1000,"时间之路1               适合 45 ~ 60 级"),
		Array(105040306,1000,"巨人之林               适合 50 ~ 65 级"),
		Array(541010010,1000,"幽灵船2               适合 45 ~ 70 级"),
		Array(541010050,1000,"幽灵船6               适合 45 ~ 70 级"),
		Array(105090300,1000,"龙穴               适合 50 ~ 70 级"),
		Array(261020400,1000,"研究所 C-2 地区               适合 50 ~ 70 级"),
		Array(211041600,1000,"废矿区 1               适合 50 ~ 70 级"),
		Array(250030100,1000,"第一军营               适合 55 ~ 80 级"),
		Array(250010304,1000,"流浪熊的地盘               适合 55 ~ 75 级"),
		Array(251010402,1000,"海盗团老巢2               适合 65 ~ 75 级"),
		Array(600020300,1000,"狼蛛洞穴               适合 80 ~ 90 级"),
		Array(220070200,1000,"消失之路3               适合 80 ~ 100 级"),
		Array(220070300,1000,"消失之路4               适合 80 ~ 100 级"),
		Array(220060200,1000,"扭曲的时间3               适合 80 ~ 100 级"),
		Array(220060300,1000,"扭曲的时间4               适合 80 ~ 100 级"),
		Array(240010500,1000,"山羊峡谷               适合 85 ~ 100 级"),
		Array(230040100,1000,"深海峡谷2               适合 90 ~ 100 级"),
		Array(230040300,1000,"危海峡谷2               适合 90 ~ 100 级"),
		Array(230040400,1000,"受难船的墓地               适合 90 ~ 100 级"),
		Array(551030100,1000,"阴森世界入口               适合 95 ~ 120 级"),
		Array(541020000,1000,"乌鲁城入口               适合 95 ~ 120 级"),
		Array(251010000,1000,"乌鲁城中心               适合 95 ~ 120 级"),
		Array(240030102,1000,"消失的树林               适合 100 ~ 120 级"),
		Array(240040511,1000,"被遗忘的龙之巢               适合 105 ~ 130 级"),
		Array(270030400,1000,"时间神殿追忆5                适合 105 ~ 150 级"),
		Array(270040400,1000,"时间神殿后悔5                适合 105 ~ 150 级"),
		Array(270050400,1000,"时间神殿忘却5                适合 105 ~ 150 级"),
		);

//------------------------------------------------------------------------
//城镇
var townmaps = Array(
	Array(910000000, 0, "自由市场#r             "),
		Array(1000000,100,"彩虹岛新手村#r         （消耗1百金币）#b"),
		Array(104000000,500,"明珠港#r               （消耗5百金币）#b"),
		Array(100000000,800,"射手村#r               （消耗8百金币）#b"),
		Array(101000000,800,"魔法密林#r             （消耗8百金币）#b"),
		Array(102000000,800,"勇士部落#r             （消耗8百金币）#b"),
		Array(103000000,800,"废弃都市#r             （消耗8百金币）#b"),
		Array(120000000,800,"诺特勒斯号码头#r       （消耗8百金币）#b"),
		Array(105040300,1000,"林中之城#r             （消耗1千金币）#b"),
		Array(140000000,1000,"里恩#r                 （消耗1千金币）#b"),
		Array(200000000,1000,"天空之城#r             （消耗1千金币）#b"),
		Array(211000000,5000,"冰峰雪域#r             （消耗5千金币）#b"),
		Array(230000000,1000,"水下世界#r             （消耗1千金币）#b"),
		Array(222000000,1000,"童话村#r               （消耗1千金币）#b"),
		Array(220000000,5000,"玩具城#r               （消耗5千金币）#b"),
		Array(701000000,5000,"东方神州#r             （消耗5千金币）#b"),
		Array(250000000,5000,"武陵#r                 （消耗5千金币）#b"),
		Array(702000000,1000,"少林寺#r               （消耗1千金币）#b"),
	Array(500000000, 500, "泰国#r                 （消耗5百金币）#b"),
		Array(260000000,500,"阿里安特#r             （消耗5百金币）#b"),
		Array(600000000,500,"新叶城#r               （消耗5百金币）#b"),
		Array(240000000,5000,"神木村#r               （消耗5千金币）#b"),
		Array(261000000,1000,"马加提亚#r             （消耗1千金币）#b"),
		Array(221000000,1000,"地球防御本部#r         （消耗1千金币）#b"),
		Array(251000000,1000,"百草堂#r               （消耗1千金币）#b"),
		Array(701000200,10000,"上海豫园#r             （消耗1万金币）#b"),
		Array(550000000,10000,"吉隆大都市#r           （消耗1万金币）#b"),
		Array(130000000,1000,"圣地#r                 （消耗1千金币）#b"),
		Array(551000000,1000,"甘榜村#r               （消耗1千金币）#b"),
		Array(801000000,1000,"昭和村#r               （消耗1千金币）#b"),
		Array(540010000,1000,"新加坡机场#r           （消耗1千金币）#b"),
		Array(541000000,1000,"新加坡码头#r           （消耗1千金币）#b"),
		Array(300000000,1000,"艾林森林#r             （消耗1千金币）#b"),
		Array(270000100,10000,"时间神殿#r             （消耗1万金币）#b"),
		Array(702100000,10000,"藏经阁#r               （消耗1万金币）#b"),
		Array(800000000,10000,"古代神社#r             （消耗1万金币）#b"),
		Array(130000200,10000,"圣地岔路#r             （消耗1万金币）#b"),
		Array(925020000,1000,"武陵道场入口#r         （消耗1千金币）#b"),
		Array(930000000,5000,"毒雾森林#r             （消耗5千金币）#b"),
		Array(930000010,1000,"森林入口#r             （消耗1千金币）#b"),
	Array(702090101, 1000, "英语村#r               （消耗1千金币）#b"),
	Array(700000000, 10000, "红鸾宫#r               （消耗1万金币）#b")
		);

//------------------------------------------------------------------------

var fubenmaps = Array(
	Array(109080000, 0, "#b打椰子                   #r（获得北斗纪念币）#k "),
	Array(109080010, 0, "#冰地                      #r（获得北斗纪念币）#k "),
	Array(109040001, 0, "#b高地跳跳                 #r（获得北斗纪念币）#k "),
		Array(109030001,0,"#b上楼                     #r（获得北斗纪念币）#k "),
		Array(109060000,0,"#b滚雪球                   #r（获得北斗纪念币）#k "),
		Array(109010000,0,"#b寻宝                     #r（获得北斗纪念币）#k "),
		Array(105040316,10,"#b森林跳跳                #r（获得北斗纪念币）#k "),
		Array(103000900,10,"#b地铁跳跳                #r（获得北斗纪念币）#k "),
		Array(280020000,10,"#b火山跳跳                #r（获得北斗纪念币）#k "),
		Array(101000100,10,"#b忍苦跳跳                #r（获得北斗纪念币）#k ")
		);

//------------------------------------------------------------------------

var materialmaps = Array(
	// ===== 维多利亚 - 新手/明珠港/射手村 =====
	Array(1000000, 5000, 4000000, "蓝蜗牛壳 - 蓝蜗牛"),
	Array(1000001, 5000, 4000016, "红蜗牛壳 - 红蜗牛"),
	Array(100040001, 5000, 4000004, "绿液球 - 绿水灵"),
	Array(104040000, 5000, 4000017, "猪头 - 猪猪"),
	Array(104010001, 5000, 4000019, "蜗牛壳 - 蜗牛"),
	// ===== 维多利亚 - 魔法密林 =====
	Array(101010000, 5000, 4000005, "叶子 - 绿蘑菇"),
	Array(101010100, 5000, 4000022, "石块 - 石头人"),
	Array(100040103, 5000, 4000006, "章鱼腿 - 章鱼"),
	Array(100040000, 5000, 4000001, "花蘑菇盖 - 花蘑菇"),
	// ===== 维多利亚 - 勇士部落 =====
	Array(106000100, 5000, 4000024, "火野猪尖牙 - 火野猪"),
	Array(106000130, 8000, 4000014, "龙的头骨 - 赤龙"),
	// ===== 维多利亚 - 废弃都市 =====
	Array(103000101, 5000, 4000037, "蓝水灵大水珠 - 蓝水灵"),
	Array(103000105, 5000, 4000031, "诅咒娃娃 - 僵尸蘑菇"),
	// ===== 维多利亚 - 林中之城 =====
	Array(105040200, 8000, 4000015, "刺蘑菇盖 - 刺蘑菇"),
	Array(105040306, 8000, 4000025, "黑石块 - 黑石头人"),
	Array(105090300, 8000, 4000030, "龙皮 - 赤龙"),
	// ===== 天空之城 =====
	Array(200010100, 5000, 4000106, "幼独角狮尾 - 幼独角狮"),
	Array(200010100, 5000, 4000108, "幼红独角狮尾 - 幼红独角狮"),
	// ===== 玩具城/时间之路 =====
	Array(220010500, 8000, 4000063, "时钟碎片 - 泰迪熊"),
	Array(220040000, 8000, 4000038, "时间碎片 - 克罗诺斯"),
	Array(220070200, 8000, 4000053, "狼人指甲 - 狼人"),
	Array(220070300, 8000, 4000054, "里狼人指甲 - 里狼人"),
	Array(220060200, 8000, 4000061, "光明精灵碎片 - 光明精灵"),
	Array(220060300, 8000, 4000062, "黑暗精灵碎片 - 黑暗精灵"),
	// ===== 冰峰雪域 =====
	Array(211040300, 8000, 4000049, "雪人之角 - 雪人"),
	Array(211040400, 8000, 4000047, "小白雪人之皮 - 小白雪人"),
	Array(211041600, 8000, 4000039, "铁牙猪铁蹄 - 铁牙猪"),
	Array(211041600, 8000, 4000048, "黑企鹅王冠 - 黑企鹅王"),
	// ===== 水下世界 =====
	Array(230040100, 8000, 4000074, "河豚毒刺 - 河豚"),
	Array(230040300, 8000, 4000075, "夜水灵三角头巾 - 夜水灵"),
	Array(230040400, 8000, 4000076, "飞鱼翅膀 - 飞鱼"),
	// ===== 神木村 =====
	Array(240010500, 8000, 4000058, "种族种子 - 种族"),
	Array(240030102, 10000, 4000084, "冰石球碎片 - 冰石球"),
	Array(240040511, 10000, 4000085, "火焰石球碎片 - 火焰石球"),
	Array(240020500, 10000, 4000065, "狸猫柴火 - 狸猫"),
	Array(240020400, 10000, 4000066, "云狐尾巴 - 云狐"),
	// ===== 时间神殿 =====
	Array(270030400, 10000, 4000088, "小鱼儿 - 小布布"),
	Array(270050400, 10000, 4000090, "C级勋章 - 忘却的守护兵"),
	// ===== 武陵/百草堂 =====
	Array(250010304, 8000, 4000055, "流浪熊毛发 - 流浪熊"),
	Array(250010300, 8000, 4000101, "黄色积木 - 功夫熊猫"),
	Array(251010402, 8000, 4000098, "粘稠蜘蛛网 - 蜘蛛"),
	// ===== 少林寺 =====
	Array(702070400, 10000, 4000093, "首领B的符咒 - 首领B"),
	Array(702060000, 10000, 4000094, "住持的香油 - 住持"),
	// ===== 新叶城/玛加提亚 =====
	Array(600020300, 8000, 4000104, "马达 - 狼蛛"),
	Array(261020400, 8000, 4000080, "外星人项圈 - 外星人"),
	Array(261020400, 8000, 4000081, "火焰炸弹人火焰 - 火焰炸弹人"),
	// ===== 新加坡/马来/幽灵船 =====
	Array(541010010, 8000, 4000056, "蓝企鹅羽毛 - 蓝企鹅"),
	Array(541010050, 8000, 4000057, "黑企鹅羽毛 - 黑企鹅"),
	Array(551030100, 10000, 4000097, "蜘蛛网 - 万圣猫"),
	// ===== 特殊区域 =====
	Array(251010000, 10000, 4000109, "玩具特洛伊剑 - 功夫熊猫"),
	Array(221000000, 8000, 4000082, "僵尸金牙 - 外星僵尸"),
	Array(930000010, 10000, 4000114, "台钟 - 毒雾森林怪物")
);

//------------------------------------------------------------------------


var status;

//Start
function start()
{
	levelStart();
}

/**
 * @description 如果是sendSelectLevel，那么会根据的选项自动路由到对应的level+selection方法
 */
function levelStart() {
    let text = "尊贵的冒险家，您想去哪里呢？\r\n";
	text += "#L2#城镇地图#l \t #L1#练级地图#l \t #L0#BOSS地图#l\r\n";
	text += "#L5#精英BOSS#l \t #L3#跳跳地图#l \t #L4#材料传送#l";
    cm.sendSelectLevel(text);
}

function level0() {
	let text = "#b";
    for (let i = 0; i < bossmaps.length; i++) {
       text += "#L" + i + "#" + bossmaps[i][2] + "#l\r\n";
    }
	cm.sendNextSelectLevel("Boss", text);
}

function level1() {
	let text = "#b";
	for (let i = 0; i < monstermaps.length; i++) {
		let playerCount = cm.getPlayerCount(monstermaps[i][0]);
		let status = playerCount > 0 ? "#r【" + playerCount + "人】#k" : "#b【无人】#k";
		text += "#L" + i + "#" + monstermaps[i][2] + "  " + status + "#l\r\n";
	}
	cm.sendNextSelectLevel("LevelUp", text);
}
function level2() {
	let text = "#b";
    for (let i = 0; i < townmaps.length; i++) {
       text += "#L" + i + "#" + townmaps[i][2] + "#l\r\n";
    }
	cm.sendNextSelectLevel("Town", text);
}

function level3() {
	let text = "#r注意：活动地图还有bug，请谨慎前往！#k\r\n#b";
    for (let i = 0; i < fubenmaps.length; i++) {
       text += "#L" + i + "#" + fubenmaps[i][2] + "#l\r\n";
    }
	cm.sendNextSelectLevel("Fuben", text);
}

function level4() {
	let text = "#b";
	for (let i = 0; i < materialmaps.length; i++) {
		text += "#L" + i + "##b" + materialmaps[i][3] + "#k #i" + materialmaps[i][2] + "# #r（消耗" + (materialmaps[i][1]) + "金币）#b#l\r\n";
	}
	cm.sendNextSelectLevel("Material", text);
}

function level5() {
	let text = "#b";
	for (let i = 0; i < elitebossmaps.length; i++) {
		let alive = cm.countAllMonstersOnMap(elitebossmaps[i][0]) > 0;
		let status = alive ? "#g【存活】#k" : "#r【死亡】#k";
		text += "#L" + i + "#" + elitebossmaps[i][2] + "  " + status + "#l\r\n";
	}
	cm.sendNextSelectLevel("Elite", text);
}

//----------------------------------------------------------------------------------
function levelBoss(selection) {
	cm.gainMeso(-bossmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(bossmaps[selection][0]);
	cm.dispose();
}

function levelLevelUp(selection) {
	cm.gainMeso(-monstermaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(monstermaps[selection][0]);
	cm.dispose();
}

function levelTown(selection) {
	cm.gainMeso(-townmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(townmaps[selection][0]);
	cm.dispose();
}

function levelFuben(selection) {
	cm.gainMeso(-fubenmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(fubenmaps[selection][0]);
	cm.dispose();
}

function levelMaterial(selection) {
	cm.gainMeso(-materialmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(materialmaps[selection][0]);
	cm.dispose();
}

function levelElite(selection) {
	cm.gainMeso(-elitebossmaps[selection][1]);
	cm.getPlayer().saveLocationOnWarp();
	cm.warp(elitebossmaps[selection][0]);
	cm.dispose();
}
//----------------------------------------------------------------------------------