importPackage(Packages.client);
importPackage(Packages.client.inventory);
status = -1;

var 高级抽奖币 = 4000487;
var itemList = Array(
Array(1302107,1, 1, 1), //至尊黄金
Array(1332237,1, 1, 1), //至尊黄金
Array(1382144,1, 1, 1), //至尊黄金
Array(1402130,1, 1, 1), //至尊黄金
Array(1422090,1, 1, 1), //至尊黄金
Array(1432118,1, 1, 1), //至尊黄金
Array(1452148,1, 1, 1), //至尊黄金
Array(1462138,1, 1, 1), //至尊黄金
Array(1472160,1, 1, 1), //至尊黄金
Array(1482121,1, 1, 1), //至尊黄金
Array(1492121,1, 1, 1), //至尊黄金
Array(1332279,1, 1, 1), //神秘之影
Array(1382265,1, 1, 1), //神秘之影
Array(1402259,1, 1, 1), //神秘之影
Array(1422189,1, 1, 1), //神秘之影
Array(1432218,1, 1, 1), //神秘之影
Array(1442274,1, 1, 1), //神秘之影
Array(1452257,1, 1, 1), //神秘之影
Array(1462243,1, 1, 1), //神秘之影
Array(1472265,1, 1, 1), //神秘之影
Array(1482221,1, 1, 1), //神秘之影
Array(1492235,1, 1, 1), //神秘之影
Array(1312203,1, 1, 1), //神秘之影
Array(1322255,1, 1, 1), //神秘之影
Array(1372228,1, 1, 1), //神秘之影
Array(1412181,1, 1, 1), //神秘之影
			Array(1432182,180, 1, 1), //红色枪
			//Array(1442088,1, 1, 1), //紫色矛
			//Array(1442029,1, 1, 1), //紫色矛
			Array(1382226,180, 1, 1), //红色长杖  
			Array(1452220,180, 1, 1), //红色弓                           
			Array(1462208,180, 1, 1), //红色之弩
			Array(1332242,180, 1, 1), //红色切割者
			Array(1472230,180, 1, 1), //红色拳套 
			Array(1482183,180, 1, 1), //红色拳甲  
			Array(1492194,180, 1, 1), //红色短枪   
			Array(1402196,280, 1, 1),//160
			Array(1412135,280, 1, 1),//160
			Array(1432167,280, 1, 1),//160
			Array(1442223,280, 1, 1),//160
			Array(1452205,280, 1, 1),//160
			Array(1462193,280, 1, 1),//160
			Array(1472214,280, 1, 1),//160
			Array(1482168,280, 1, 1),//160
			Array(1492179,280, 1, 1),//160
// 毕业戒指
Array(1112586,10, 1, 1),//黑天使祝福
Array(1112663,10, 1, 1),//白天使祝福
Array(1112584,100, 1, 1),//旭日戒指
Array(1112952,5, 1, 1),//什么愤怒 WATK
Array(1112951,15, 1, 1),//什么愤怒 MATK


			Array(1032137,30, 1, 1),//寻宝套
			Array(1132287,10, 1, 1),//寻宝套
			Array(1122306,10, 1, 1),//寻宝套
			Array(1004492,250, 1, 1),//寻宝套
			Array(1102828,250, 1, 1),//寻宝套
			Array(1082647,250, 1, 1),//寻宝套
			Array(1073057,250, 1, 1),//寻宝套
			Array(1003242,200, 1, 1),//宝石帽子
			
Array(1052357,250, 1, 1),//宝石外套
Array(1082314,150, 1, 1),//宝石手套
Array(1132092,30, 1, 1),//宝石腰带
Array(1102294,250, 1, 1),//宝石披风
Array(1072521,100, 1, 1),//宝石鞋子
Array(1003243,60, 1, 1),//铂金帽子
Array(1052358,250, 1, 1),//铂金外套
Array(1082315,130, 1, 1),//铂金手套
Array(1132093,180, 1, 1),//铂金腰带
Array(1102295,130, 1, 1),//铂金披风
Array(1072522,250, 1, 1),//铂金鞋子
Array(1122174,300, 1, 1),//运动吊坠
Array(1032121,130, 1, 1),//运动耳环
Array(1042231,20, 1, 1),//运动上衣
Array(1082401,120, 1, 1),//运动手套
Array(1062148,180, 1, 1),//运动短裤
Array(1072929,120, 1, 1),//运动鞋子
Array(1003552,60, 1, 1),//紫金帽子
Array(1052461,100, 1, 1),//紫金外套
Array(1102441,90, 1, 1),//紫金披风
Array(1082433,130, 1, 1),//紫金手套
Array(1132154,180, 1, 1),//紫金腰带
Array(1072666,180, 1, 1),//紫金鞋子
Array(1003946,30, 1, 1),//革命帽子
Array(1052647,180, 1, 1),//革命外套
Array(1102612,180, 1, 1),//革命披风
Array(1082540,130, 1, 1),//革命手套
Array(1132242,80, 1, 1),//革命腰带
Array(1072853,150, 1, 1),//革命鞋子
Array(1003561,20, 1, 1),//风暴帽子
Array(1052467,150, 1, 1),//风暴外套
Array(1102467,150, 1, 1),//风暴披风
Array(1082438,150, 1, 1),//风暴手套
Array(1132161,130, 1, 1),//风暴腰带
Array(1072672,100, 1, 1),//风暴鞋子
Array(1003740,20, 1, 1),//终极帽子
Array(1052569,180, 1, 1),//终极外套
Array(1102506,100, 1, 1),//终极披风
Array(1082498,100, 1, 1),//终极手套
Array(1132209,100, 1, 1),//终极腰带
Array(1072768,130, 1, 1),//终极鞋子

Array(1003540,50, 1, 1),//外星人帽子
Array(1052460,130, 1, 1),//外星人外套
Array(1032142,5, 1, 1),//外星人耳环
Array(1072664,130, 1, 1),//外星人鞋子
Array(1082432,130, 1, 1),//外星人手套
Array(1132152,5, 1, 1),//外星人腰带
Array(1112738,130, 1, 1),//外星人戒指
Array(1122197,1, 1, 1),//外星人吊坠
			Array(1402037,120, 1, 1), //龙背刀
			Array(1402014,250, 1, 1), //温度计   
			Array(1402013,250, 1, 1), //白日剑
			Array(1322051,250, 1, 1), //七夕
			Array(1332021,250, 1, 1), //乌龙茶
			Array(1302019,250, 1, 1), //无名剑
			Array(1002524,150, 1, 1), //可乐帽
			Array(1002554,150, 1, 1), //武艺头绳
			Array(1002441,150, 1, 1), //热血头带
			Array(1072275,150, 1, 1), //拖鞋
			Array(1432010,150, 1, 1), //奥丁
			Array(1432009,150, 1, 1), //奥丁
			Array(1402094,150, 1, 1), //奥丁
			Array(2000005,250, 30, 1), //超级
			Array(2050004,250, 50, 1), //万能
			
			Array(1102041,100, 1, 1), //粉浪 
		    Array(1102042,100, 1, 1), //紫浪 
		    Array(1102163,100, 1, 1), //贵族披风
		    Array(1102207,100, 1, 1), //金魂
		    Array(1102206,100, 1, 1),//黑色野兽
	
			
			// 过度戒指
			Array(1112402,100,1,1),
			Array(1112405,100,1,1),
			Array(1112421,200,1,1),
			Array(1112422,200,1,1),
			Array(1112423,200,1,1),
			Array(1112424,300,1,1),
			Array(1112425,300,1,1),
			Array(1112426,300,1,1),
			Array(1112427,400,1,1),
			Array(1112428,400,1,1),
			Array(1112429,400,1,1),
			Array(4000463,50, 1, 1),  //货币
			Array(4001028,50, 1, 1),  //血书
			//Array(4031217,100, 1, 1),  //黄金钥匙
			Array(1402047,160, 1, 1),//重生玄冥剑
			Array(1432049,160, 1, 1), //重生显圣枪
			Array(1442067,160, 1, 1), //重生神光戟
			Array(1452059,160, 1, 1), //重生惊电弓
			Array(1462051,160, 1, 1), //重生冥雷弩
			Array(1472071,160, 1, 1), //重生大悲赋
			Array(1482024,160, 1, 1), //重生孔雀翎
			Array(1492025,160, 1, 1), //重生凤凰铳
			Array(1302086,160, 1, 1), //重生破甲剑
			Array(1332075,160, 1, 1), //重生狂鲨锯
			Array(1332076,160, 1, 1), //重生断首刃
			Array(1382059,160,1, 1), //重生蝶翼杖
			Array(2040025,110,1,1), //头盔智力卷轴
			// 必成卷
			Array(2290096,100,1,1),//勇士20
			Array(2290125,100,1,1),//勇士30
			Array(2043003,200, 1, 1), //单手剑攻击卷轴(必成)
			Array(2044003,200, 1, 1), //双手剑攻击卷轴(必成)
			Array(2044303,200, 1, 1), //枪攻击攻击卷轴(必成)
			Array(2044403,200, 1, 1), //矛攻击攻击卷轴(必成)
			Array(2044503,200, 1, 1), //弓攻击攻击卷轴(必成)
			Array(2044603,200, 1, 1), //弩攻击必成卷
			Array(2043703,200, 1, 1), //短杖攻击必成卷
			Array(2043803,200, 1, 1), //长杖攻击诅轴(必成)
			Array(2043303,200, 1, 1), //短剑攻击必成卷
			Array(2044703,200, 1, 1), //拳套攻击诅轴(必成)
			Array(2044908,200, 1, 1), //短枪攻击卷轴(必成)
			Array(2044815,200, 1, 1), //指节攻击必成卷
			Array(2040807,200, 1, 1), //手套攻击卷轴(必成)
			Array(2040029,210,1,1), //头盔敏捷卷轴
			Array(2040301,210,1,1), //耳环智力卷轴
			Array(2040317,210,1,1), //耳环敏捷卷轴
			Array(2040513,210,1,1), //全身铠甲智力卷轴
			Array(2040532,210,1,1), //全身盔甲力量卷轴
			Array(2070005,200,1,1), //金钱镖
			Array(1082149,100,1,1), //工地手套(褐)
			
			//飞镖
			Array(2070019,110, 1, 1),  //盘子标
			Array(2070024,120, 1, 1),  //无限飞镖
			Array(2070023,130, 1, 1),  //火焰飞镖
			Array(2070026,140, 1, 1),  //白金飞镖
			Array(2070011,150, 1, 1),  //枫叶标
			Array(2070020,180, 1, 1),  //鞭炮
			
			Array(1092022,220,1,1), //调色板盾牌
			Array(2210039,220,1,1), //企鹅变身药
			//Array(2210034,200,1,1) //外星人变身
			//Array(2360000,200,1,1) //幽灵
			Array(2210031,200,1,1), //匹曹诺变身
	
			Array(2340000,200,1,1) //祝福卷轴
			);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			var 装备栏空位 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getNumFreeSlot();
			var 消耗栏空位 = cm.getChar().getInventory(MapleInventoryType.USE).getNumFreeSlot();
			var 设置栏空位 = cm.getChar().getInventory(MapleInventoryType.SETUP).getNumFreeSlot();
			var 其他栏空位 = cm.getChar().getInventory(MapleInventoryType.ETC).getNumFreeSlot();
			var 现金栏空位 = cm.getChar().getInventory(MapleInventoryType.CASH).getNumFreeSlot();
		if (装备栏空位 <= 1) {
			cm.sendOk("防止领取失败判断:\r\n#b装备栏至少需要#k#r2个格子#k");
			cm.dispose();
		}else if (消耗栏空位 <= 1) {
			cm.sendOk("防止领取失败判断:\r\n#b消耗栏至少需要#k#r2个格子#k");
			cm.dispose();
		}else if (设置栏空位 <= 1) {
			cm.sendOk("防止领取失败判断:\r\n#b设置栏至少需要#k#r2个格子#k");
			cm.dispose();
		}else if (其他栏空位 <= 1) {
			cm.sendOk("防止领取失败判断:\r\n#b其他栏至少需要#k#r2个格子#k");
			cm.dispose();
		}else if (现金栏空位 <= 1) {
			cm.sendOk("防止领取失败判断:\r\n#b现金栏至少需要#k#r2个格子#k");
			cm.dispose();
		}else if (cm.getzb() >= 10) {
			var str1 = "\r\n";	
            for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗元宝*1抽取以下物品!\r\n#k当元宝余额:" + cm.getzb()+ "\r\n" + str1);
			} else {
				var str1 = "\r\n";	
				for (var i = 0; i < itemList.length; i++){
					str1 += "#v"+itemList[i][0]+"#";
			}
				cm.sendOk("消耗元宝*1抽取以下物品!\r\n#k元宝余额:" + cm.getzb()+ "\r\n" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
			cm.setzb(-1);
			var pdd = "";
			pdd += 抽奖();
			cm.sendOk(pdd);
		}
}

function 抽奖(){
	var pdd = "";
	var chance = Math.floor(Math.random() * 500);
			var finalitem = Array();
			for (var i = 0; i < itemList.length; i++) {
				if (itemList[i][1] >= chance) {
					finalitem.push(itemList[i]);
				}
			}
			if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			pdd += "恭喜您获得了 #b#v" + itemId + "##k " + quantity + "个\r\n";
            item = cm.gainGachaponItem(itemId, quantity, "元宝抽奖", notice);
            if (item != -1) {
				if (itemId==1442029){
					cm.gainItem(1442029,-1); //优秀玩家勋章
				    cm.gainItem(1442029,0,0,0,0,0,0,175,0,0,0,0,0,0,0); //优秀玩家勋章
				}
                //cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
				cm.safeDispose();
			}else {
				// 没抽到重新抽一次
				pdd += 抽奖();
				//return pdd;
				cm.safeDispose();
			}
	return pdd;
}
