
var 星星 = "#fEffect/CharacterEff/1112903/0/0#";
var 爱心 = "#fEffect/CharacterEff/1032063/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 正方形 = "#fUI/UIWindow/Quest/icon3/6#";
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var ttt ="#fUI/UIWindow.img/Quest/icon9/0#";
var xxx ="#fUI/UIWindow.img/Quest/icon8/0#";
var sss ="#fUI/UIWindow.img/QuestIcon/3/0#";
var 表情 = "#fUI/GuildBBS.img/GuildBBS/Emoticon/Basic/0#";
var 表情1 = "#fUI/GuildBBS.img/GuildBBS/Emoticon/Basic/1#";
var 表情2 = "#fUI/GuildBBS.img/GuildBBS/Emoticon/Basic/2#";
var 蓝色小兔子 = "#fEffect/CharacterEff.img/1112960/3/1#";
var 小红星 = "#fEffect/CharacterEff.img/1112926/0/0#";
var 小蓝星 = "#fEffect/CharacterEff.img/1112925/0/0#";
var 音符3 = "#fEffect/CharacterEff.img/1112949/2/0#";
var 蓝色时钟 = "#fUI/UIWindow.img/Quest/TimeQuest/AlarmClock/default/0/0#"; 
var 红色时钟 = "#fUI/UIWindow.img/Quest/TimeQuest/AlarmClock/default/4/0#"; 
var 任务简介 = "#fUI/UIWindow.img/Quest/summary#"; 
var 任务提示 = "#fUI/UIWindow.img/Quest/BtAlert/mouseOver/0#"; 
var 成功了 = "#fEffect/BasicEff.img/Fishing/6#"; 
var 橙条 = "#fUI/UIWindow.img/Minigame/Common/barTeamA#"; 
var 蘑菇 = "#fUI/UIWindow.img/Minigame/Common/mark#";

///////////////////////////////////////////
var vipLevel = 0;
var itemList = new Array();//玩家背包
var item分解池 = new Array(2040817, 2041201, 2041202, 2040516,2040504,2040501,2041204, 2040513,2041205, 2040502,2044501,20412016, 2040001, 2040001, 2040002, 2040002, 2040004, 2040004, 2040005, 2040005, 2040012, 2040013, 2040016, 2040016, 2040017, 2040017, 2040019, 2040020, 2040020, 2040021, 2040022, 2040022, 2040025, 2040025, 2040026, 2040026, 2040028, 2040029, 2040029, 2040030, 2040031, 2040031, 2040100, 2040101, 2040101, 2040105, 2040105, 2040106, 2040106, 2040200, 2040200, 2040201, 2040201, 2040205, 2040205, 2040206, 2040206, 2040301, 2040301, 2040302, 2040302, 2040306, 2040307, 2040310, 2040310, 2040311, 2040311, 2040313, 2040314, 2040314, 2040316, 2040317, 2040317, 2040318, 2040318, 2040319, 2040320, 2040321, 2040321, 2040322, 2040323, 2040323, 2040324, 2040325, 2040326, 2040326, 2040327, 2040328, 2040328, 2040401, 2040401, 2040402, 2040402, 2040406, 2040407, 2040408, 2040409, 2040412, 2040412, 2040413, 2040413, 2040415, 2040416, 2040416, 2040417, 2040418, 2040418, 2040419, 2040419, 2040420, 2040421, 2040421, 2040422, 2040422, 2040423, 2040424, 2040425, 2040425, 2040426, 2040427, 2040427, 2040525, 2040525, 2040526, 2040527, 2040527, 2040528, 2040529, 2040529, 2040530, 2040531, 2040532, 2040532, 2040533, 2040534, 2040534, 2040601, 2040601, 2040602, 2040602, 2040612, 2040612, 2040613, 2040613, 2040615, 2040616, 2040616, 2040617, 2040618, 2040618, 2040619, 2040619, 2040620, 2040621, 2040621, 2040622, 2040622, 2040623, 2040624, 2040625, 2040625, 2040626, 2040627, 2040627, 2040701, 2040701, 2040702, 2040702,  2040704, 2040704, 2040705, 2040705, 2040706, 2040707, 2040707, 2040708, 2040708, 2040718, 2040719, 2040719, 2040720, 2040721, 2040721, 2040722, 2040723, 2040723, 2040727, 2040727, 2040801, 2040801, 2040802, 2040802, 2040803, 2040804, 2040804, 2040805, 2040805, 2040812, 2040813, 2040816, 2040816, 2040817, 2040817, 2040819, 2040820, 2040820, 2040821, 2040822, 2040822, 2040823, 2040824, 2040824, 2040825, 2040825, 2040901, 2040901, 2040902, 2040902, 2040906, 2040907, 2040908, 2040909, 2040910, 2040911, 2040911, 2040914, 2040914, 2040915, 2040915, 2040919, 2040919, 2040920, 2040920, 2040923, 2040924, 2040924, 2040925, 2040925, 2040926, 2040927, 2040927, 2040928, 2040928, 2040929, 2040930, 2040931, 2040931, 2040932, 2040933, 2040933, 2041001, 2041001, 2041002, 2041002, 2041004, 2041004, 2041005, 2041005, 2041006, 2041007, 2041007, 2041008, 2041008, 2041009, 2041010, 2041010, 2041011, 2041011, 2041012, 2041013, 2041013, 2041014, 2041014, 2041015, 2041016, 2041016, 2041017, 2041017, 2041018, 2041019, 2041019, 2041020, 2041020, 2041021, 2041022, 2041022, 2041023, 2041023, 2041042, 2041043, 2041043, 2041044, 2041045, 2041045, 2041046, 2041047, 2041047, 2041048, 2041049, 2041049, 2041050, 2041051, 2041051, 2041052, 2041053, 2041053, 2041054, 2041055, 2041055, 2041056, 2041057, 2041057, 2041058, 2041058, 2041201, 2041201, 2041202, 2041202, 2041206, 2041206, 2041207, 2041207, 2041211, 2041211, 2041212, 2041212, 2041301, 2041301, 2041304, 2041304, 2041307, 2041307, 2041310, 2041310,  2043001, 2043001, 2043002, 2043002, 2043008, 2043008, 2043009, 2043009, 2043011, 2043012, 2043012, 2043015, 2043016, 2043017, 2043017, 2043018, 2043019, 2043019, 2043101, 2043101, 2043102, 2043102, 2043106, 2043107, 2043107, 2043110, 2043111, 2043112, 2043112, 2043113, 2043114, 2043114, 2043201, 2043201, 2043202, 2043202, 2043206, 2043207, 2043207, 2043210, 2043211, 2043212, 2043212, 2043213, 2043214, 2043214,  2043301, 2043301, 2043302, 2043302, 2043306, 2043307, 2043307, 2043701, 2043701, 2043702, 2043702, 2043706, 2043707, 2043707, 2043801, 2043801, 2043802, 2043802, 2043806, 2043807, 2043807, 2044001, 2044001, 2044002, 2044002, 2044006, 2044007, 2044007, 2044010, 2044011, 2044012, 2044012, 2044013, 2044014, 2044014, 2044101, 2044101, 2044102, 2044102, 2044106, 2044107, 2044107, 2044110, 2044111, 2044112, 2044112, 2044113, 2044114, 2044114, 2044201, 2044201, 2044202, 2044202, 2044206, 2044207, 2044207, 2044210, 2044211, 2044212, 2044212, 2044213, 2044214, 2044214, 2044301, 2044301, 2044302, 2044302, 2044306, 2044307, 2044307, 2044310, 2044311, 2044312, 2044312, 2044313, 2044314, 2044314, 2044401, 2044401, 2044402, 2044402, 2044406, 2044407, 2044407, 2044410, 2044411, 2044412, 2044412, 2044413, 2044414, 2044414, 2044506, 2044507, 2044507, 2044601, 2044601, 2044602, 2044602, 2044606, 2044607, 2044607, 2044701, 2044701, 2044702, 2044702, 2044706, 2044707, 2044707, 2044801, 2044801, 2044802, 2044802, 2044803, 2044804, 2044805, 2044806, 2044807, 2044807, 2044808, 2044809, 2044811, 2044901, 2044901, 2044902, 2044902, 2044903, 2044904, 2044906);
var 需要分解Array = new Array();
var 分解物品Array = new java.util.ArrayList();
var 分解物品数量Array = new java.util.ArrayList();
var 分解次数 = 0;

var 枫叶 = 4001126;
var 金枫叶 = 4000313;
var 低金杯 = 4310098;
var 金杯 = 4000038;
var 中国心 = 4000464;
var 彩蛋 = 4170016;//彩蛋
var 时装蛋 = 4170007;//彩蛋
function start() {
    status = -1;
    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
		if(status == 0){
			var pdd = "";
			pdd += "\t\t\t\t#b[卷轴分解机]#k\r\n";
			pdd += "此机器只会分解10%卷轴和60%卷轴\r\n";
			pdd += "#r请将需要的卷轴摆摊#k,小心重要的卷轴手抖被分解\r\n";
			pdd += "分解卷轴有几率获得以下物品:\r\n";
			pdd += "商城点卷#r100点[25%]#k ";
			pdd += "10万金币#r[25%]#k\r\n";
		
			pdd += "#v"+枫叶+"#*100#r[15%]#k #v"+金枫叶+"#*10#r[15%]#k #v"+金杯+"##r[5%]#k\r\n";
			pdd += "#v"+中国心+"##r[5%]#k #v"+时装蛋+"##r[5%]#k #v"+彩蛋+"##r[5%]#k\r\n\r\n";
		
			pdd += "\t\t\t\t#d是否确认进行分解#k";
			cm.sendYesNo(pdd);
			
		}
        else if (status == 1) {
            var text = "";
			text += ""+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+蘑菇+"\r\n\r\n";
			text += "尊敬的#r"+cm.getPlayer().getName()+"#k,您好!\r\n";
			itemList = cm.getInventory(2).list().iterator();
			var indexof = 1;
			var text = "";
			text += "本次分解列表:\r\n";
				while (itemList.hasNext()) {
					var item = itemList.next();
					//text += "#v" + item.getItemId() + "##z"+item.getItemId()+"# x #c"+ item.getItemId() +"#\r\n";
					if(item分解池.indexOf(item.getItemId()) > -1) {//存在该卷轴
						text += "#v" + item.getItemId() + "##z"+item.getItemId()+"# x #c"+ item.getItemId() +"#\r\n";
						分解次数 +=item.getQuantity();
						分解物品Array.add(item.getItemId());//添加物品id
						分解物品数量Array.add(item.getQuantity());
					}
					indexof++;
				}
			text += "总共分解#b:"+分解次数+"#k次\r\n";
			text += "#L0##d是否进行分解#k???";
			cm.sendSimple(text);
        } else if (status == 2){
        // 第一部分代码
		//var 其他栏空位 = cm.getChar().getInventory(MapleInventoryType.ETC).getNumFreeSlot();
			if(selection == 0){
				if(cm.getMeso() < (分解次数*10000)){
					cm.sendOk("金币不够");
					cm.dispose();
				}else if(分解次数 < 1){
					cm.sendOk("分解次数不能是#r0#k次");
					cm.dispose();
				
				}else{
					//cm.sendOk("分解物品有"+分解物品Array.size()+"种");
					for(var j = 0; j < 分解物品Array.size();j++){
						cm.gainItem(分解物品Array.get(j),-(分解物品数量Array.get(j)));
						cm.dispose();
					}
					//cm.sendOk(分解次数);
					for(var i = 0;i <= 分解次数;i++){
						var chance = Math.ceil(Math.random()* 100);
					if(chance > 0 && chance <=25){
						cm.gainNX(100);//给点劵
						cm.dispose();
					//}else if(chance > 25 && chance <=35){
					//	cm.gainDY(100);//给抵用
				//		cm.dispose();
					}else if(chance > 25 && chance <=55){
						cm.gainMeso(100000);
						cm.dispose();
				//	}else if(chance > 45 && chance <=60){
				//		cm.getChar().gainSG(100);//给杀怪
				//		cm.dispose();
					}else if(chance > 55 && chance <=75){
						cm.gainItem(枫叶,100);
						cm.dispose();
					}else if(chance > 75 && chance <=90){
						cm.gainItem(金枫叶,10);
						cm.dispose();
					}else if(chance > 90 && chance <=93){
						cm.gainItem(金杯,1);
						cm.dispose();
					}else if(chance > 93 && chance <=95){
						cm.gainItem(中国心,1);
						cm.dispose();
					}else if(chance > 95 && chance <=97){
						cm.gainItem(时装蛋,1);
						cm.dispose();
					}else if(chance > 97 && chance <=100){
						cm.gainItem(彩蛋,2);
						cm.dispose();
					}
					}
					//cm.sendOk("分解成功");
					cm.喇叭(4, "[" + cm.getPlayer().getName() + "]在冒险岛某地使用卷轴分解机,获得丰厚奖励！本次一共分解"+分解次数+"次");
					cm.dispose();
				}
			} 
        // ------------------------------beauty部分-------------------------------------- //
        } else if (status == 2){       
        // 第二部分代码
        }
    }
}


