



// 其他
const _枫叶_ = 4001126;














const _青铜母矿_ = 4010000;
const _钢铁母矿_ = 4010001;
const _锂矿石母矿_ = 4010002;
const _朱矿石母矿_ = 4010003;
const _银母矿_ = 4010004;
const _紫矿石母矿_ = 4010005;
const _黄金母矿_ = 4010006;
const _锂母矿_ = 4010007;

const _石榴石母矿_ = 4020000;
const _紫水晶母矿_ = 4020001;
const _海蓝石母矿_ = 4020002;
const _祖母绿母矿_ = 4020003;
const _蛋白石母矿_ = 4020004;
const _蓝宝石母矿_ = 4020005;
const _黄晶母矿_ = 4020006;
const _钻石母矿_ = 4020007;
const _黑水晶母矿_ = 4020008;


const _力量母矿_ = 4004000;
const _智慧母矿_ = 4004001;
const _敏捷母矿_ = 4004002;
const _幸运母矿_ = 4004003;
const _黑暗水晶母矿_ = 4004004;


const _星石_ = 4021009;
const _月石_ = 4011007;


const _力量水晶_ = 4005000;
const _智慧水晶_ = 4005001;
const _敏捷水晶_ = 4005002;
const _幸运水晶_ = 4005003;
const _黑暗水晶_ = 4005004;
