

/*
	作者：狗哥
	QQ联系：1418181168
	制作时间：2022年/6月/27日
*/

//var 美化new = "#fEffect/UIWindow/Quest/icon5/1#";

var 功能名称 = "收集系统中心";

var 阅读 = 10;

var 收集列表 = [
	{
		类型: "首领", 选择: 2147000000, 间隔: 1,
		收集控制: [
			{ 物品: 4000124, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2210006, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032807, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032808, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031991, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4000040, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4033029, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032806, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032966, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031793, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031553, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031788, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4180766, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032931, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032474, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032810, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4032805, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4001261, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031457, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4033793, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4000462, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4000460, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4000461, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4033792, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031227, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4001111, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4000175, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4001084, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4001083, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
		]
	},
	{
		类型: "野外", 选择: 2147000001, 间隔: 1,
		收集控制: [
			{ 物品: 1312010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1312009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1322019, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1322028, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1322020, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1322018, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332017, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1402012, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1402004, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1402011, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1412003, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1412007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1412009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1422009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1422005, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1422012, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432004, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432006, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1442010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1442005, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1442008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1442019, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372014, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372016, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372038, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372015, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382006, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452004, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452011, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452015, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462006, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462011, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462013, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472021, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472019, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472025, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472026, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472029, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472027, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472031, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332011, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332015, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332003, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332018, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332019, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332022, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332023, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492010, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
		]
	},
	{
		类型: "鱼类", 选择: 2147000002, 间隔: 3,
		收集控制: [
			{ 物品: 4031627, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031633, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031634, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031635, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031636, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031630, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031637, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031638, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031639, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031640, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031628, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031641, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031642, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031643, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031644, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031631, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031645, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031646, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031647, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4031648, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322999, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322998, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322997, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322996, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322995, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322984, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322983, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322982, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322981, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322980, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322969, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322968, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322967, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322966, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322965, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322964, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322963, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322962, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322961, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322960, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322959, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322958, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322957, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322956, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322955, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322994, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322993, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322992, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322991, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322990, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322979, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322978, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322977, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322976, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322975, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322974, 数量: 100, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322973, 数量: 50, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322972, 数量: 30, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322971, 数量: 20, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322970, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322954, 数量: 10, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322953, 数量: 7, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4322952, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },

		]
	},
	{
		类型: "矿石", 选择: 2147000003, 间隔: 2,
		收集控制: [
			{ 物品: 4250002, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250102, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250202, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250302, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250402, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250502, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250602, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250702, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4251302, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250802, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4250902, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4251002, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4251102, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 4251402, 数量: 1, Ap点: 3, 抵用: 0, 点卷: 1000, 血蓝: 10 },
		]
	},
	{
		类型: "卷轴", 选择: 2147000004, 间隔: 1,
		收集控制: [
			{ 物品: 2041023, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2041020, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2041017, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2041014, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040705, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040702, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040534, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040517, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040514, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040502, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040427, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040419, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040627, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040323, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040318, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040302, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040205, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040026, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040031, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040802, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040816, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040805, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040915, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2040920, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043002, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043102, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043202, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044002, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044102, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044202, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044302, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044402, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043702, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043802, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044502, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044602, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2043302, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044702, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044802, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 2044902, 数量: 5, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
		]
	},
	{
		类型: "百宝", 选择: 2147000005, 间隔: 1,
		收集控制: [
			{ 物品: 1012011, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012012, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012013, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012014, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012015, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012016, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012017, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012018, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012019, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1012020, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113194, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113193, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113192, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113191, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113190, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1113189, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1132005, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1132006, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1132007, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1132008, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1132009, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1122024, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1122025, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1122026, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1122027, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1122028, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452220, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462208, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472230, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482183, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492194, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432182, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1422156, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1402214, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332242, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382226, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492194, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372035, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372036, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372037, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372038, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1492030, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1482029, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1472077, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1462056, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1452062, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1442071, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1432050, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1422039, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1412035, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1402053, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1382062, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1372046, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1332081, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1322065, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1312039, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1302105, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032025, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032032, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032035, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032034, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032055, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032056, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032057, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1032058, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082145, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082146, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082147, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082148, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082149, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
			{ 物品: 1082150, 数量: 1, Ap点: 1, 抵用: 0, 点卷: 1000, 血蓝: 10 },
		]
	},
]


function start() {
	status = -1;

	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1) {
			status++;
		} else {
			status--;
		}
		if (status == 0) {
			id = cm.getPlayer().getId();
			var text = "#d\r\n";
			if (展示讯息介绍 == false) {
				text += "#L" + 展示讯息选择 + "#" + 上拉 + "||------------[#r关闭#d]讯息介绍------------||" + 上拉 + "#l\r\n\r\n";
				//text += "\t\t\t#L" + 展示讯息选择 + "#" + 上拉 + "[#r关闭#d]讯息介绍" + 上拉 + "#l\r\n\r\n";
				text += " #k┏━#r冒险岛提示#k━━━━━━━━━━━━━━━━┓\r\n";
				text += "\t#d" + 广播 + " 欢迎来到 [#r" + 功能名称 + "#d]\r\n";
				text += "\t#d" + 广播 + " 每个任务只能收集一次\r\n";
				text += "\t#d" + 广播 + " 每次交提任务需要扣除收集材料\r\n";
				text += "\t#d" + 广播 + " 累计完成详情状况：\r\n";
				var Hp = "Hp:" + 数目美化(getLog("Hp"), 5, true);
				var Mp = "Mp:" + 数目美化(getLog("Mp"), 5, true);
				var Ap = "Ap:" + 数目美化(getLog("Ap"), 5, true);
				var Cs = "完成次数:" + 数目美化(getLog("收集"), 5, true);
				text += "\t" + Hp + Mp + Ap + Cs + "\r\n";
				text += " #k┗━━━━━━━━━━━━━━━━━━━━━━┛#k\r\n";
			} else {
				text += "#L" + 展示讯息选择 + "#" + 下拉 + "||------------[#r展开#d]讯息介绍------------||" + 下拉 + "#l\r\n\r\n";
				//text += "\t\t\t#L" + 展示讯息选择 + "#" + 下拉 + "[#r展开#d]讯息介绍" + 下拉 + "#l\r\n\r\n";
			}
			for (var i = 0; i < 收集列表.length; i++) {
				var is = 收集列表[i];
				if (类型选择 == is.选择) {
					展示 = is.类型;
				}
				text += " ";
				//text += (类型选择 == is.选择 ? "#L" + is.选择 + "#" + xx + "[#b" + is.类型 + "#d]" + 关 + "" + xx + "#l" : "#L" + is.选择 + "#" + xx + "[#b" + is.类型 + "#d]" + 开 + "" + xx + "#l");
				text += (类型选择 == is.选择 ? "#L" + is.选择 + "#[#b" + is.类型 + "#d]" + 关 + "#l" : "#L" + is.选择 + "#[#b" + is.类型 + "#d]" + 开 + "#l");
				if ((i + 1) % 4 == 0) {
					text += " \r\n\r\n";
				}
			}
			text += " \r\n\r\n";
			for (var j = 0; j < 收集列表.length; j++) {
				var is_j = 收集列表[j];
				if (展示 == is_j.类型) {
					text += " #d┏━━━━━━━━ #k收集状态展示#d ━━━━━━━┓\r\n";
					var content = new Array();
					llist = is_j.收集控制.length;
					if(阅读页数 >= llist){
						阅读页数 = llist;
					}
					for (var k = 页数; k < 阅读页数; k++) {
						var is_k = is_j.收集控制[k];
						switch (getLog("收集物品:" + is_k.物品 + "_数量:" + is_k.数量)) {
							case 0:
								if (物品数量(is_k.物品) >= is_k.数量) {
									content.push([k, 0]);
								} else {
									content.push([k, 1]);
								}
								break;
							case 1:
								content.push([k, 2]);
								break;
							default:
								break;
						}
					}
					var 状态;
					var 上页 = (页数 >= 阅读 ? "#L" + 上一页 + "#" + xx + "[#b上一页#d]" + xx + "#l\t\t" : "\t\t\t\t\t\t");
					var 下页 = ((阅读页数 - 页数) >= 阅读 && 阅读页数 != llist ? "#L" + 下一页 + "#" + xx + "[#b下一页#d]" + xx + "#l" : "");
					text += "\t" + 上页 + "" + 下页 + "\r\n";
					for (var l = 0; l < 3; l++) {
						switch (l) {
							case 0: 状态 = "#k可领#d"; break;
							case 1: 状态 = "#r进行#d"; break;
							case 2: 状态 = "#k完成#d"; break;
						}
						for (var m = 0; m < content.length; m++) {
							if (content[m][1] == l) {
								var is_m = is_j.收集控制[m + 页数];
								var zt1 = "#c" + is_m.物品 + "##d";
								var zt2 = is_m.数量 + "#d";
								if (l == 2) {
									var zt3 = is_m.数量 + "#d";
									text += "#L" + content[m][0] + "#状态:[#r" + zt3 + "/#r" + zt2 + "]" + 状态 + "#v" + is_m.物品 + ":##b#z" + is_m.物品 + "##d" + 美化new + "#l\r\n";
								} else {
									text += "#L" + content[m][0] + "#状态:[#k" + zt1 + "/#r" + zt2 + "]" + 状态 + "#v" + is_m.物品 + ":##b#z" + is_m.物品 + "##d" + 美化new + "#l\r\n";
								}
							}
						}
					}
					text += "\r\n #d┗━━━━━━━━━━━━━━━━━━━━━━┛";
					break;
				}
			}
			text += "\r\n";
			cm.sendYesNo(text);
		} else if (status == 1) {
			sele1 = selection;
			var text = "#d\r\n";
			for (var i = 0; i < 收集列表.length; i++) {
				if (sele1 == 收集列表[i].选择) {
					类型选择 = sele1;
					页数 = 0;
					阅读页数 = 阅读;
					start();
					return;
				}
			}
			switch (sele1) {
				case 上一页:
					if (阅读页数 == llist) {
						页数 = (阅读页数 - (llist % 阅读)) - 阅读;
						阅读页数 = 阅读页数 - (llist % 阅读);
						if (阅读页数 == llist) {
							页数 -= 阅读;
							阅读页数 -= 阅读;
						}
					} else {
						页数 -= 阅读;
						阅读页数 -= 阅读;
					}
					if (页数 <= 0) {
						页数 = 0;
						阅读页数 = 阅读;
					}
					start();
					return;
				case 下一页:
					if (llist - 阅读页数 >= 阅读) {
						页数 += 阅读;
						阅读页数 += 阅读;
					} else {
						页数 = 阅读页数;
						阅读页数 = llist;
					}
					start();
					return;
				case 展示讯息选择:
					if (展示讯息介绍 == true) {
						展示讯息介绍 = false;
					} else {
						展示讯息介绍 = true;
					}
					start();
					break;
				default:
					for (var j = 0; j < 收集列表.length; j++) {
						var is_j = 收集列表[j];
						if (展示 == is_j.类型) {
							var is_seles = is_j.收集控制[sele1];
							var 完成状态 = getLog("收集物品:" + is_seles.物品 + "_数量:" + is_seles.数量);
							text += " #k┏━#r冒险岛提示#k━━━━━━━━━━━━━━━━┓\r\n";
							text += "\t\t\t#L" + 返回 + "#" + xx + "[#b返回上一页#d]" + xx + "#l\r\n\r\n";
							text += "\t#d收集内容：#v" + is_seles.物品 + ":##z" + is_seles.物品 + "#\r\n";
							var zt1 = "#c" + is_seles.物品 + "##d";
							var zt2 = is_seles.数量 + "#d";
							var zt3 = is_seles.数量 + "#d";
							if (完成状态 == 0) {
								text += "\t#d收集数量：[#k" + zt1 + "/#r" + zt2 + "]\r\n\r\n";
							} else {
								text += "\t#d收集数量：[#r" + zt3 + "/#r" + zt2 + "]\r\n\r\n";
							}
							if (is_seles.Ap点 != 0 && is_seles.Ap点 != null) {
								text += "\t" + 获得 + " #r" + 数目美化(is_seles.Ap点, 5, false) + "#b  Ap点#d\r\n";
							}
							if (is_seles.抵用 != 0 && is_seles.抵用 != null) {
								text += "\t" + 获得 + " #r" + 数目美化(is_seles.抵用, 5, false) + "#b 抵用卷#d\r\n";
							}
							if (is_seles.点卷 != 0 && is_seles.点卷 != null) {
								text += "\t" + 获得 + " #r" + 数目美化(is_seles.点卷, 5, false) + "#b 点卷#d\r\n";
							}
							if (is_seles.血蓝 != 0 && is_seles.血蓝 != null) {
								text += "\t" + 获得 + " #r" + 数目美化(is_seles.血蓝, 5, false) + "#b Hp/Mp#d\r\n";
							}
							text += "\r\n";
							if (完成状态 == 0) {
								if (物品数量(is_seles.物品) >= is_seles.数量) {
									text += "\t\t\t\t\t\t\t状态：[#r可完成#d]\r\n\r\n";
									text += "\t\t\t\t\t\t\t是否要完成呢？\r\n";
									text += "\t\t\t\t\t\t";
									text += "#L" + 是 + "#" + xx + "#r是#d" + xx + "#l  ";
									text += "#L" + 否 + "#" + xx + "#k否#d" + xx + "#l\r\n\r\n";
								} else {
									text += "\t\t\t\t\t\t\t状态：[#r进行中#d]\r\n";
								}
							} else {
								text += "\t\t\t\t\t\t\t状态：[#r已完成#d]\r\n";
							}
							text += " #k┗━━━━━━━━━━━━━━━━━━━━━━┛#k";
							break;
						}
					}
					cm.sendYesNo(text);
					break;
			}
		} else if (status == 2) {
			sele2 = selection;
			switch (sele2) {
				case 返回:
					start();
					break;
				case 是:
					for (var j = 0; j < 收集列表.length; j++) {
						var is_j = 收集列表[j];
						if (展示 == is_j.类型) {
							var is_seles = is_j.收集控制[sele1];
							cm.gainItem(is_seles.物品, -is_seles.数量);
							if (is_seles.Ap点 != 0 && is_seles.Ap点 != null) {
								cm.getPlayer().gainAp(is_seles.Ap点);
								setLog("Ap", is_seles.Ap点);
								cm.getPlayer().dropMessage(5, "获得 " + is_seles.Ap点 + " Ap点");
							}
							if (is_seles.抵用 != 0 && is_seles.抵用 != null) {
								cm.gainDY(is_seles.抵用);
							}
							if (is_seles.点卷 != 0 && is_seles.点卷 != null) {
								cm.gainNX(is_seles.点卷);
							}
							if (is_seles.血蓝 != 0 && is_seles.血蓝 != null) {
								cm.setPlayerStat("MAXHP", cm.getPlayerStat("MAXHP") + is_seles.血蓝);
								cm.setPlayerStat("MAXMP", cm.getPlayerStat("MAXMP") + is_seles.血蓝);
								setLog("Hp", is_seles.血蓝);
								setLog("Mp", is_seles.血蓝);
								cm.getPlayer().dropMessage(5, "最大HP / MP 值  增加" + is_seles.血蓝 + " 注意！换线生效。");
							}
							setLog("收集次数", 1);
							setLog("收集物品:" + is_seles.物品 + "_数量:" + is_seles.数量, 1);
							cm.getPlayer().dropMessage(5, "恭喜您，完成了一个任务！");
							break;
						}
					}
					start();
					break;
				case 否:
					start();
					break;
				default:
					break;
			}
		}
	}
}

function 物品数量(itemid) {
	return cm.getPlayer().getItemQuantity(itemid, false);
}

function setLog(logName, sum) {
	var id = cm.getPlayer().getId();
	sqlMultiPurpose("UPDATE 泉哥_道具收集 SET count = count + " + sum + " WHERE id = " + id + " AND logname = '" + logName + "'");
}

function getLog(logName) {
	var id = cm.getPlayer().getId();
	var ret = sqlSelect("SELECT * FROM 泉哥_道具收集 WHERE id = " + id + " AND logname = '" + logName + "'");
	if (ret.length == 0) {
		sqlMultiPurpose("INSERT INTO 泉哥_道具收集 (id, logname, count, type) values (" + id + ",'" + logName + "',0,1)");
		var ret = sqlSelect("SELECT * FROM 泉哥_道具收集 WHERE id = " + id + " AND logname = '" + logName + "'");
	}
	var count = ret[0]["count"];
	return count;
}

function sqlSelect(sql) {
	if (rc == true) {
		var data = Packages.org.gms.util.DatabaseConnection;
		var con = data.getConnection();
	} else {
		var data = Packages.database.DBConPool;
		var con = data.getInstance().getDataSource().getConnection();
	}
	var ret = new Array();
	var ps = con.prepareStatement(sql);
	var rs = ps.executeQuery();
	var metaData = ps.getMetaData();
	while (rs.next()) {
		var rsdata = new java.util.HashMap();
		for (var j = 1; j <= metaData.getColumnCount(); j++) {
			columnLabel = metaData.getColumnLabel(j);
			rsdata.put(columnLabel, rs.getObject(columnLabel));
		}
		if (!rsdata.isEmpty()) {
			ret.push(rsdata);
		}
	}
	rs.close();
	ps.close();
	con.close();
	return ret;
}

function sqlMultiPurpose(sql) {//
	if (rc == true) {
		var data = Packages.org.gms.util.DatabaseConnection;
		var con = data.getConnection();
	} else {
		var data = Packages.database.DBConPool;
		var con = data.getInstance().getDataSource().getConnection();
	}
	var ps = con.prepareStatement(sql);
	ret = ps.executeUpdate();
	ps.close();
	con.close();
	return ret;
}

function 字体美化(length, content, boolean) {
	var str = "";
	var cs = "";
	if (content.length > length) {
		str = content;
	} else {
		for (var j = 0; j < length - content.getBytes("GB2312").length; j++) {
			cs += " ";
		}
	}
	if (boolean == true) {
		str = content + cs;
	} else {
		str = cs + content;
	}
	return str;
}

function 数目美化(num, length, boolean) {//数字美化
	var str = "";
	var ul_nums = [
		"#fEffect/UIWindow/KeyConfig/key/11#",
		"#fEffect/UIWindow/KeyConfig/key/2#",
		"#fEffect/UIWindow/KeyConfig/key/3#",
		"#fEffect/UIWindow/KeyConfig/key/4#",
		"#fEffect/UIWindow/KeyConfig/key/5#",
		"#fEffect/UIWindow/KeyConfig/key/6#",
		"#fEffect/UIWindow/KeyConfig/key/7#",
		"#fEffect/UIWindow/KeyConfig/key/8#",
		"#fEffect/UIWindow/KeyConfig/key/9#",
		"#fEffect/UIWindow/KeyConfig/key/10#",
	];
	var showTxt = "";
	var tempNums = num.toString().split("");
	for (var i = 0; i < tempNums.length; i++) {
		showTxt += ul_nums[parseInt(tempNums[i])];
	}
	var sss = "";
	for (var i = tempNums.length; i < length; i++) {
		sss += " ";
	}
	if (boolean == true) {
		str = showTxt + sss;
	} else {
		str = sss + showTxt;
	}
	return str;
}

var rc = false;
var 获得 = "#fUI/UIWindow.img/QuestIcon/4/0#";
var 美化new = "";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 上拉 = "#fUI/UIWindow.img/PvP/Scroll/enabled/prev2#";
var 下拉 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var xx = "#fItem/Etc/0427/04270001/Icon9/0#";  //小黄星
var 分割线 = "#fUI/Login.img/WorldSelect/channel/chgauge#";
var 广播 = "#fUI/CN_Chat/ChattingRoom/BtVolUp/0/normal/0#";

var llist;
var id;
var 展示;
var 阅读页数;
var 页数;
var 展示讯息介绍 = true;
var 展示讯息选择 = 2146000000;
var 上一页 = 2142000000;
var 下一页 = 2142000001;
var 返回 = 2146000001;
var 是 = 2146000002;
var 否 = 2146000003;
var 类型选择;