var 任务名称 = "超越戒指任务";
var 主线任务 = new Array(
//奖励的和奖励数量必须一致，需要材料和材料数量必须一致，否则会出错！
[[10]/*0等级*/,[1113401,20,20,20,20,0,0,20,20,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1112952,1112951,1112666,1113064]/*3需要材料*/,[1,1,1,1]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k听明珠港的特奥说，哪里有很多#r蜗牛#k让他感觉很苦恼！，冒险家快去清理吧？",0]/*6简介1,简介2*/],
[[20]/*0等级*/,[1113401,30,30,30,30,0,0,30,30,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000002,4000017]/*3需要材料*/,[1,200,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k从明珠港过去有个非常美丽的地方，不过最近被大量的#r漂漂猪#k占领了，冒险家，我需要你尽快消灭他们，并带回来我需要的物品。",0]/*6简介1,简介2*/],
[[30]/*0等级*/,[1113401,40,40,40,40,0,0,40,40,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000008,4000015]/*3需要材料*/,[1,200,200]/*4材料数量*/,[300,300000]/*5点卷,金币*/,["#k什么？你连蘑菇都怕？难道是林中之城的#r僵尸蘑菇#k吗？这么胆小我怎么放心把任务交给你做？",0]/*6简介1,简介2*/],
[[40]/*0等级*/,[1113401,50,50,50,50,0,0,50,50,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000029,4000043,4000014]/*3需要材料*/,[1,200,200,200]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k这先该死的猴子，在#r黄金海岸#k胡作非为，乱仍香蕉皮，严重破坏冒险岛的环境卫生。我需要你去把他们仍的香蕉皮给我带回来！另外顺便也帮我取回在#r勇士部落#k横行霸道的土龙身上的头骨，我要给它们一个难忘的教训！",0]/*6简介1,简介2*/],
[[50]/*0等级*/,[1113401,60,60,60,60,0,0,60,60,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000025,4000108,4000048]/*3需要材料*/,[1,200,200,200]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k这次我需要三个物品，最近射手村东部森林那边的#r石头人#k又开始活跃了，玩具城的#r熊猫#k也变得开始不安分起来，难道就因为它们是国宝就可以乱来吗？还有冰封雪域的#r小白雪人#k也活动频繁，似乎在酝酿着什么阴谋！",0]/*6简介1,简介2*/],
[[60]/*0等级*/,[1113401,70,70,70,70,0,0,70,70,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000177,4000045,4000172]/*3需要材料*/,[1,400,400,400]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k林中之城的深处驻扎着大量的#r混种石头人#k，乌龟好像就住在#r黄金海岸#k里，还有三尾狐在#r童话村#k，听说是人变成的！",0]/*6简介1,简介2*/],
[[70]/*0等级*/,[1113401,80,80,80,80,0,0,80,80,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000027,4000028,4000046]/*3需要材料*/,[1,200,200,200]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k看来你还是找不到啊？怪猫就在#r林中之城#k深处的龙穴里，牛魔王被关在地下诅咒的寺院里面。",0]/*6简介1,简介2*/],
[[80]/*0等级*/,[1113401,90,90,90,90,0,0,90,90,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000017,4000082,4031794]/*3需要材料*/,[1,200,100,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k猪头就在猪猪的海岸里，不过僵尸的金齿你可要小心，#r死亡之林#k路途遥远，路上有各种强大的怪物，桃子在#r武陵#k一直往左边走你就会看到很多桃林，从树上摘下来给我就可以，虽然很辛苦，但是你能拿来我需要的东西、我将会给你非常丰富的奖励的 ！！！",0]/*6简介1,简介2*/],
[[90]/*0等级*/,[1113401,100,100,100,100,0,0,100,100,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000232,4000233,4000234]/*3需要材料*/,[1,300,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k冒险家，好久没有你的消息了，想不到你已经这么强大了，好吧！这次我需要的东西在#r神木村#k，去找一下半人马吧！",0]/*6简介1,简介2*/],
[[100]/*0等级*/,[1113401,120,120,120,120,0,0,120,120,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000054,4000136]/*3需要材料*/,[1,100,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k听说在#r林中之城的宾馆#k里面有人卖桑拿服，我也不确定，可能他需要你帮忙才给你桑拿服呢？另外椰子我也想尝尝味道怎么样，在#r黄金海岸#k的椰子树上就可以打到！",0]/*6简介1,简介2*/],
[[110]/*0等级*/,[1113401,140,140,140,140,0,0,140,140,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000040,4000176,4000053]/*3需要材料*/,[1,30,30,200]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k冒险家，这次不知道这些蘑菇怎么掌握的方法，居然进化成了蘑菇王，蜈蚣也变异成了大王蜈蚣，大王蜈蚣在#r东方神州#k危害四方，看来这个世界越来越不安全了，我需要你尽一份力，帮我狩猎它们。带回他们的证物，我将会给你奖励！",0]/*6简介1,简介2*/],
[[120]/*0等级*/,[1113401,160,160,160,160,0,0,160,160,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000134,4000135]/*3需要材料*/,[1,300,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k你做了玩具城奖牌任务了吗？那个任务好像就是给小丑披风的，我需要你拿来和我交换物品，另外玩具城地下深处就有大海贼在叛乱！！！",0]/*6简介1,简介2*/],
[[130]/*0等级*/,[1113401,180,180,180,180,0,0,180,180,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000460,4000461,4000462]/*3需要材料*/,[1,30,30,30]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k要打败黑暗龙王，就必须先消灭它的部队，在神木村#r龙的巢穴#k就集结了大量黑暗龙王的部队，去吧！冒险家！帮我收割它们的灵魂！！！",0]/*6简介1,简介2*/],
[[140]/*0等级*/,[1113401,200,200,200,200,0,0,200,200,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000244,4000245]/*3需要材料*/,[1,100,100]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k这次黑暗龙王又变得更加强大了，它集结的部队越来越多，似乎要抢夺世界树果实，在一次去打败它们吧！这一次我需要更多的灵魂！",0]/*6简介1,简介2*/],
[[150]/*0等级*/,[1113401,230,230,230,230,0,0,230,230,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000151,4000152,4000175]/*3需要材料*/,[1,1000,1000,300]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k距离上一次#r黑暗龙王#k叛乱过了诺干年，冒险岛的世界又来了一个更加强大的怪物，那就是#r品克缤#k，据说能操控时间，果真是强大啊，这次不是要你去消灭它，我要你去#r时间神殿#k先剪除它的羽翼，并带回它们的时间碎片和石头给我研究，希望能找到对付品克缤的方法。",0]/*6简介1,简介2*/],
[[160]/*0等级*/,[1113401,260,260,260,260,0,0,260,260,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4001241,4001242]/*3需要材料*/,[1,38,38]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集暴力熊狮掉落的材料吧！",0]/*6简介1,简介2*/],
[[170]/*0等级*/,[1113401,290,290,290,290,0,0,290,290,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591006]/*3需要材料*/,[1,18,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集扎昆掉落的材料吧！",0]/*6简介1,简介2*/],
[[180]/*0等级*/,[1113401,320,320,320,320,0,0,320,320,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591001]/*3需要材料*/,[1,28,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集黑龙掉落的材料吧！",0]/*6简介1,简介2*/],
[[190]/*0等级*/,[1113401,350,350,350,350,0,0,350,350,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591003]/*3需要材料*/,[1,38,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集品克缤掉落的材料吧！",0]/*6简介1,简介2*/],
[[200]/*0等级*/,[1113401,380,380,380,380,0,0,380,380,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591443]/*3需要材料*/,[1,48,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集半半掉落的材料吧！",0]/*6简介1,简介2*/],
[[210]/*0等级*/,[1113401,420,420,420,420,0,0,420,420,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591435]/*3需要材料*/,[1,188,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集皮埃尔掉落的材料吧！",0]/*6简介1,简介2*/],
[[220]/*0等级*/,[1113401,460,460,460,460,0,0,460,460,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591451]/*3需要材料*/,[1,288,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集血腥女王掉落的材料吧！",0]/*6简介1,简介2*/],
[[230]/*0等级*/,[1113401,500,500,500,500,0,0,500,500,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463,2591459]/*3需要材料*/,[1,388,28]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k去收集血腥女王掉落的材料吧！",0]/*6简介1,简介2*/],
[[240]/*0等级*/,[1113401,550,550,550,550,0,0,550,550,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463]/*3需要材料*/,[1,588]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k你知道吗？最近猪肉涨价了！",0]/*6简介1,简介2*/],
[[250]/*0等级*/,[1113401,600,600,600,600,0,0,600,600,0,0,0,0,0,0]/*1奖励*/,[1]/*2奖励数量*/,[1113401,4000463]/*3需要材料*/,[1,888]/*4材料数量*/,[0,0]/*5点卷,金币*/,["#k你知道吗？最近猪肉涨价了！",0]/*6简介1,简介2*/]


);


var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 表情高兴 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/2#";
var 小金币 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 点券图标 = "#fUI/CashShop/CashItem/0#";
var sels;
var status = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {
		角色等级 = cm.getPlayer().getLevel();
		
		任务等级 = cm.getPlayer().getBossLog1(任务名称,1);
		
        总进度 = 任务等级*5;
        var msg = "";	
        msg += "               #e#d"+表情高兴+"   成 长 戒 指   "+表情高兴+"\r\n\r\n#n";
		msg += "#k开始了冒险家！去完成你曾未探索的世界吧！\r\n#d";
        msg += "当前等级：lev."+角色等级+"\r\n#d";
        msg += "任务进度：#B"+总进度+"[%]# 任务["+任务等级+"]\r\n#d";
        		
		for (var i = 0; i < 主线任务.length; i++) {
			
			       if (角色等级 >= 主线任务[i][0] && 任务等级 == i) {
            msg += "         #L"+i+"#"+兔子3+"#d"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[#r可开始#d]"+兔子3+"#l\r\n";
			
			} else if (任务等级 > i ) {
			//msg += "         #L"+i+"#"+兔子3+"#k主线任务"+(i+1)+"(lev."+主线任务[i][0][0]+")[已完成#d]"+兔子3+"#l\r\n";
			msg += "            "+兔子3+"#k"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[已完成#d]"+兔子3+"\r\n";
			
			} else {
			msg += "         #L"+i+"#"+兔子2+"#d"+任务名称+""+(i+1)+"(lev."+主线任务[i][0][0]+")[#b待开始#d]"+兔子2+"#l\r\n";
			
			}

        }

		
        cm.sendSimple("" + msg + "");
    } else if (status == 1) {
		检测材料 = false;
		任务 = selection;
		if (任务等级 > 任务) {
		cm.sendOk("已经完成的任务！");	
        cm.dispose();
        return;		
		}
	


        sels = selection;
        var msg = "";		
            msg += "                 #e#d当前为"+任务名称+"["+(任务+1)+"]#n\r\n\r\n"
            文字说明 = 主线任务[任务][6][0];
			msg += ""+文字说明+"\r\n"
			msg += "#b升级为：\r\n"
			
			msg += "#d#v"+主线任务[任务][1][0]+"##t"+主线任务[任务][1][0]+"#\r\n"
			if (主线任务[任务][1][1] > 0){
			msg += "#d力量:"+主线任务[任务][1][1]+"\r\n"
			} if (主线任务[任务][1][2] > 0){
			msg += "#d敏捷:"+主线任务[任务][1][2]+"\r\n"
			} if (主线任务[任务][1][3] > 0){
			msg += "#d智力:"+主线任务[任务][1][3]+"\r\n"
			} if (主线任务[任务][1][4] > 0){
			msg += "#d运气:"+主线任务[任务][1][4]+"\r\n"
			} if (主线任务[任务][1][5] > 0){
			msg += "#dHP:"+主线任务[任务][1][5]+"\r\n"
			} if (主线任务[任务][1][6] > 0){
			msg += "#dMP:"+主线任务[任务][1][6]+"\r\n"
			} if (主线任务[任务][1][7] > 0){
			msg += "#d物攻:"+主线任务[任务][1][7]+"\r\n"
			} if (主线任务[任务][1][8] > 0){
			msg += "#d魔攻:"+主线任务[任务][1][8]+"\r\n"
			} if (主线任务[任务][1][9] > 0){
			msg += "#d物防:"+主线任务[任务][1][9]+"\r\n"
			} if (主线任务[任务][1][10] > 0){
			msg += "#d魔防:"+主线任务[任务][1][10]+"\r\n"
			} if (主线任务[任务][1][11] > 0){
			msg += "#d回避:"+主线任务[任务][1][11]+"\r\n"
			} if (主线任务[任务][1][12] > 0){
			msg += "#d命中:"+主线任务[任务][1][12]+"\r\n"
			} if (主线任务[任务][1][13] > 0){
			msg += "#d跳跃:"+主线任务[任务][1][13]+"\r\n"
			} if (主线任务[任务][1][14] > 0){
			msg += "#d速度:"+主线任务[任务][1][14]+"\r\n"
			}
				
            点卷 = 主线任务[任务][5][0];
			金币 = 主线任务[任务][5][1];
			// if (点卷 >0){
			// msg += ""+点券图标+"点卷:"+点卷+"\r\n"
			// }
			// if (金币 >0){
			// msg += ""+小金币+"金币:"+金币+"\r\n"
			// }	
				
			msg += "#b需要收集：\r\n"
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            msg += "#d#i"+主线任务[任务][3][i]+":##z"+主线任务[任务][3][i]+"# [#b#c"+主线任务[任务][3][i]+"##d/#r"+主线任务[任务][4][i]+"#d]\r\n"
			if (!cm.haveItem(主线任务[任务][3][i],主线任务[任务][4][i])){
			检测材料 = true;
			}	
		}					
        cm.sendYesNo(msg);
    } else if (status == 2) {
		
		if (角色等级 < 主线任务[任务][0][0]) {
		cm.sendOk("请不要越级做任务哦!年轻人，还是脚踏实地吧！");	
        cm.dispose();
        return;		
		}
		if (任务等级 < 任务){
		cm.sendOk("请先完成"+任务名称   +"["+(任务等级+1)+"]！不要想一步登天哦！");	
        cm.dispose();
        return;			
		}
		
		if (检测材料) {
		cm.sendOk("很抱歉！材料不足无法让您通过！\r\n为了证明你能力，请把需要的材料带来！");	
        cm.dispose();
        return;			
		}
		

		//cm.playerMessage(5, "测试信息222");
        if (cm.getInventory(1).isFull(1)){
		cm.sendOk("背包空间不足哦！");	
        cm.dispose();
        return;			
		}
		
		for (var i = 0; i < 主线任务[任务][3].length; i++) {			
            cm.gainItem(主线任务[任务][3][i],-主线任务[任务][4][i]);				
		}
		// for (var i = 0; i < 主线任务[任务][1].length; i++) {			
            // cm.gainItem(主线任务[任务][1][i],主线任务[任务][2][i]);				
		// } 
        cm.gainItem(主线任务[任务][1][0],主线任务[任务][1][1],主线任务[任务][1][2],主线任务[任务][1][3],主线任务[任务][1][4],主线任务[任务][1][5],主线任务[任务][1][6],主线任务[任务][1][7],主线任务[任务][1][8],主线任务[任务][1][9],主线任务[任务][1][10],主线任务[任务][1][11],主线任务[任务][1][12],主线任务[任务][1][13],主线任务[任务][1][14] );		
		// if (点卷 >0){
        // cm.gainNX(+点卷);
		// }
		// if (金币 >0){
        // cm.gainMeso(+金币);	
        // }		
        cm.getPlayer().setBossLog1(任务名称,1,1);
		//cm.worldMessage(2,"【主线任务】" + " : " + "["+cm.getName()+"]完成了"+任务名称+"["+cm.getPlayer().getBossLog1(任务名称,1)+"] 获得[幽暗戒指全属性+"+主线任务[任务][1][1]+"]"); //蓝底透明
		cm.喇叭(2,"【成长戒指任务】" + ":" + "["+cm.getName()+"]完成了 "+任务名称+""+cm.getPlayer().getBossLog1(任务名称,1)+" 装备[全属性+"+主线任务[任务][1][1]+"]"); //蓝底透明
		cm.sendOk("太好了，你有通关自己的努力完成了一次主线任务！");	
        cm.dispose();
        return;	

    } else {
        cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}