var status = -1;
var tknow=0;
var typed=0;
var ca = java.util.Calendar.getInstance();
var year = ca.get(java.util.Calendar.YEAR); //获得年份
var month = ca.get(java.util.Calendar.MONTH) + 1; //获得月份
var day = ca.get(java.util.Calendar.DATE);//获取日
var hour = ca.get(java.util.Calendar.HOUR_OF_DAY); //获得小时
var minute = ca.get(java.util.Calendar.MINUTE);//获得分钟
var second = ca.get(java.util.Calendar.SECOND); //获得秒
var 小烟花 ="#fMap/MapHelper/weather/squib/squib4/1#";
var 星星 ="#fMap/MapHelper/weather/witch/3#";
var 红枫叶 ="#fMap/MapHelper/weather/maple/1#";
var 分割线 = "#fUI/Login.img/WorldSelect/channel/chgauge1#";
var time1;
var time2;
var timeout = 24; //超时时间

function start() {
status = -1;
action(1, 0, 0);
}

function action(mode, type, selection) {
    // 获取当前时间
    var ca = java.util.Calendar.getInstance();
    var hour = ca.get(java.util.Calendar.HOUR_OF_DAY); // 24小时制的小时数

    // 检查是否在20:00至22:00之间
    if (hour < 10 || hour >= 22) {
        cm.sendOk("当前不是答题时间，答题活动开启时间为#r每天10:00至22:00#k。服务器当前时间：#r" + hour +":" + minute + ":" + second + "#n#k");
        cm.dispose();
        return;
    }
    // 检查是否在频道1
    if (cm.getPlayer().getClient().getChannel() != 1) {
        cm.sendOk("该活动仅在#r频道1#k开启。请前往频道1参与答题活动。");
        cm.dispose();
        return;
    }
		
			if (mode == -1) {
                cm.dispose();
            }else {
                if (status >= 0 && mode == 0) {
				   cm.dispose();
				   return;                    
				}
				if (mode == 1) {
				   status++;
				}else {
				   status--;
				}
		if (status == 0) {
			var 
			text = "   " + 分割线 + " " + 分割线 + " " + 分割线 + "\r\n";
			//text =""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n";		
		    text += "          "+小烟花 +"#r欢迎来到开心蘑菇冒险岛知识问答#k"+小烟花 +"\r\n";
			text += "   " + 分割线 + " " + 分割线 + " " + 分割线 + "\r\n";
		    //text += ""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+""+红枫叶+"\r\n\r\n";
			text += "#r    注意：每日答题上限30题，每题限时24秒，超时作废！#k\r\n\r\n";
			text += "               服务器当前时间：#r" + hour +":" + minute + ":" + second + "#n#k\r\n\r\n";
			text += "                  今日答题总数: #r"+ cm.getBossLog("答题总数") +" #b道#n#k\r\n";
			text += "                  今日正确题目: #r"+ cm.getBossLog("答题正确") +" #b道#n#k\r\n";
			text += "        #L2##r 开始答题（"+timeout+"秒限时，速度要快哦）#l\r\n\r\n";
			text += "              #L3##r 答对题目数兑换奖励#l\r\n\r\n";
			text += "        #L1##b 点此查看答题详细规则（新手必看）#l\r\n\r\n";
			text += "#b     注意：每天0点过后#r清空答题数据#b，请及时兑换奖励！\r\n";
			cm.sendSimple(text);
		}else if (status == 1) {
			if(selection==1){
					cm.sendOk("每次答题都有#b"+timeout+"秒钟时间限制#k，超过时间则失败，指定时间内回答错误也失败！点击开始答题后开始记时，在给出的题目中，#r一般有4个选项#k，请输入你认为正确的选项，点击确认即可完成答题.\r\n#r注意：#k每次回答正确后，将会随机给你奖励，如冒险币、点卷、抵用券！\r\n#k==================================================#n#k\r\n#r                 答案在群文件下载\r\n#k==================================================");
					cm.dispose();
					return;
			}
			if(selection==2){
				if((minute >= 00 && minute <= 59)){
					var randx = Math.floor(Math.random() * 3);
					typed = 1;					
					if(randx < 2){
						var randy = Math.floor(Math.random() * itemtk1.length);//取题库1
						tknow = itemtk1[randy];
						cm.setBossLog("答题总数");
						cm.setBossLog("答题限制");
						cm.sendGetText("#b问题：" + tknow[0] + "\r\n#r============================================#n#k\r\n#d答案1:"+tknow[1]+"\r\n答案2:"+tknow[2]+"\r\n答案3:"+tknow[3]+"\r\n答案4:"+tknow[4]+"\r\n============================================#n#k\r\n#r请输入你认为正确的答案,如果是答案1就填1，答案2就填2\r\n\r\n");
						time1 = cm.getCurrentTime();
					}else{
						var randy = Math.floor(Math.random() * itemtk2.length);//取题库2
						tknow = itemtk2[randy];
						cm.setBossLog("答题总数");
						cm.setBossLog("答题限制");
						cm.sendGetText("#b问题：" + tknow[0] + "\r\n#r============================================#n#k\r\n#d答案1:"+tknow[1]+"\r\n答案2:"+tknow[2]+"\r\n答案3:"+tknow[3]+"\r\n答案4:"+tknow[4]+"\r\n============================================#n#k\r\n#r请输入你认为正确的答案,如果是答案1就填1，答案2就填2\r\n");
						time1 = cm.getCurrentTime();
					}
				}else{
					cm.sendOk("当前服务器时间:"+hour+"点"+minute+"分\r\n时间还没到哦.整点的50-55分可以答题，例如:\r\n#b1点50分到1点55分\r\n#r而且可以答题的时候，系统会公告，请不要错过。");
					cm.dispose();
				}
			}
			if(selection==3){
				typed = 2;
				var selText = "    截至目前为止，您答对的题目总数为:#r"+cm.getBossLog("答题正确") +"道#b\r\n\r\n";
				selText += "    #r注意：30道题全部答对，可领取所有奖励！\r\n";
				selText += "    #r注意：每个奖励每天只能兑换一次！\r\n\r\n";
				selText += "   " + 分割线 + " " + 分割线 + " " + 分割线 + "\r\n";
				selText += "#L1# 换取 #i3994742#  *888，#i4031138#  *2000W(需要答对10题)#l\r\n";
				selText += "#L2# 换取 #i4310143#  *20，  #i4000463#  *20(需要答对20题)#l\r\n";
				selText += "#L3# 换取 #i4000487#  *10， #i2022511#  *4(需要答对25题)#l\r\n";
				selText += "#L4# 换取  #i2022509#   *10， #i2022511#  *6(需要答对30题)#l\r\n\r\n";
				cm.sendSimple(selText);
			}
		}else if (status == 2) {
			if(typed == 1){
				if(cm.getBossLog("答题限制") > 30 && cm.getBossLog("答题总数") > 30 ){
				cm.sendOk("很遗憾，你今天的30道题已经回答完毕，请用心回答每一道题不然可会浪费许多奖励喔！");
				cm.dispose();
				return;
				}else{
				//cm.setBossLog("答题总数");
				//cm.setBossLog("答题限制");
				time2 = cm.getCurrentTime();   //取出答题后的时间
				fee = cm.getText();						
				if(selection == tknow[5] || fee == tknow[5]){
					//计算两个时间差
					if ((time2 - time1)/1000 > timeout) {
						cm.sendOk("很遗憾，回答是正确的，但是超时了！\r\n");
						cm.dispose();
						return;
					} 
					var randx = Math.floor(Math.random() * 15) + 1;
					var randy = Math.floor(Math.random() * 100000) + 5000;//冒险币
					var randdj = Math.floor(Math.random() * 2000);//抵用点卷
					var randdy = Math.floor(Math.random() * 1000);//点卷
					var randjf = Math.floor(Math.random() * 10) + 5;//彩虹鱼
					var randred = Math.floor(Math.random() * 10) + 5;//彩虹鱼
					cm.setBossLog("答题正确");					
					if(randx < 3){//冒险币
						cm.gainMeso(randy);
                        cm.gainExpR(+10000); 						
						cm.sendOk("恭喜，您答对了！#b正确答案:"+tknow[5]+"#k\r\n您获得了 "+randy+" 冒险币.");
						cm.喇叭(1, "[限时答题]：恭喜：" + cm.getPlayer().getName() + "正确回答<班主任>的问题,得到 " +randy+"冒险币~");
					}
					if(randx >= 3 && randx < 4){//抵用券
						cm.gainDY(randdj);
						cm.gainExpR(+10000);
						cm.sendOk("恭喜，您答对了！#b正确答案:"+tknow[5]+"#k\r\n您获得了 " +randdj+"抵用卷.");
						cm.喇叭(1, "[限时答题]：恭喜：" + cm.getPlayer().getName() + "正确回答<班主任>的问题,得到 " +randdj+"抵用卷~");
					}
					if(randx >= 4 && randx < 9){//点劵
						cm.gainNX(randdy);
						cm.gainExpR(+20000);
						cm.sendOk("恭喜，您答对了！#b正确答案:"+tknow[5]+"#k\r\n您获得了 "+randdy+" 点卷");
						cm.喇叭(1, "[限时答题]：恭喜：" + cm.getPlayer().getName() + "正确回答<班主任>的问题,得到 " +randdy+"点卷~");
					}
					if(randx >= 9 && randx < 12){//彩虹鱼
						//cm.gainPlayerPoints(randjf);
						cm.gainItem(3994742, randjf);
						cm.gainExpR(+50000);
						cm.sendOk("恭喜，您答对了！#b正确答案:"+tknow[5]+"#k\r\n您获得了 " +randjf+" 彩虹鱼.");
						cm.喇叭(1, "[限时答题]：恭喜：" + cm.getPlayer().getName() + "正确回答<班主任>的问题,得到 " +randjf+"彩虹鱼~");
					}
					if(randx >= 12 && randx<= 15){//彩虹鱼
						cm.gainItem(3994742, randred);
						cm.gainExpR(+5000);
						cm.sendOk("恭喜，您答对了！#b正确答案:"+tknow[5]+"#k\r\n您获得了 " +randred+" 彩虹鱼.");
					    cm.喇叭(1, "[限时答题]：恭喜：" + cm.getPlayer().getName() + "正确回答<班主任>的问题,得到 " +randred+"彩虹鱼~");
					}					
				}else{
					cm.sendOk("很遗憾，回答错误！正确答案是：#r" + tknow[tknow[5]] + "");
				}
				cm.dispose();
				return;
				}
			}
			if(typed==2){
				if(selection==1){
					if (cm.getBossLog("答题10兑换") < 1){
						if (cm.getBossLog("答题正确") < 10){
							cm.sendOk("抱歉，您今天还没有答对10道题目，请继续努力！\r\n");
							cm.dispose();
							return;
						}
						cm.gainMeso(20000000);
						cm.gainItem(3994742, 888);//彩虹鱼
						cm.setBossLog("答题10兑换");
						cm.sendOk("恭喜，您使用正确答题数目10题兑换了888个彩虹鱼和2000W金币！");
						cm.喇叭(1,"[限时答题]:恭喜["+ cm.getChar().getName() +"]用正确答题数目【10题】兑换了888个彩虹鱼和2000W金币！");
					} else {
						cm.sendOk("抱歉，您今天已经领取过了.");
						cm.dispose();
						return;
					}
				} else if (selection == 2){
							if (cm.getBossLog("答题20兑换") < 1){
						if (cm.getBossLog("答题正确") < 20){
							cm.sendOk("抱歉，您今天还没有答对20道题目，请继续努力！\r\n");
							cm.dispose();
							return;
						}
						cm.gainItem(4310143, 20);//BOSS币20个
				        cm.gainItem(4000463, 20);//国庆纪念币10个
						cm.setBossLog("答题20兑换");
						cm.sendOk("恭喜，您使用正确答题数目兑换了#i4000463#x20.#i4310143#x20.");
						cm.喇叭(1,"[限时答题]:恭喜["+ cm.getChar().getName() +"]用正确答题数目【20题】兑换了国庆纪念币20个，BOSS币20个~~");
					} else {
						cm.sendOk("抱歉，您今天已经领取过了.");
						cm.dispose();
						return;
					}
				} else if (selection == 3){
				            if (cm.getBossLog("答题25兑换")< 1){
						if (cm.getBossLog("答题正确") < 25){
							cm.sendOk("抱歉，您今天还没有答对25道题目，请继续努力！\r\n");
							cm.dispose();
							return;
						}
						cm.gainItem(4000487, 10);//暗影币
						cm.gainItem(2022511, 4);//伤害突破秘术
						cm.setBossLog("答题25兑换");
						cm.sendOk("恭喜，您使用正确答题数目兑换了#i4000487#暗影币x10.#i2022511#伤害突破秘术x4.");
						cm.喇叭(1,"[限时答题]:恭喜["+ cm.getChar().getName() +"]用正确答题数目【25题】兑换了暗影币10个、伤害突破秘术4个！");
					} else {
						cm.sendOk("抱歉，您今天已经领取过了.");
						cm.dispose();
						return;
					}
				} else if (selection == 4){
				            if (cm.getBossLog("答题30兑换")< 1){
						if (cm.getBossLog("答题正确") < 30){
							cm.sendOk("抱歉，您今天还没有答对30道题目，请继续努力！\r\n");
							cm.dispose();
							return;
						}
						if (cm.getSpace(2) < 1){
						cm.sendOk("您的背包没有空间，请至少保证消耗栏1空格！\r\n");
						cm.dispose();
						return;
					}
						cm.gainItem(2022511, 6);//伤害突破秘术
						cm.gainItem(2022509, 10);//分身强化
						cm.setBossLog("答题30兑换");
						cm.sendOk("恭喜，您使用正确答题数目兑换了#i2022509#元宝宝箱x10.#i2022511#伤害突破秘术x6.");
						cm.喇叭(1,"[限时答题]:恭喜["+ cm.getChar().getName() +"]用正确答题数目【30题】兑换了元宝宝箱10个、伤害突破秘术6个！！！");
					} else {
						cm.sendOk("抱歉，您今天已经领取过了.");
						cm.dispose();
						return;
					}
				} else if (selection == 5){//换取分身强化
					if (cm.getBossLog("答题正确") < 35){
						cm.sendOk("抱歉，您今天还没有答对300道题目，请继续努力！\r\n");
						cm.dispose();
						return;
					}
					if (cm.getSpace(4) < 1){
						cm.sendOk("您的背包没有空间，请至少保证其他栏1空格！\r\n");
						cm.dispose();
						return;
					}
					cm.setBossLog("答题正确", 0, -300);
					//cm.gainItem(2022509, 1);//分身强化					
					cm.sendOk("恭喜，您使用正确答题数目兑换了元宝宝箱#i2022509#.");
					cm.喇叭(1,"[限时答题]:恭喜["+ cm.getChar().getName() +"]用正确答题数目30题兑换了元宝宝箱10个！");
					//cm.worldSpouseMessage(0x20,"[答题系统]:恭喜["+ cm.getChar().getName() +"]用正确答题数目兑换了分身强化~");
				}				
				cm.dispose();
				return;
			}
		}
	}
}
var itemtk1 = Array(
Array("冒险岛Online是在中国发行时是哪年","2002年","2003年","2004年","2005年","3"),
Array("创世之初冒险岛的监督者为世界选择了三位超越者掌管不同领域，其中错误的是","空间","时间","光","生命","1"),
Array("冒险岛黑魔法师被哪个原军团长背叛过","恶魔猎手","班·雷昂","古瓦洛","希拉","1"),
Array("哪个不是远古时期参加封印黑魔法师的6大英雄之一？","尖兵","龙神","双弩精灵","怪盗幻影","1"),
Array("以下哪个冒险岛角色可以进行男女自由切换","狂龙战士","超能力者","神之子","林之灵","3"),
Array("以下哪个不是冒险岛格兰蒂斯世界中生活着的种族","诺巴族","超能力者","翼人族","尖耳狐狸族","2"),
Array("做完哪个任务后可以不用再做变身任务直接进入黑暗龙王龙洞入口","摩伊拉的下落","敢死队的象征","屠龙的方法","下落不明的魔法使","2"),
Array("以下哪个地区不是在冒险岛世界","克里蒂亚斯","起源之塔","啾啾岛","未来之门","3"),
Array("哪个军团长是恶魔猎手的弟弟","威尔","格里梅尔","戴米安","路西德","3"),
Array("军团长中谁曾是时间神殿的大神官","希拉","奥尔卡","路西德","阿卡伊勒","4"),
Array("时间神殿中，第一次进入下一个小地图时需要完成什么任务","消灭当前地图怪物111只","消灭当前地图的怪物333只","消灭当前地图的怪物666只","消灭当前地图的怪物999只","2"),
Array("扎昆第3个前置任务名字叫什么","冶炼邀请","废矿调查","扎昆迷宫调查","制作火焰的眼","1"),
Array("班?雷昂原本生活在什么地方","金银岛","天空之城","米纳尔森林","冰封雪域","4"),
Array("神之子的初始等级是多少","100级","120级","150级","180级","1"),
Array("冒险岛RED真红版本出现的新职业神之子，是谁创造的","阿莉娅","伦娜","希纳斯","阿丽莎","2"),
Array("冒险岛圣地现任女皇希纳斯是谁的后代","阿莉娅","阿丽莎","希拉","伦娜","1"),
Array("哪个是格兰蒂斯世界的超越者","麦格纳斯","达勒摩尔","黑魔法师","格里梅尔","2"),
Array("我会跟着你的力量的。所以...请你相信您的力量吧————是谁的名言","阿卡伊勒","希拉","路西德","麦格纳斯","4"),
Array("在埃德尔斯坦诞生的对抗黑魔法师的组织是什么","黑色之翼","晓之阵","冒险骑士团","反抗者","4"),
Array("以下哪个职业不属于冒险骑士团","魂骑士","米哈尔","豹弩游侠","奇袭者","3"),
Array("火枪手3转的职业名称叫什么","毁灭炮手","斗士","爆破手","大副","4"),
Array("谁被黑魔法师的手下军团长戴米安囚禁于鲁塔比斯","伦娜","阿莉娅","希纳斯","阿丽莎","4"),
Array("暴君手套的天然可砸卷次数是几次","1次","2次","3次","4次","2"),
Array("暴风英雄系列职业中谁其实可以算是黑魔法师的一部分","龙神","双弩精灵","隐月","夜光法师","4"),
Array("永恒系列武器的出处在哪","扎昆","黑暗龙王","品客缤","班·雷昂","3"),
Array("上古之战时，阿莉娅是被谁所杀害的","奥尔卡和斯乌","希拉","恶魔猎手","阿卡伊勒","1"),
Array("神木村的喷火龙和格瑞芬多的官方刷新时间是多久","1小时","2小时","3小时","5小时","3"),
Array("黑暗龙王的敌对龙族是哪个","九灵龙","玛瑙龙","白帝龙","喷火龙","1"),
Array("上古时期被封印的扎昆巨兽是因为什么复活的","冰封雪域的部分居民的祭拜","废弃矿坑的地壳运动","废弃矿坑的火山喷发","黑魔法师的帮助","1"),
Array("扎昆的哪只手臂会释放封印，黑暗，虚弱魔法","扎昆手臂2","扎昆手臂3","扎昆手臂4","扎昆手臂5","4"),
Array("历代的飞侠首领被称作什么","达克尔","达克奇","达克鲁","达克文","3"),
//Array("本服的跑环系统，每日最高跑环次数为几次","15次","20次","25次","30次","3"),
Array("079版本冒险岛，背包内可携带的金币上限是多少亿","15亿","21亿","50亿","99亿","2"),
Array("本服轮回碑石星级强化最高可达到多少星","10星","15星","20星","25星","1"),
Array("天空组队副本第二关需要多少个碎片修复女神像","4个","5个","6个","7个","3"),
Array("风暴系列武器需要多少级才可以穿戴","90级","100级","120级","140级","2"),
Array("品客缤是从哪里被召唤出来的","虚空","异世界","天界","时间女神的镜子","4"),
Array("官方设定中，最少要达到多少级才能参加扎昆远征队","50级","60级","70级","80级","1"),
Array("冒险岛家族任务的出发地在哪","勇士部落","林中之城","冰封雪域","遗迹发掘队营地","4"),
Array("什么属性会影响死亡时下降的经验值","力量","敏捷","智力","运气","4"),
Array("暗影双刀一共要进行几次转职","5次","6次","7次","8次","3"),
Array("龙神一共可以进行几次转职","7次","8次","9次","10次","4"),
Array("079版本的冒险骑士团职业一共可以进行几次转职","2次","3次","4次","5次","2"),
//Array("现在美国国旗星条旗上有多少颗星","25","30","50","60","3"),
Array("谁以自己的存在为祭品，封印了黑魔法师","龙神","隐月","战神","恶魔猎手","2"),
Array("在金银岛开往天空之城的飞船上，有几率遇到什么怪物","蝙蝠怪","蝙蝠精","蝙蝠侠","蝙蝠魔","4"),
Array("最早拥有全屏攻击技能的职业是哪个","主教","黑骑士","神射手","船长","2"),
Array("上古之战的最终决战前，麦格纳斯夺取了谁的生命核心","恶魔猎手","古瓦洛","贝勒德","玛瑙龙","2"),
Array("威尔把神之子困在了什么地方","镜世界","起源之塔","梦之都拉克兰","万神殿","1"),
Array("以下哪个不是诺巴系列的角色","魔链影士","圣晶使徒","狂龙战士","爆莉萌天使","2"),
//Array("羽化修仙后，角色等级会从250级回到多少级","120级","150级","180级","200级","4"),
Array("连环环破是哪个职业的技能","侠盗","圣骑士","冲锋队长","暗影双刀","2"),
//Array("本服1件装备砸卷最高可以达到多少次","20次","30次","50次","66次","4"),
Array("洗血洗蓝系统中，血量及蓝量的上限不能超过多少","2万","3万","4万","5万","2"),
//Array("每周几晚上会固定开放全服2小时双倍经验活动","周五","周六","周日","周一","2"),
//Array("以下哪个不是理财箱子里的特惠功能","BOSS重置","折扣商城","极品回收","专属称号","2"),
//Array("用什么东西可以兑换到漩涡系列装备","影子商团币","君主币","凯梅尔兹金币","进化币","3"),
Array("上古时期曾坐落在勇士部落地区的圣瑞尼亚王国的国王因为想获得宝石鲁碧安而召来了什么怪物","海之魔女","艾里葛斯","地狱船长","御龙魔","2"),
Array("草莓味果糖可以在10分钟内提升多少攻击和魔力","30","40","50","60","3"),
Array("挑战闹钟需要完成什么前置任务","寻找时间碎片","死守玩具城","修复扭曲的时间","丢失的玩具城奖牌","2"),
Array("弓手的转职NPC赫丽娜来自于哪个地方","射手村","艾利涅","埃欧雷","艾琳森林","3"),
Array("冒险家职业4转的教官在什么地方","祭祀之林","神木村","塔拉森林","神秘克林逊森林","1"),
Array("以下哪个地区不属于世界旅游地区","东方神州","太初之海埃斯佩拉","新叶城","蘑菇神社","2"),
Array("毒雾组队副本的入场地在哪里","妖精森林","苔藓树丛东部森林","很深的妖精森林","艾琳森林","3"),
Array("哪里可以掉落僵尸丢失的金齿","死亡森林","艰苦洞穴","废矿区","废矿通道","3"),
Array("骑士面具是什么怪物掉落的道具","玄冰独角兽","正式骑士A","忘却的守护队长","正式骑士C","1"),
Array("月妙副本左边中间的平台上应该放什么颜色的种子","紫色","黄色","黄褐色","浅绿色","2"),
Array("海盗组队副本的第几关需要击杀怪物获得钥匙，关闭4个舱门","第1关","第3关","第4关","第5关","3"),
Array("毒雾组队副本第二关需要多少个紫色药瓶","0个","1个","2个","4个","1"),
Array("玩具组队副本第6关跳箱子的正确顺序是哪个","133221333123123","133212333123111","133221333123111","133321333123111","3"),
Array("以下哪个怪物的自身等级最高","老骷髅龙","小铜人","时间门神","皮亚奴斯","2"),
Array("冒险岛世界的现任女皇希纳斯的年龄是几岁","17岁","20岁","23岁","26岁","1"),
Array("现任女皇希纳斯的力量因为什么而觉醒了","圣地神兽的死亡而悲痛流泪","接受了阿丽莎的力量","成功的找到了世界树","打败了魔女希拉","1"),
Array("谁因为阿莉娅被杀而加入了对抗黑魔法师的英雄行列","战神阿岚","怪盗幻影佩特","龙神弗里德","夜光路米诺斯","2"),
Array("079版本中精灵的祝福最高可以达到多少级","10级","12级","15级","20级","2"),
Array("法弗纳追风者是什么武器","枪","短枪","弓","弩","3"),
Array("赫里希安精锐系列装备没有哪个部位","手套","鞋子","披风","腰带","1"),
Array("入场挑战蜈蚣王需要收集多少黑羊毛","30","50","70","100","2"),
Array("飞龙冲击波是什么职业的技能","冲锋队长","箭神","奇袭者","黑骑士","2"),
Array("飞花院是冒险岛里的什么组织","飞侠联盟领地","暗影双刀根据地","怪盗幻影的家","夜行者的训练基地","2")
);

var itemtk2 = Array(
Array("冒险岛Online是在中国发行时是哪年","2002年","2003年","2004年","2005年","3"),
Array("创世之初冒险岛的监督者为世界选择了三位超越者掌管不同领域，其中错误的是","空间","时间","光","生命","1"),
Array("冒险岛黑魔法师被哪个原军团长背叛过","恶魔猎手","班·雷昂","古瓦洛","希拉","1"),
Array("哪个不是远古时期参加封印黑魔法师的6大英雄之一？","尖兵","龙神","双弩精灵","怪盗幻影","1"),
Array("以下哪个冒险岛角色可以进行男女自由切换","狂龙战士","超能力者","神之子","林之灵","3"),
Array("以下哪个不是冒险岛格兰蒂斯世界中生活着的种族","诺巴族","超能力者","翼人族","尖耳狐狸族","2"),
Array("做完哪个任务后可以不用再做变身任务直接进入黑暗龙王龙洞入口","摩伊拉的下落","敢死队的象征","屠龙的方法","下落不明的魔法使","2"),
Array("以下哪个地区不是在冒险岛世界","克里蒂亚斯","起源之塔","啾啾岛","未来之门","3"),
Array("哪个军团长是恶魔猎手的弟弟","威尔","格里梅尔","戴米安","路西德","3"),
Array("军团长中谁曾是时间神殿的大神官","希拉","奥尔卡","路西德","阿卡伊勒","4"),
Array("时间神殿中，第一次进入下一个小地图时需要完成什么任务","消灭当前地图怪物111只","消灭当前地图的怪物333只","消灭当前地图的怪物666只","消灭当前地图的怪物999只","2"),
Array("扎昆第3个前置任务名字叫什么","冶炼邀请","废矿调查","扎昆迷宫调查","制作火焰的眼","1"),
Array("班?雷昂原本生活在什么地方","金银岛","天空之城","米纳尔森林","冰封雪域","4"),
Array("神之子的初始等级是多少","100级","120级","150级","180级","1"),
Array("冒险岛RED真红版本出现的新职业神之子，是谁创造的","阿莉娅","伦娜","希纳斯","阿丽莎","2"),
Array("冒险岛圣地现任女皇希纳斯是谁的后代","阿莉娅","阿丽莎","希拉","伦娜","1"),
Array("哪个是格兰蒂斯世界的超越者","麦格纳斯","达勒摩尔","黑魔法师","格里梅尔","2"),
Array("我会跟着你的力量的。所以...请你相信您的力量吧————是谁的名言","阿卡伊勒","希拉","路西德","麦格纳斯","4"),
Array("在埃德尔斯坦诞生的对抗黑魔法师的组织是什么","黑色之翼","晓之阵","冒险骑士团","反抗者","4"),
Array("以下哪个职业不属于冒险骑士团","魂骑士","米哈尔","豹弩游侠","奇袭者","3"),
Array("火枪手3转的职业名称叫什么","毁灭炮手","斗士","爆破手","大副","4"),
Array("谁被黑魔法师的手下军团长戴米安囚禁于鲁塔比斯","伦娜","阿莉娅","希纳斯","阿丽莎","4"),
Array("暴君手套的天然可砸卷次数是几次","1次","2次","3次","4次","2"),
Array("暴风英雄系列职业中谁其实可以算是黑魔法师的一部分","龙神","双弩精灵","隐月","夜光法师","4"),
Array("永恒系列武器的出处在哪","扎昆","黑暗龙王","品客缤","班·雷昂","3"),
Array("上古之战时，阿莉娅是被谁所杀害的","奥尔卡和斯乌","希拉","恶魔猎手","阿卡伊勒","1"),
Array("神木村的喷火龙和格瑞芬多的官方刷新时间是多久","1小时","2小时","3小时","5小时","3"),
Array("黑暗龙王的敌对龙族是哪个","九灵龙","玛瑙龙","白帝龙","喷火龙","1"),
Array("上古时期被封印的扎昆巨兽是因为什么复活的","冰封雪域的部分居民的祭拜","废弃矿坑的地壳运动","废弃矿坑的火山喷发","黑魔法师的帮助","1"),
Array("扎昆的哪只手臂会释放封印，黑暗，虚弱魔法","扎昆手臂2","扎昆手臂3","扎昆手臂4","扎昆手臂5","4"),
Array("历代的飞侠首领被称作什么","达克尔","达克奇","达克鲁","达克文","3"),
//Array("本服的跑环系统，每日最高跑环次数为几次","15次","20次","25次","30次","3"),
Array("079版本冒险岛，背包内可携带的金币上限是多少亿","15亿","21亿","50亿","99亿","2"),
//Array("本服星级强化最高可达到多少星","10星","15星","20星","25星","4"),
Array("天空组队副本第二关需要多少个碎片修复女神像","4个","5个","6个","7个","3"),
Array("风暴系列武器需要多少级才可以穿戴","90级","100级","120级","140级","2"),
Array("品客缤是从哪里被召唤出来的","虚空","异世界","天界","时间女神的镜子","4"),
Array("官方设定中，最少要达到多少级才能参加扎昆远征队","50级","60级","70级","80级","1"),
Array("冒险岛家族任务的出发地在哪","勇士部落","林中之城","冰封雪域","遗迹发掘队营地","4"),
Array("什么属性会影响死亡时下降的经验值","力量","敏捷","智力","运气","4"),
Array("暗影双刀一共要进行几次转职","5次","6次","7次","8次","3"),
Array("龙神一共可以进行几次转职","7次","8次","9次","10次","4"),
Array("079版本的冒险骑士团职业一共可以进行几次转职","2次","3次","4次","5次","2"),
//Array("现在美国国旗星条旗上有多少颗星","25","30","50","60","3"),
Array("谁以自己的存在为祭品，封印了黑魔法师","龙神","隐月","战神","恶魔猎手","2"),
Array("在金银岛开往天空之城的飞船上，有几率遇到什么怪物","蝙蝠怪","蝙蝠精","蝙蝠侠","蝙蝠魔","4"),
Array("最早拥有全屏攻击技能的职业是哪个","主教","黑骑士","神射手","船长","2"),
Array("上古之战的最终决战前，麦格纳斯夺取了谁的生命核心","恶魔猎手","古瓦洛","贝勒德","玛瑙龙","2"),
Array("威尔把神之子困在了什么地方","镜世界","起源之塔","梦之都拉克兰","万神殿","1"),
Array("以下哪个不是诺巴系列的角色","魔链影士","圣晶使徒","狂龙战士","爆莉萌天使","2"),
Array("羽化飞升后，角色等级会从250级回到多少级","120级","150级","180级","200级","4"),
Array("连环环破是哪个职业的技能","侠盗","圣骑士","冲锋队长","暗影双刀","2"),
//Array("本服1件装备砸卷最高可以达到多少次","20次","30次","50次","66次","4"),
Array("洗血洗蓝系统中，血量及蓝量的上限不能超过多少","2万","3万","4万","5万","2"),
//Array("每周几晚上会固定开放全服2小时双倍经验活动","周五","周六","周日","周一","2"),
//Array("以下哪个不是理财箱子里的特惠功能","BOSS重置","折扣商城","极品回收","专属称号","2"),
//Array("用什么东西可以兑换到漩涡系列装备","影子商团币","君主币","凯梅尔兹金币","进化币","3"),
Array("上古时期曾坐落在勇士部落地区的圣瑞尼亚王国的国王因为想获得宝石鲁碧安而召来了什么怪物","海之魔女","艾里葛斯","地狱船长","御龙魔","2"),
Array("草莓味果糖可以在10分钟内提升多少攻击和魔力","30","40","50","60","3"),
Array("挑战闹钟需要完成什么前置任务","寻找时间碎片","死守玩具城","修复扭曲的时间","丢失的玩具城奖牌","2"),
Array("弓手的转职NPC赫丽娜来自于哪个地方","射手村","艾利涅","埃欧雷","艾琳森林","3"),
Array("冒险家职业4转的教官在什么地方","祭祀之林","神木村","塔拉森林","神秘克林逊森林","1"),
Array("以下哪个地区不属于世界旅游地区","东方神州","太初之海埃斯佩拉","新叶城","蘑菇神社","2"),
Array("毒雾组队副本的入场地在哪里","妖精森林","苔藓树丛东部森林","很深的妖精森林","艾琳森林","3"),
Array("哪里可以掉落僵尸丢失的金齿","死亡森林","艰苦洞穴","废矿区","废矿通道","3"),
Array("骑士面具是什么怪物掉落的道具","玄冰独角兽","正式骑士A","忘却的守护队长","正式骑士C","1"),
Array("月妙副本左边中间的平台上应该放什么颜色的种子","紫色","黄色","黄褐色","浅绿色","2"),
Array("海盗组队副本的第几关需要击杀怪物获得钥匙，关闭4个舱门","第1关","第3关","第4关","第5关","3"),
Array("毒雾组队副本第二关需要多少个紫色药瓶","0个","1个","2个","4个","1"),
Array("玩具组队副本第6关跳箱子的正确顺序是哪个","133221333123123","133212333123111","133221333123111","133321333123111","3"),
Array("以下哪个怪物的自身等级最高","老骷髅龙","小铜人","时间门神","皮亚奴斯","2"),
Array("冒险岛世界的现任女皇希纳斯的年龄是几岁","17岁","20岁","23岁","26岁","1"),
Array("现任女皇希纳斯的力量因为什么而觉醒了","圣地神兽的死亡而悲痛流泪","接受了阿丽莎的力量","成功的找到了世界树","打败了魔女希拉","1"),
Array("谁因为阿莉娅被杀而加入了对抗黑魔法师的英雄行列","战神阿岚","怪盗幻影佩特","龙神弗里德","夜光路米诺斯","2"),
Array("079版本中精灵的祝福最高可以达到多少级","10级","12级","15级","20级","2"),
Array("法弗纳追风者是什么武器","枪","短枪","弓","弩","3"),
Array("赫里希安精锐系列装备没有哪个部位","手套","鞋子","披风","腰带","1"),
Array("入场挑战蜈蚣王需要收集多少黑羊毛","30","50","70","100","2"),
Array("飞龙冲击波是什么职业的技能","冲锋队长","箭神","奇袭者","黑骑士","2"),
Array("飞花院是冒险岛里的什么组织","飞侠联盟领地","暗影双刀根据地","怪盗幻影的家","夜行者的训练基地","2")
);
