function start() {
    // 禁止使用该功能的地图ID列表
    var forbiddenMaps = [
10000, //出生地
952010000,//怪物公园
952010100,//怪物公园
952010200,//怪物公园
952010300,//怪物公园
952010400,//怪物公园
952010500,//怪物公园
803001200, //绯红副本地图
910000000,//市场
922010900,//玩具副本最后一关
200000301,//家族中心
749030000,//旅馆
104000000,//明珠港口
100000000,//射手村落
101000000,//魔法密林
102000000,//勇士部落
103000000,//废弃都市
120000000,//诺特勒斯
140000000,//里恩
105040300,//林中之城
200000000,//天空之城
211000000,//冰峰雪域
230000000,//水下世界 
222000000,//童话村庄
220000000,//玩具城堡
701000000,//东方神州
250000000,//武陵仙境
500000000,//泰国
260000000,//阿里安特
261000000,//玛加提亚
600000000,//新叶城市
240000000,//神木村庄  
221000000,//地球防御
251000000,//百草堂地
701000200,//上海豫园
550000000,//吉隆都市
551000000,//甘榜村
801000000,//昭和村庄
540010000,//新加坡机
541000000,//新加坡船
300000000,//艾林森林
702100000,//藏经古阁
800000000,//古代神社
702090400,//英语村 
700000000,//红鸾宫
749020000,//蛋糕活动地图

701010323,//蜈蚣
104000400,//蜗牛王
100000005,//蘑菇王
800010100,//蓝蘑菇王
105070002,//僵蘑菇王
101030404,//树妖王
260010201,//仙人掌
230020100,//贝壳精
100040106,//僵尸猴
220050100,//猫头鹰
110040000,//贝壳王
250010304,//流浪熊
200010300,//艾力杰
261030000,//吉米啦
250010503,//大妙仙
222010310,//九尾狐
240020401,//喷火龙
240020101,//格瑞芬
105090900,//蝙蝠怪
107000300,//大多尔
240040401,//海兽
270010500, //追忆5
270020500, //后悔5
270030500, //忘却5
230040420,//鱼王
541020800,//树精
702060000,//妖僧
220080001,//闹钟
551030200,//熊狮
280030000,//扎昆
240060200,//黑龙	
270050100,//品克宾
327090420,//品克宾
703020101, //钻机
350060200, //贝尔
240070603, //战舰

105200110, //半半
105200210, //小丑
105200310, //女王
105200410, //贝伦

910028310, //幽灵
910028330, //死神
910028350, //威尔

350060160, //斯乌
970000106, //欧碧啦
970000104, //欧啦啦
861000050, //斯乌

555001100, //黄龙
555001101, //赤虎
555001102, //双头蛇

970050110, //狮子王
401060200, //暴君
271040100, //希纳斯


//=========================下面是远征副本地图===================
252030100, //拉瓦那--远征地图
252030000, //拉瓦那--远征地图
910540200, //艾里葛斯--远征地图
910540100, //艾里葛斯--远征地图
240093310, //蜘蛛女王--远征地图
240093300, //蜘蛛女王--远征地图
555000201, //狂暴威尔--远征地图
555000200, //狂暴威尔--远征地图
510102400, //三头犬--远征地图
510101300, //三头犬--远征地图
910025201, //蟾蜍怪--远征地图
910025200, //蟾蜍怪--远征地图
910141030, //火狐--远征地图
910141000, //火狐--远征地图
910142090, //黑暗恶狼--远征地图
910142080, //黑暗恶狼--远征地图
745090100, //始皇帝--远征地图
745010500, //始皇帝--远征地图
803200000, //敦凯尔--远征地图
803100000, //敦凯尔--远征地图
209000002, //戴米安 雪人地图--远征地图
209000001, // 戴米安  雪人地图--远征地图
910142110, //调和精灵--远征地图
910142100, //调和精灵--远征地图

910000251, //世界BOSS地图
802000101, //忘却森林--九大陆
910001000]; //匠人街
    var currentMapId = cm.getMapId();// 获取玩家当前所在地图的ID
    if (forbiddenMaps.indexOf(currentMapId) !== -1) {  // 检查当前地图是否在禁止列表中
        // 如果在禁止列表中，提示玩家并结束脚本
        //cm.sendOk("您当前所在的地图无法使用此功能。");
		cm.getPlayer().dropMessage(5, "您当前所在的地图无法使用此功能。");   //显示在聊天框 的红色个人提示
        cm.dispose();
        return;
    }

    var currentChannel = cm.getClient().getChannel();
    if (currentChannel == 8) {
        // 检测是否有道具5220002
        if (!cm.haveItem(5220002)) {
			cm.getPlayer().dropMessage(5, "对不起，你缺少特殊物品，无法进入8频道，以为你切换至1频道");
			cm.getPlayer().dropMessage(5, "对不起，你缺少特殊物品，无法进入8频道，以为你切换至1频道");
			cm.getPlayer().dropMessage(5, "对不起，你缺少特殊物品，无法进入8频道，以为你切换至1频道");
			cm.getPlayer().changeChannel(1); // 切换到频道1
            cm.dispose();
            return;
        }
    }

    // 如果不在禁止列表中，执行原有功能
    cm.getMap().setDbg(cm.getPlayer());
    cm.dispose();
}